/* automatically generated by rust-bindgen 0.66.1 */

#![allow(warnings)]

pub const UCS_ALLOCA_MAX_SIZE: u32 = 1200;
pub const UCT_COMPONENT_NAME_MAX: u32 = 16;
pub const UCT_MD_GLOBAL_ID_MAX: u32 = 256;
pub const UCT_TL_NAME_MAX: u32 = 10;
pub const UCT_MD_NAME_MAX: u32 = 16;
pub const UCT_DEVICE_NAME_MAX: u32 = 32;
pub const UCT_PENDING_REQ_PRIV_LEN: u32 = 40;
pub const UCT_TAG_PRIV_LEN: u32 = 32;
pub const UCT_AM_ID_BITS: u32 = 5;
pub const UCT_DMABUF_FD_INVALID: i32 = -1;
pub const UCS_CALLBACKQ_FAST_COUNT: u32 = 7;
pub const UCS_CALLBACKQ_ID_NULL: i32 = -1;
pub const UCT_VERNO_MAJOR: u32 = 1;
pub const UCT_VERNO_MINOR: u32 = 18;
pub const UCT_VERNO_PATCH: u32 = 1;
pub const UCT_VERNO_EXTRA: &[u8; 1] = b"\0";
pub const UCT_VERNO_STRING: &[u8; 7] = b"1.18.1\0";
pub const UCT_SCM_VERSION: &[u8; 1] = b"\0";
pub const UCT_SCM_BRANCH: &[u8; 1] = b"\0";
pub const UCT_MINOR_BIT: u32 = 16;
pub const UCT_MAJOR_BIT: u32 = 24;
pub const UCT_API: u32 = 17956864;
pub const UCS_CPU_SETSIZE: u32 = 1024;
pub const UCS_NUMA_NODE_DEFAULT: u32 = 0;
pub const UCS_NUMA_NODE_UNDEFINED: i32 = -1;
pub const UCS_SYS_DEVICE_ID_MAX: u32 = 255;
pub const UCS_SYS_DEVICE_ID_UNKNOWN: u32 = 255;
pub const UCS_SYS_BDF_NAME_MAX: u32 = 16;
pub const UCT_TL_RESOURCE_DESC_FMT: &[u8; 6] = b"%s/%s\0";
pub const UCP_ENTITY_NAME_MAX: u32 = 32;
pub const UCP_VERSION_MAJOR_SHIFT: u32 = 24;
pub const UCP_VERSION_MINOR_SHIFT: u32 = 16;
pub const UCP_API_MAJOR: u32 = 1;
pub const UCP_API_MINOR: u32 = 18;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type off_t = __off_t;
pub type socklen_t = __socklen_t;
pub type sa_family_t = ::std::os::raw::c_ushort;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sockaddr {
    pub sa_family: sa_family_t,
    pub sa_data: [::std::os::raw::c_char; 14usize],
}
#[test]
fn bindgen_test_layout_sockaddr() {
    const UNINIT: ::std::mem::MaybeUninit<sockaddr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sockaddr>(),
        16usize,
        concat!("Size of: ", stringify!(sockaddr))
    );
    assert_eq!(
        ::std::mem::align_of::<sockaddr>(),
        2usize,
        concat!("Alignment of ", stringify!(sockaddr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sa_family) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr),
            "::",
            stringify!(sa_family)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sa_data) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr),
            "::",
            stringify!(sa_data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sockaddr_storage {
    pub ss_family: sa_family_t,
    pub __ss_padding: [::std::os::raw::c_char; 118usize],
    pub __ss_align: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout_sockaddr_storage() {
    const UNINIT: ::std::mem::MaybeUninit<sockaddr_storage> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sockaddr_storage>(),
        128usize,
        concat!("Size of: ", stringify!(sockaddr_storage))
    );
    assert_eq!(
        ::std::mem::align_of::<sockaddr_storage>(),
        8usize,
        concat!("Alignment of ", stringify!(sockaddr_storage))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ss_family) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_storage),
            "::",
            stringify!(ss_family)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__ss_padding) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_storage),
            "::",
            stringify!(__ss_padding)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__ss_align) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_storage),
            "::",
            stringify!(__ss_align)
        )
    );
}
#[repr(u32)]
#[doc = " Logging levels."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ucs_log_level_t {
    UCS_LOG_LEVEL_FATAL = 0,
    UCS_LOG_LEVEL_ERROR = 1,
    UCS_LOG_LEVEL_WARN = 2,
    UCS_LOG_LEVEL_DIAG = 3,
    UCS_LOG_LEVEL_INFO = 4,
    UCS_LOG_LEVEL_DEBUG = 5,
    UCS_LOG_LEVEL_TRACE = 6,
    UCS_LOG_LEVEL_TRACE_REQ = 7,
    UCS_LOG_LEVEL_TRACE_DATA = 8,
    UCS_LOG_LEVEL_TRACE_ASYNC = 9,
    UCS_LOG_LEVEL_TRACE_FUNC = 10,
    UCS_LOG_LEVEL_TRACE_POLL = 11,
    UCS_LOG_LEVEL_LAST = 12,
    UCS_LOG_LEVEL_PRINT = 13,
}
impl ucs_async_mode_t {
    pub const UCS_ASYNC_MODE_THREAD_SPINLOCK: ucs_async_mode_t =
        ucs_async_mode_t::UCS_ASYNC_MODE_THREAD;
}
#[repr(u32)]
#[doc = " Async progress mode."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ucs_async_mode_t {
    UCS_ASYNC_MODE_SIGNAL = 0,
    UCS_ASYNC_MODE_THREAD = 1,
    UCS_ASYNC_MODE_THREAD_MUTEX = 2,
    UCS_ASYNC_MODE_POLL = 3,
    UCS_ASYNC_MODE_LAST = 4,
}
extern "C" {
    pub static mut ucs_async_mode_names: [*const ::std::os::raw::c_char; 0usize];
}
#[repr(u32)]
#[doc = " Ternary logic or Auto value."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ucs_ternary_auto_value {
    UCS_NO = 0,
    UCS_YES = 1,
    UCS_TRY = 2,
    UCS_AUTO = 3,
    UCS_TERNARY_LAST = 4,
}
#[doc = " Ternary logic or Auto value."]
pub use self::ucs_ternary_auto_value as ucs_ternary_auto_value_t;
#[repr(u32)]
#[doc = " On/Off/Auto logic value."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ucs_on_off_auto_value {
    UCS_CONFIG_OFF = 0,
    UCS_CONFIG_ON = 1,
    UCS_CONFIG_AUTO = 2,
    UCS_CONFIG_ON_OFF_LAST = 3,
}
#[doc = " On/Off/Auto logic value."]
pub use self::ucs_on_off_auto_value as ucs_on_off_auto_value_t;
#[repr(u32)]
#[doc = " Error handling modes"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ucs_handle_error_t {
    UCS_HANDLE_ERROR_BACKTRACE = 0,
    UCS_HANDLE_ERROR_FREEZE = 1,
    UCS_HANDLE_ERROR_DEBUG = 2,
    UCS_HANDLE_ERROR_NONE = 3,
    UCS_HANDLE_ERROR_LAST = 4,
}
impl ucs_config_print_flags_t {
    pub const UCS_CONFIG_PRINT_CONFIG: ucs_config_print_flags_t = ucs_config_print_flags_t(1);
}
impl ucs_config_print_flags_t {
    pub const UCS_CONFIG_PRINT_HEADER: ucs_config_print_flags_t = ucs_config_print_flags_t(2);
}
impl ucs_config_print_flags_t {
    pub const UCS_CONFIG_PRINT_DOC: ucs_config_print_flags_t = ucs_config_print_flags_t(4);
}
impl ucs_config_print_flags_t {
    pub const UCS_CONFIG_PRINT_HIDDEN: ucs_config_print_flags_t = ucs_config_print_flags_t(8);
}
impl ucs_config_print_flags_t {
    pub const UCS_CONFIG_PRINT_COMMENT_DEFAULT: ucs_config_print_flags_t =
        ucs_config_print_flags_t(16);
}
impl ::std::ops::BitOr<ucs_config_print_flags_t> for ucs_config_print_flags_t {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        ucs_config_print_flags_t(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for ucs_config_print_flags_t {
    #[inline]
    fn bitor_assign(&mut self, rhs: ucs_config_print_flags_t) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<ucs_config_print_flags_t> for ucs_config_print_flags_t {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        ucs_config_print_flags_t(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for ucs_config_print_flags_t {
    #[inline]
    fn bitand_assign(&mut self, rhs: ucs_config_print_flags_t) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[doc = " Configuration printing flags"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct ucs_config_print_flags_t(pub ::std::os::raw::c_uint);
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ucs_config_names_array_t {
    pub names: *mut *mut ::std::os::raw::c_char,
    pub count: ::std::os::raw::c_uint,
    pub pad: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_ucs_config_names_array_t() {
    const UNINIT: ::std::mem::MaybeUninit<ucs_config_names_array_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ucs_config_names_array_t>(),
        16usize,
        concat!("Size of: ", stringify!(ucs_config_names_array_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ucs_config_names_array_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ucs_config_names_array_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).names) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ucs_config_names_array_t),
            "::",
            stringify!(names)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).count) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ucs_config_names_array_t),
            "::",
            stringify!(count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pad) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ucs_config_names_array_t),
            "::",
            stringify!(pad)
        )
    );
}
#[repr(u32)]
#[doc = " Enum for representing possible modes of an \"allow-list\""]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ucs_config_allow_list_mode_t {
    UCS_CONFIG_ALLOW_LIST_ALLOW_ALL = 0,
    UCS_CONFIG_ALLOW_LIST_ALLOW = 1,
    UCS_CONFIG_ALLOW_LIST_NEGATE = 2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ucs_config_allow_list_t {
    pub array: ucs_config_names_array_t,
    pub mode: ucs_config_allow_list_mode_t,
}
#[test]
fn bindgen_test_layout_ucs_config_allow_list_t() {
    const UNINIT: ::std::mem::MaybeUninit<ucs_config_allow_list_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ucs_config_allow_list_t>(),
        24usize,
        concat!("Size of: ", stringify!(ucs_config_allow_list_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ucs_config_allow_list_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ucs_config_allow_list_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).array) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ucs_config_allow_list_t),
            "::",
            stringify!(array)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mode) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ucs_config_allow_list_t),
            "::",
            stringify!(mode)
        )
    );
}
#[doc = " @ingroup UCS_RESOURCE\n BSD socket address specification."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ucs_sock_addr {
    #[doc = "< Pointer to socket address"]
    pub addr: *const sockaddr,
    #[doc = "< Address length"]
    pub addrlen: socklen_t,
}
#[test]
fn bindgen_test_layout_ucs_sock_addr() {
    const UNINIT: ::std::mem::MaybeUninit<ucs_sock_addr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ucs_sock_addr>(),
        16usize,
        concat!("Size of: ", stringify!(ucs_sock_addr))
    );
    assert_eq!(
        ::std::mem::align_of::<ucs_sock_addr>(),
        8usize,
        concat!("Alignment of ", stringify!(ucs_sock_addr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ucs_sock_addr),
            "::",
            stringify!(addr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addrlen) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ucs_sock_addr),
            "::",
            stringify!(addrlen)
        )
    );
}
#[doc = " @ingroup UCS_RESOURCE\n BSD socket address specification."]
pub type ucs_sock_addr_t = ucs_sock_addr;
#[doc = " Logging component."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ucs_log_component_config {
    pub log_level: ucs_log_level_t,
    pub name: [::std::os::raw::c_char; 16usize],
    pub file_filter: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_ucs_log_component_config() {
    const UNINIT: ::std::mem::MaybeUninit<ucs_log_component_config> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ucs_log_component_config>(),
        32usize,
        concat!("Size of: ", stringify!(ucs_log_component_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ucs_log_component_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ucs_log_component_config))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).log_level) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ucs_log_component_config),
            "::",
            stringify!(log_level)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ucs_log_component_config),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).file_filter) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ucs_log_component_config),
            "::",
            stringify!(file_filter)
        )
    );
}
#[doc = " Logging component."]
pub type ucs_log_component_config_t = ucs_log_component_config;
#[repr(i8)]
#[doc = " @ingroup UCS_RESOURCE\n @brief Status codes\n\n @note In order to evaluate the necessary steps to recover from a certain\n error, all error codes which can be returned by the external API are grouped\n by the largest entity permanently effected by the error. Each group ranges\n between its UCS_ERR_FIRST_<name> and UCS_ERR_LAST_<name> enum values.\n For example, if a link fails it may be sufficient to destroy (and possibly\n replace) it, in contrast to an endpoint-level error."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ucs_status_t {
    UCS_OK = 0,
    UCS_INPROGRESS = 1,
    UCS_ERR_NO_MESSAGE = -1,
    UCS_ERR_NO_RESOURCE = -2,
    UCS_ERR_IO_ERROR = -3,
    UCS_ERR_NO_MEMORY = -4,
    UCS_ERR_INVALID_PARAM = -5,
    UCS_ERR_UNREACHABLE = -6,
    UCS_ERR_INVALID_ADDR = -7,
    UCS_ERR_NOT_IMPLEMENTED = -8,
    UCS_ERR_MESSAGE_TRUNCATED = -9,
    UCS_ERR_NO_PROGRESS = -10,
    UCS_ERR_BUFFER_TOO_SMALL = -11,
    UCS_ERR_NO_ELEM = -12,
    UCS_ERR_SOME_CONNECTS_FAILED = -13,
    UCS_ERR_NO_DEVICE = -14,
    UCS_ERR_BUSY = -15,
    UCS_ERR_CANCELED = -16,
    UCS_ERR_SHMEM_SEGMENT = -17,
    UCS_ERR_ALREADY_EXISTS = -18,
    UCS_ERR_OUT_OF_RANGE = -19,
    UCS_ERR_TIMED_OUT = -20,
    UCS_ERR_EXCEEDS_LIMIT = -21,
    UCS_ERR_UNSUPPORTED = -22,
    UCS_ERR_REJECTED = -23,
    UCS_ERR_NOT_CONNECTED = -24,
    UCS_ERR_CONNECTION_RESET = -25,
    UCS_ERR_FIRST_LINK_FAILURE = -40,
    UCS_ERR_LAST_LINK_FAILURE = -59,
    UCS_ERR_FIRST_ENDPOINT_FAILURE = -60,
    UCS_ERR_ENDPOINT_TIMEOUT = -80,
    UCS_ERR_LAST_ENDPOINT_FAILURE = -89,
    UCS_ERR_LAST = -100,
}
#[doc = " @ingroup UCS_RESOURCE\n @brief Status pointer\n\n A pointer can represent one of these values:\n - NULL / UCS_OK\n - Error code pointer (UCS_ERR_xx)\n - Valid pointer"]
pub type ucs_status_ptr_t = *mut ::std::os::raw::c_void;
extern "C" {
    #[doc = " @param  status UCS status code.\n\n @return Verbose status message."]
    pub fn ucs_status_string(status: ucs_status_t) -> *const ::std::os::raw::c_char;
}
#[repr(u32)]
#[doc = " @ingroup UCT_AM\n @brief Trace types for active message tracer."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum uct_am_trace_type {
    UCT_AM_TRACE_TYPE_SEND = 0,
    UCT_AM_TRACE_TYPE_RECV = 1,
    UCT_AM_TRACE_TYPE_SEND_DROP = 2,
    UCT_AM_TRACE_TYPE_RECV_DROP = 3,
    UCT_AM_TRACE_TYPE_LAST = 4,
}
impl uct_cb_param_flags {
    pub const UCT_CB_PARAM_FLAG_DESC: uct_cb_param_flags = uct_cb_param_flags(1);
}
impl uct_cb_param_flags {
    pub const UCT_CB_PARAM_FLAG_FIRST: uct_cb_param_flags = uct_cb_param_flags(2);
}
impl uct_cb_param_flags {
    pub const UCT_CB_PARAM_FLAG_MORE: uct_cb_param_flags = uct_cb_param_flags(4);
}
impl ::std::ops::BitOr<uct_cb_param_flags> for uct_cb_param_flags {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        uct_cb_param_flags(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for uct_cb_param_flags {
    #[inline]
    fn bitor_assign(&mut self, rhs: uct_cb_param_flags) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<uct_cb_param_flags> for uct_cb_param_flags {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        uct_cb_param_flags(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for uct_cb_param_flags {
    #[inline]
    fn bitand_assign(&mut self, rhs: uct_cb_param_flags) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[doc = " @ingroup UCT_RESOURCE\n @brief Flags for active message and tag-matching offload callbacks (callback's parameters).\n\n If UCT_CB_PARAM_FLAG_DESC flag is enabled, then data is part of a descriptor\n which includes the user-defined rx_headroom, and the callback may return\n UCS_INPROGRESS and hold on to that descriptor. Otherwise, the data can't be\n used outside the callback. If needed, the data must be copied-out.\n\n@verbatim\ndescriptor    data\n|             |\n+-------------+-------------------------+\n| rx_headroom | payload                 |\n+-------------+-------------------------+\n@endverbatim\n\n UCT_CB_PARAM_FLAG_FIRST and UCT_CB_PARAM_FLAG_MORE flags are relevant for\n @ref uct_tag_unexp_eager_cb_t callback only. The former value indicates that\n the data is the first fragment of the message. The latter value means that\n more fragments of the message yet to be delivered."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct uct_cb_param_flags(pub ::std::os::raw::c_uint);
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uct_component {
    _unused: [u8; 0],
}
#[doc = " @addtogroup UCT_RESOURCE\n @{"]
pub type uct_component_h = *mut uct_component;
pub type uct_iface_h = *mut uct_iface;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uct_iface_config {
    _unused: [u8; 0],
}
pub type uct_iface_config_t = uct_iface_config;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uct_md_config {
    _unused: [u8; 0],
}
pub type uct_md_config_t = uct_md_config;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uct_cm_config {
    _unused: [u8; 0],
}
pub type uct_cm_config_t = uct_cm_config;
pub type uct_ep_h = *mut uct_ep;
pub type uct_mem_h = *mut ::std::os::raw::c_void;
pub type uct_rkey_t = usize;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uct_md {
    _unused: [u8; 0],
}
pub type uct_md_h = *mut uct_md;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uct_md_ops {
    _unused: [u8; 0],
}
pub type uct_md_ops_t = uct_md_ops;
pub type uct_rkey_ctx_h = *mut ::std::os::raw::c_void;
#[doc = " @ingroup UCT_RESOURCE\n @brief Interface attributes: capabilities and limitations."]
pub type uct_iface_attr_t = uct_iface_attr;
#[doc = " @ingroup UCT_RESOURCE\n @brief Parameters used for interface creation.\n\n This structure should be allocated by the user and should be passed to\n @ref uct_iface_open. User has to initialize all fields of this structure."]
pub type uct_iface_params_t = uct_iface_params;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uct_ep_attr {
    _unused: [u8; 0],
}
pub type uct_ep_attr_t = uct_ep_attr;
#[doc = " @ingroup UCT_MD\n @brief  Memory domain attributes.\n\n This structure defines the attributes of a Memory Domain which includes\n maximum memory that can be allocated, credentials required for accessing the memory,\n CPU mask indicating the proximity of CPUs, and bitmaps indicating the types\n of memory (CPU/CUDA/ROCM) that can be detected, allocated and accessed."]
pub type uct_md_attr_t = uct_md_attr;
#[doc = " @ingroup UCT_RESOURCE\n @brief Completion handle.\n\n This structure should be allocated by the user and can be passed to communication\n primitives. The user must initialize all fields of the structure.\n  If the operation returns UCS_INPROGRESS, this structure will be in use by the\n transport until the operation completes. When the operation completes, \"count\"\n field is decremented by 1, and whenever it reaches 0 - the callback is called.\n\n Notes:\n  - The same structure can be passed multiple times to communication functions\n    without the need to wait for completion.\n  - If the number of operations is smaller than the initial value of the counter,\n    the callback will not be called at all, so it may be left undefined.\n  - status field is required to track the first time the error occurred, and\n    report it via a callback when count reaches 0."]
pub type uct_completion_t = uct_completion;
#[doc = " @ingroup UCT_RESOURCE\n @brief Pending request.\n\n This structure should be passed to @ref uct_ep_pending_add() and is used to signal\n new available resources back to user."]
pub type uct_pending_req_t = uct_pending_req;
pub type uct_worker_h = *mut uct_worker;
pub type uct_md_t = uct_md;
#[doc = " @ingroup UCT_AM\n @brief Trace types for active message tracer."]
pub use self::uct_am_trace_type as uct_am_trace_type_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uct_device_addr {
    _unused: [u8; 0],
}
pub type uct_device_addr_t = uct_device_addr;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uct_iface_addr {
    _unused: [u8; 0],
}
pub type uct_iface_addr_t = uct_iface_addr;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uct_ep_addr {
    _unused: [u8; 0],
}
pub type uct_ep_addr_t = uct_ep_addr;
#[doc = " @ingroup UCT_RESOURCE\n @brief Parameters for creating a UCT endpoint by @ref uct_ep_create"]
pub type uct_ep_params_t = uct_ep_params;
#[doc = " @ingroup UCT_CLIENT_SERVER\n @brief Parameters for connecting a UCT endpoint by @ref uct_ep_connect."]
pub type uct_ep_connect_params_t = uct_ep_connect_params;
#[doc = " @ingroup UCT_CLIENT_SERVER\n @brief Connection manager attributes, capabilities and limitations."]
pub type uct_cm_attr_t = uct_cm_attr;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uct_cm {
    _unused: [u8; 0],
}
pub type uct_cm_t = uct_cm;
pub type uct_cm_h = *mut uct_cm_t;
#[doc = " @ingroup UCT_CLIENT_SERVER\n @brief UCT listener attributes, capabilities and limitations."]
pub type uct_listener_attr_t = uct_listener_attr;
pub type uct_listener_h = *mut uct_listener;
#[doc = " @ingroup UCT_CLIENT_SERVER\n @brief Parameters for creating a listener object @ref uct_listener_h by\n @ref uct_listener_create"]
pub type uct_listener_params_t = uct_listener_params;
#[doc = " @ingroup UCT_TAG\n @brief Posted tag context.\n\n Tag context is an object which tracks a tag posted to the transport. It\n contains callbacks for matching events on this tag."]
pub type uct_tag_context_t = uct_tag_context;
pub type uct_tag_t = u64;
pub type uct_worker_cb_id_t = ::std::os::raw::c_int;
pub type uct_conn_request_h = *mut ::std::os::raw::c_void;
#[doc = " @ingroup UCT_RESOURCE\n @brief Structure for scatter-gather I/O.\n\n Specifies a list of buffers which can be used within a single data transfer\n function call.\n\n@verbatim\nbuffer\n|\n+-----------+-------+-----------+-------+-----------+\n|  payload  | empty |  payload  | empty |  payload  |\n+-----------+-------+-----------+-------+-----------+\n|<-length-->|       |<-length-->|       |<-length-->|\n|<---- stride ----->|<---- stride ----->|\n@endverbatim\n\n @note The sum of lengths in all iov list must be less or equal to max_zcopy\n       of the respective communication operation.\n @note If @a length or @a count are zero, the memory pointed to by @a buffer\n       will not be accessed. Otherwise, @a buffer must point to valid memory.\n\n @note If @a count is one, every iov entry specifies a single contiguous data block\n\n @note If @a count > 1, each iov entry specifies a strided block of @a count\n       elements and distance of @a stride byte between consecutive elements\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uct_iov {
    #[doc = "< Data buffer"]
    pub buffer: *mut ::std::os::raw::c_void,
    #[doc = "< Length of the payload in bytes"]
    pub length: usize,
    #[doc = "< Local memory key descriptor for the data"]
    pub memh: uct_mem_h,
    #[doc = "< Stride between beginnings of payload elements in\nthe buffer in bytes"]
    pub stride: usize,
    #[doc = "< Number of payload elements in the buffer"]
    pub count: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_uct_iov() {
    const UNINIT: ::std::mem::MaybeUninit<uct_iov> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<uct_iov>(),
        40usize,
        concat!("Size of: ", stringify!(uct_iov))
    );
    assert_eq!(
        ::std::mem::align_of::<uct_iov>(),
        8usize,
        concat!("Alignment of ", stringify!(uct_iov))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).buffer) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iov),
            "::",
            stringify!(buffer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).length) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iov),
            "::",
            stringify!(length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).memh) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iov),
            "::",
            stringify!(memh)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stride) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iov),
            "::",
            stringify!(stride)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).count) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iov),
            "::",
            stringify!(count)
        )
    );
}
#[doc = " @ingroup UCT_RESOURCE\n @brief Structure for scatter-gather I/O.\n\n Specifies a list of buffers which can be used within a single data transfer\n function call.\n\n@verbatim\nbuffer\n|\n+-----------+-------+-----------+-------+-----------+\n|  payload  | empty |  payload  | empty |  payload  |\n+-----------+-------+-----------+-------+-----------+\n|<-length-->|       |<-length-->|       |<-length-->|\n|<---- stride ----->|<---- stride ----->|\n@endverbatim\n\n @note The sum of lengths in all iov list must be less or equal to max_zcopy\n       of the respective communication operation.\n @note If @a length or @a count are zero, the memory pointed to by @a buffer\n       will not be accessed. Otherwise, @a buffer must point to valid memory.\n\n @note If @a count is one, every iov entry specifies a single contiguous data block\n\n @note If @a count > 1, each iov entry specifies a strided block of @a count\n       elements and distance of @a stride byte between consecutive elements\n"]
pub type uct_iov_t = uct_iov;
impl uct_cm_ep_priv_data_pack_args_field {
    #[doc = " Enables @ref uct_cm_ep_priv_data_pack_args::dev_name\n  Indicates that dev_name field in uct_cm_ep_priv_data_pack_args_t is\n  valid."]
    pub const UCT_CM_EP_PRIV_DATA_PACK_ARGS_FIELD_DEVICE_NAME: uct_cm_ep_priv_data_pack_args_field =
        uct_cm_ep_priv_data_pack_args_field(1);
}
impl ::std::ops::BitOr<uct_cm_ep_priv_data_pack_args_field>
    for uct_cm_ep_priv_data_pack_args_field
{
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        uct_cm_ep_priv_data_pack_args_field(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for uct_cm_ep_priv_data_pack_args_field {
    #[inline]
    fn bitor_assign(&mut self, rhs: uct_cm_ep_priv_data_pack_args_field) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<uct_cm_ep_priv_data_pack_args_field>
    for uct_cm_ep_priv_data_pack_args_field
{
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        uct_cm_ep_priv_data_pack_args_field(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for uct_cm_ep_priv_data_pack_args_field {
    #[inline]
    fn bitand_assign(&mut self, rhs: uct_cm_ep_priv_data_pack_args_field) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[doc = " @ingroup UCT_CLIENT_SERVER\n @brief Client-Server private data pack callback arguments field mask.\n\n The enumeration allows specifying which fields in\n @ref uct_cm_ep_priv_data_pack_args are present, for backward compatibility\n support."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct uct_cm_ep_priv_data_pack_args_field(pub ::std::os::raw::c_uint);
impl uct_cm_ep_resolve_args_field {
    #[doc = " Indicates that @ref uct_cm_ep_resolve_args::dev_name is valid."]
    pub const UCT_CM_EP_RESOLVE_ARGS_FIELD_DEV_NAME: uct_cm_ep_resolve_args_field =
        uct_cm_ep_resolve_args_field(1);
}
impl uct_cm_ep_resolve_args_field {
    #[doc = " Indicates that @ref uct_cm_ep_resolve_args::status is valid."]
    pub const UCT_CM_EP_RESOLVE_ARGS_FIELD_STATUS: uct_cm_ep_resolve_args_field =
        uct_cm_ep_resolve_args_field(2);
}
impl ::std::ops::BitOr<uct_cm_ep_resolve_args_field> for uct_cm_ep_resolve_args_field {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        uct_cm_ep_resolve_args_field(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for uct_cm_ep_resolve_args_field {
    #[inline]
    fn bitor_assign(&mut self, rhs: uct_cm_ep_resolve_args_field) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<uct_cm_ep_resolve_args_field> for uct_cm_ep_resolve_args_field {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        uct_cm_ep_resolve_args_field(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for uct_cm_ep_resolve_args_field {
    #[inline]
    fn bitand_assign(&mut self, rhs: uct_cm_ep_resolve_args_field) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[doc = " @ingroup UCT_CLIENT_SERVER\n @brief Client-Server resolve callback arguments field mask.\n\n The enumeration allows specifying which fields in\n @ref uct_cm_ep_resolve_args are present, for backward compatibility support."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct uct_cm_ep_resolve_args_field(pub ::std::os::raw::c_uint);
#[doc = " @ingroup UCT_CLIENT_SERVER\n @brief Arguments to the client-server private data pack callback.\n\n Used with the client-server API on a connection manager."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uct_cm_ep_priv_data_pack_args {
    #[doc = " Mask of valid fields in this structure, using bits from\n @ref uct_cm_ep_priv_data_pack_args_field.\n Fields not specified by this mask should not be accessed by the callback."]
    pub field_mask: u64,
    #[doc = " Device name. This routine may fill the user's private data according to\n the given device name. The device name that is passed to this routine,\n corresponds to @ref uct_tl_resource_desc_t::dev_name as returned from\n @ref uct_md_query_tl_resources."]
    pub dev_name: [::std::os::raw::c_char; 32usize],
}
#[test]
fn bindgen_test_layout_uct_cm_ep_priv_data_pack_args() {
    const UNINIT: ::std::mem::MaybeUninit<uct_cm_ep_priv_data_pack_args> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<uct_cm_ep_priv_data_pack_args>(),
        40usize,
        concat!("Size of: ", stringify!(uct_cm_ep_priv_data_pack_args))
    );
    assert_eq!(
        ::std::mem::align_of::<uct_cm_ep_priv_data_pack_args>(),
        8usize,
        concat!("Alignment of ", stringify!(uct_cm_ep_priv_data_pack_args))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).field_mask) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_cm_ep_priv_data_pack_args),
            "::",
            stringify!(field_mask)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dev_name) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_cm_ep_priv_data_pack_args),
            "::",
            stringify!(dev_name)
        )
    );
}
#[doc = " @ingroup UCT_CLIENT_SERVER\n @brief Arguments to the client-server private data pack callback.\n\n Used with the client-server API on a connection manager."]
pub type uct_cm_ep_priv_data_pack_args_t = uct_cm_ep_priv_data_pack_args;
#[doc = " @ingroup UCT_CLIENT_SERVER\n @brief Arguments to the client-server resolved callback.\n\n Used with the client-server API on a connection manager."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uct_cm_ep_resolve_args {
    #[doc = " Mask of valid fields in this structure, using bits from\n @ref uct_cm_ep_resolve_args_field.\n Fields not specified by this mask should not be accessed by the callback."]
    pub field_mask: u64,
    #[doc = " Device name indicates the device that the endpoint was bound to during\n address and route resolution. The device name that is passed to this\n callback corresponds to @ref uct_tl_resource_desc_t::dev_name as\n returned from @ref uct_md_query_tl_resources."]
    pub dev_name: [::std::os::raw::c_char; 32usize],
    #[doc = " Indicates address resolution status:\n UCS_OK                   - address of the remote server was resolved\n                            successfully.\n UCS_ERR_UNREACHABLE      - the remote server is unreachable.\n Otherwise                - indicates an internal connection establishment\n                            error on the local (client) side."]
    pub status: ucs_status_t,
}
#[test]
fn bindgen_test_layout_uct_cm_ep_resolve_args() {
    const UNINIT: ::std::mem::MaybeUninit<uct_cm_ep_resolve_args> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<uct_cm_ep_resolve_args>(),
        48usize,
        concat!("Size of: ", stringify!(uct_cm_ep_resolve_args))
    );
    assert_eq!(
        ::std::mem::align_of::<uct_cm_ep_resolve_args>(),
        8usize,
        concat!("Alignment of ", stringify!(uct_cm_ep_resolve_args))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).field_mask) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_cm_ep_resolve_args),
            "::",
            stringify!(field_mask)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dev_name) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_cm_ep_resolve_args),
            "::",
            stringify!(dev_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_cm_ep_resolve_args),
            "::",
            stringify!(status)
        )
    );
}
#[doc = " @ingroup UCT_CLIENT_SERVER\n @brief Arguments to the client-server resolved callback.\n\n Used with the client-server API on a connection manager."]
pub type uct_cm_ep_resolve_args_t = uct_cm_ep_resolve_args;
impl uct_cm_remote_data_field {
    #[doc = " Enables @ref uct_cm_remote_data::dev_addr"]
    pub const UCT_CM_REMOTE_DATA_FIELD_DEV_ADDR: uct_cm_remote_data_field =
        uct_cm_remote_data_field(1);
}
impl uct_cm_remote_data_field {
    #[doc = " Enables @ref uct_cm_remote_data::dev_addr_length"]
    pub const UCT_CM_REMOTE_DATA_FIELD_DEV_ADDR_LENGTH: uct_cm_remote_data_field =
        uct_cm_remote_data_field(2);
}
impl uct_cm_remote_data_field {
    #[doc = " Enables @ref uct_cm_remote_data::conn_priv_data"]
    pub const UCT_CM_REMOTE_DATA_FIELD_CONN_PRIV_DATA: uct_cm_remote_data_field =
        uct_cm_remote_data_field(4);
}
impl uct_cm_remote_data_field {
    #[doc = " Enables @ref uct_cm_remote_data::conn_priv_data_length"]
    pub const UCT_CM_REMOTE_DATA_FIELD_CONN_PRIV_DATA_LENGTH: uct_cm_remote_data_field =
        uct_cm_remote_data_field(8);
}
impl ::std::ops::BitOr<uct_cm_remote_data_field> for uct_cm_remote_data_field {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        uct_cm_remote_data_field(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for uct_cm_remote_data_field {
    #[inline]
    fn bitor_assign(&mut self, rhs: uct_cm_remote_data_field) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<uct_cm_remote_data_field> for uct_cm_remote_data_field {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        uct_cm_remote_data_field(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for uct_cm_remote_data_field {
    #[inline]
    fn bitand_assign(&mut self, rhs: uct_cm_remote_data_field) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[doc = " @ingroup UCT_CLIENT_SERVER\n @brief Remote data attributes field mask.\n\n The enumeration allows specifying which fields in @ref uct_cm_remote_data are\n present, for backward compatibility support."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct uct_cm_remote_data_field(pub ::std::os::raw::c_uint);
#[doc = " @ingroup UCT_CLIENT_SERVER\n @brief Data received from the remote peer.\n\n The remote peer's device address, the data received from it and their lengths.\n Used with the client-server API on a connection manager."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uct_cm_remote_data {
    #[doc = " Mask of valid fields in this structure, using bits from\n @ref uct_cm_remote_data_field. Fields not specified by this mask\n will be ignored."]
    pub field_mask: u64,
    #[doc = " Device address of the remote peer."]
    pub dev_addr: *const uct_device_addr_t,
    #[doc = " Length of the remote device address."]
    pub dev_addr_length: usize,
    #[doc = " Pointer to the received data. This is the private data that was passed to\n @ref uct_ep_params_t::sockaddr_pack_cb."]
    pub conn_priv_data: *const ::std::os::raw::c_void,
    #[doc = " Length of the received data from the peer."]
    pub conn_priv_data_length: usize,
}
#[test]
fn bindgen_test_layout_uct_cm_remote_data() {
    const UNINIT: ::std::mem::MaybeUninit<uct_cm_remote_data> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<uct_cm_remote_data>(),
        40usize,
        concat!("Size of: ", stringify!(uct_cm_remote_data))
    );
    assert_eq!(
        ::std::mem::align_of::<uct_cm_remote_data>(),
        8usize,
        concat!("Alignment of ", stringify!(uct_cm_remote_data))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).field_mask) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_cm_remote_data),
            "::",
            stringify!(field_mask)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dev_addr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_cm_remote_data),
            "::",
            stringify!(dev_addr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dev_addr_length) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_cm_remote_data),
            "::",
            stringify!(dev_addr_length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).conn_priv_data) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_cm_remote_data),
            "::",
            stringify!(conn_priv_data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).conn_priv_data_length) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_cm_remote_data),
            "::",
            stringify!(conn_priv_data_length)
        )
    );
}
#[doc = " @ingroup UCT_CLIENT_SERVER\n @brief Data received from the remote peer.\n\n The remote peer's device address, the data received from it and their lengths.\n Used with the client-server API on a connection manager."]
pub type uct_cm_remote_data_t = uct_cm_remote_data;
impl uct_cm_listener_conn_request_args_field {
    #[doc = " Enables @ref uct_cm_listener_conn_request_args::dev_name\n  Indicates that dev_name field in uct_cm_listener_conn_request_args_t is\n  valid."]
    pub const UCT_CM_LISTENER_CONN_REQUEST_ARGS_FIELD_DEV_NAME:
        uct_cm_listener_conn_request_args_field = uct_cm_listener_conn_request_args_field(1);
}
impl uct_cm_listener_conn_request_args_field {
    #[doc = " Enables @ref uct_cm_listener_conn_request_args::conn_request\n  Indicates that conn_request field in uct_cm_listener_conn_request_args_t\n  is valid."]
    pub const UCT_CM_LISTENER_CONN_REQUEST_ARGS_FIELD_CONN_REQUEST:
        uct_cm_listener_conn_request_args_field = uct_cm_listener_conn_request_args_field(2);
}
impl uct_cm_listener_conn_request_args_field {
    #[doc = " Enables @ref uct_cm_listener_conn_request_args::remote_data\n  Indicates that remote_data field in uct_cm_listener_conn_request_args_t\n  is valid."]
    pub const UCT_CM_LISTENER_CONN_REQUEST_ARGS_FIELD_REMOTE_DATA:
        uct_cm_listener_conn_request_args_field = uct_cm_listener_conn_request_args_field(4);
}
impl uct_cm_listener_conn_request_args_field {
    #[doc = " Enables @ref uct_cm_listener_conn_request_args::client_address\n  Indicates that client_address field in uct_cm_listener_conn_request_args_t\n  is valid."]
    pub const UCT_CM_LISTENER_CONN_REQUEST_ARGS_FIELD_CLIENT_ADDR:
        uct_cm_listener_conn_request_args_field = uct_cm_listener_conn_request_args_field(8);
}
impl ::std::ops::BitOr<uct_cm_listener_conn_request_args_field>
    for uct_cm_listener_conn_request_args_field
{
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        uct_cm_listener_conn_request_args_field(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for uct_cm_listener_conn_request_args_field {
    #[inline]
    fn bitor_assign(&mut self, rhs: uct_cm_listener_conn_request_args_field) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<uct_cm_listener_conn_request_args_field>
    for uct_cm_listener_conn_request_args_field
{
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        uct_cm_listener_conn_request_args_field(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for uct_cm_listener_conn_request_args_field {
    #[inline]
    fn bitand_assign(&mut self, rhs: uct_cm_listener_conn_request_args_field) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[doc = " @ingroup UCT_CLIENT_SERVER\n @brief Listener's connection request callback arguments field mask.\n\n The enumeration allows specifying which fields in\n @ref uct_cm_listener_conn_request_args are present, for backward compatibility\n support."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct uct_cm_listener_conn_request_args_field(pub ::std::os::raw::c_uint);
#[doc = " @ingroup UCT_CLIENT_SERVER\n @brief Arguments to the listener's connection request callback.\n\n The local device name, connection request handle and the data the client sent.\n Used with the client-server API on a connection manager."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uct_cm_listener_conn_request_args {
    #[doc = " Mask of valid fields in this structure, using bits from\n @ref uct_cm_listener_conn_request_args_field.\n Fields not specified by this mask should not be accessed by the callback."]
    pub field_mask: u64,
    #[doc = " Local device name which handles the incoming connection request."]
    pub dev_name: [::std::os::raw::c_char; 32usize],
    #[doc = " Connection request handle. Can be passed to this callback from the\n transport and will be used by it to accept or reject the connection\n request from the client."]
    pub conn_request: uct_conn_request_h,
    #[doc = " Remote data from the client."]
    pub remote_data: *const uct_cm_remote_data_t,
    #[doc = " Client's address."]
    pub client_address: ucs_sock_addr_t,
}
#[test]
fn bindgen_test_layout_uct_cm_listener_conn_request_args() {
    const UNINIT: ::std::mem::MaybeUninit<uct_cm_listener_conn_request_args> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<uct_cm_listener_conn_request_args>(),
        72usize,
        concat!("Size of: ", stringify!(uct_cm_listener_conn_request_args))
    );
    assert_eq!(
        ::std::mem::align_of::<uct_cm_listener_conn_request_args>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(uct_cm_listener_conn_request_args)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).field_mask) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_cm_listener_conn_request_args),
            "::",
            stringify!(field_mask)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dev_name) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_cm_listener_conn_request_args),
            "::",
            stringify!(dev_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).conn_request) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_cm_listener_conn_request_args),
            "::",
            stringify!(conn_request)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).remote_data) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_cm_listener_conn_request_args),
            "::",
            stringify!(remote_data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).client_address) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_cm_listener_conn_request_args),
            "::",
            stringify!(client_address)
        )
    );
}
#[doc = " @ingroup UCT_CLIENT_SERVER\n @brief Arguments to the listener's connection request callback.\n\n The local device name, connection request handle and the data the client sent.\n Used with the client-server API on a connection manager."]
pub type uct_cm_listener_conn_request_args_t = uct_cm_listener_conn_request_args;
impl uct_cm_ep_client_connect_args_field {
    #[doc = " Enables @ref uct_cm_ep_client_connect_args::remote_data"]
    pub const UCT_CM_EP_CLIENT_CONNECT_ARGS_FIELD_REMOTE_DATA: uct_cm_ep_client_connect_args_field =
        uct_cm_ep_client_connect_args_field(1);
}
impl uct_cm_ep_client_connect_args_field {
    #[doc = " Enables @ref uct_cm_ep_client_connect_args::status"]
    pub const UCT_CM_EP_CLIENT_CONNECT_ARGS_FIELD_STATUS: uct_cm_ep_client_connect_args_field =
        uct_cm_ep_client_connect_args_field(2);
}
impl ::std::ops::BitOr<uct_cm_ep_client_connect_args_field>
    for uct_cm_ep_client_connect_args_field
{
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        uct_cm_ep_client_connect_args_field(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for uct_cm_ep_client_connect_args_field {
    #[inline]
    fn bitor_assign(&mut self, rhs: uct_cm_ep_client_connect_args_field) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<uct_cm_ep_client_connect_args_field>
    for uct_cm_ep_client_connect_args_field
{
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        uct_cm_ep_client_connect_args_field(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for uct_cm_ep_client_connect_args_field {
    #[inline]
    fn bitand_assign(&mut self, rhs: uct_cm_ep_client_connect_args_field) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[doc = " @ingroup UCT_CLIENT_SERVER\n @brief Field mask flags for client-side connection established callback.\n\n The enumeration allows specifying which fields in\n @ref uct_cm_ep_client_connect_args are present, for backward compatibility\n support."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct uct_cm_ep_client_connect_args_field(pub ::std::os::raw::c_uint);
#[doc = " @ingroup UCT_CLIENT_SERVER\n @brief Arguments to the client's connect callback.\n\n Used with the client-server API on a connection manager."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uct_cm_ep_client_connect_args {
    #[doc = " Mask of valid fields in this structure, using bits from\n @ref uct_cm_ep_client_connect_args_field.\n Fields not specified by this mask should not be accessed by the callback."]
    pub field_mask: u64,
    #[doc = " Remote data from the server."]
    pub remote_data: *const uct_cm_remote_data_t,
    #[doc = " Indicates the connection establishment response from the remote server:\n UCS_OK                   - the remote server accepted the connection request.\n UCS_ERR_REJECTED         - the remote server rejected the connection request.\n UCS_ERR_CONNECTION_RESET - the server's connection was reset during\n                            the connection establishment to the client.\n Otherwise                - indicates an internal connection establishment\n                            error on the local (client) side."]
    pub status: ucs_status_t,
}
#[test]
fn bindgen_test_layout_uct_cm_ep_client_connect_args() {
    const UNINIT: ::std::mem::MaybeUninit<uct_cm_ep_client_connect_args> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<uct_cm_ep_client_connect_args>(),
        24usize,
        concat!("Size of: ", stringify!(uct_cm_ep_client_connect_args))
    );
    assert_eq!(
        ::std::mem::align_of::<uct_cm_ep_client_connect_args>(),
        8usize,
        concat!("Alignment of ", stringify!(uct_cm_ep_client_connect_args))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).field_mask) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_cm_ep_client_connect_args),
            "::",
            stringify!(field_mask)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).remote_data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_cm_ep_client_connect_args),
            "::",
            stringify!(remote_data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_cm_ep_client_connect_args),
            "::",
            stringify!(status)
        )
    );
}
#[doc = " @ingroup UCT_CLIENT_SERVER\n @brief Arguments to the client's connect callback.\n\n Used with the client-server API on a connection manager."]
pub type uct_cm_ep_client_connect_args_t = uct_cm_ep_client_connect_args;
impl uct_cm_ep_server_conn_notify_args_field {
    #[doc = " Enables @ref uct_cm_ep_server_conn_notify_args::status\n  Indicates that status field in uct_cm_ep_server_conn_notify_args_t is valid."]
    pub const UCT_CM_EP_SERVER_CONN_NOTIFY_ARGS_FIELD_STATUS:
        uct_cm_ep_server_conn_notify_args_field = uct_cm_ep_server_conn_notify_args_field(1);
}
impl ::std::ops::BitOr<uct_cm_ep_server_conn_notify_args_field>
    for uct_cm_ep_server_conn_notify_args_field
{
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        uct_cm_ep_server_conn_notify_args_field(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for uct_cm_ep_server_conn_notify_args_field {
    #[inline]
    fn bitor_assign(&mut self, rhs: uct_cm_ep_server_conn_notify_args_field) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<uct_cm_ep_server_conn_notify_args_field>
    for uct_cm_ep_server_conn_notify_args_field
{
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        uct_cm_ep_server_conn_notify_args_field(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for uct_cm_ep_server_conn_notify_args_field {
    #[inline]
    fn bitand_assign(&mut self, rhs: uct_cm_ep_server_conn_notify_args_field) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[doc = " @ingroup UCT_CLIENT_SERVER\n @brief Field mask flags for server-side connection established notification\n        callback.\n\n The enumeration allows specifying which fields in\n @ref uct_cm_ep_server_conn_notify_args are present, for backward compatibility\n support."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct uct_cm_ep_server_conn_notify_args_field(pub ::std::os::raw::c_uint);
#[doc = " @ingroup UCT_CLIENT_SERVER\n @brief Arguments to the server's notify callback.\n\n Used with the client-server API on a connection manager."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uct_cm_ep_server_conn_notify_args {
    #[doc = " Mask of valid fields in this structure, using bits from\n @ref uct_cm_ep_server_conn_notify_args_field.\n Fields not specified by this mask should not be accessed by the callback."]
    pub field_mask: u64,
    #[doc = " Indicates the client's @ref ucs_status_t status:\n UCS_OK                   - the client completed its connection\n                            establishment and called\n                            @ref uct_cm_client_ep_conn_notify\n UCS_ERR_CONNECTION_RESET - the client's connection was reset during\n                            the connection establishment to the server.\n Otherwise                - indicates an internal connection establishment\n                            error on the local (server) side."]
    pub status: ucs_status_t,
}
#[test]
fn bindgen_test_layout_uct_cm_ep_server_conn_notify_args() {
    const UNINIT: ::std::mem::MaybeUninit<uct_cm_ep_server_conn_notify_args> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<uct_cm_ep_server_conn_notify_args>(),
        16usize,
        concat!("Size of: ", stringify!(uct_cm_ep_server_conn_notify_args))
    );
    assert_eq!(
        ::std::mem::align_of::<uct_cm_ep_server_conn_notify_args>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(uct_cm_ep_server_conn_notify_args)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).field_mask) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_cm_ep_server_conn_notify_args),
            "::",
            stringify!(field_mask)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_cm_ep_server_conn_notify_args),
            "::",
            stringify!(status)
        )
    );
}
#[doc = " @ingroup UCT_CLIENT_SERVER\n @brief Arguments to the server's notify callback.\n\n Used with the client-server API on a connection manager."]
pub type uct_cm_ep_server_conn_notify_args_t = uct_cm_ep_server_conn_notify_args;
#[doc = " @ingroup UCT_AM\n @brief Callback to process incoming active message\n\n When the callback is called, @a flags indicates how @a data should be handled.\n If @a flags contain @ref UCT_CB_PARAM_FLAG_DESC value, it means @a data is part of\n a descriptor which must be released later by @ref uct_iface_release_desc by\n the user if the callback returns @ref UCS_INPROGRESS.\n\n @param [in]  arg      User-defined argument.\n @param [in]  data     Points to the received data. This may be a part of\n                       a descriptor which may be released later.\n @param [in]  length   Length of data.\n @param [in]  flags    Mask with @ref uct_cb_param_flags\n\n @note This callback could be set and released\n       by @ref uct_iface_set_am_handler function.\n\n @retval UCS_OK         - descriptor was consumed, and can be released\n                          by the caller.\n @retval UCS_INPROGRESS - descriptor is owned by the callee, and would be\n                          released later. Supported only if @a flags contain\n                          @ref UCT_CB_PARAM_FLAG_DESC value. Otherwise, this is\n                          an error.\n"]
pub type uct_am_callback_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg: *mut ::std::os::raw::c_void,
        data: *mut ::std::os::raw::c_void,
        length: usize,
        flags: ::std::os::raw::c_uint,
    ) -> ucs_status_t,
>;
#[doc = " @ingroup UCT_AM\n @brief Callback to trace active messages.\n\n Writes a string which represents active message contents into 'buffer'.\n\n @param [in]  arg      User-defined argument.\n @param [in]  type     Message type.\n @param [in]  id       Active message id.\n @param [in]  data     Points to the received data.\n @param [in]  length   Length of data.\n @param [out] buffer   Filled with a debug information string.\n @param [in]  max      Maximal length of the string."]
pub type uct_am_tracer_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg: *mut ::std::os::raw::c_void,
        type_: uct_am_trace_type_t,
        id: u8,
        data: *const ::std::os::raw::c_void,
        length: usize,
        buffer: *mut ::std::os::raw::c_char,
        max: usize,
    ),
>;
#[doc = " @ingroup UCT_RESOURCE\n @brief Callback to process send completion.\n\n @param [in]  self     Pointer to relevant completion structure, which was\n                       initially passed to the operation."]
pub type uct_completion_callback_t =
    ::std::option::Option<unsafe extern "C" fn(self_: *mut uct_completion_t)>;
#[doc = " @ingroup UCT_RESOURCE\n @brief Callback to process pending requests.\n\n @param [in]  self     Pointer to relevant pending structure, which was\n                       initially passed to the operation.\n\n @return @ref UCS_OK         - This pending request has completed and\n                               should be removed.\n         @ref UCS_INPROGRESS - Some progress was made, but not completed.\n                               Keep this request and keep processing the queue.\n         Otherwise           - Could not make any progress. Keep this pending\n                               request on the queue, and stop processing the queue."]
pub type uct_pending_callback_t =
    ::std::option::Option<unsafe extern "C" fn(self_: *mut uct_pending_req_t) -> ucs_status_t>;
#[doc = " @ingroup UCT_RESOURCE\n @brief Callback to process peer failure.\n\n @note User should purge a pending queue and do not post any TX operations\n and cancel all possible outstanding operations prior closing a UCT endpoint.\n\n @param [in]  arg      User argument to be passed to the callback.\n @param [in]  ep       Endpoint which has failed. Upon return from the callback,\n                       this @a ep is no longer usable and all subsequent\n                       operations on this @a ep will fail with the error code\n                       passed in @a status.\n @param [in]  status   Status indicating error.\n\n @return @ref UCS_OK   - The error was handled successfully.\n         Otherwise     - The error was not handled and is returned back to\n                         the transport."]
pub type uct_error_handler_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg: *mut ::std::os::raw::c_void,
        ep: uct_ep_h,
        status: ucs_status_t,
    ) -> ucs_status_t,
>;
#[doc = " @ingroup UCT_RESOURCE\n @brief Callback to purge pending requests.\n\n @param [in]  self     Pointer to relevant pending structure, which was\n                       initially passed to the operation.\n @param [in]  arg      User argument to be passed to the callback."]
pub type uct_pending_purge_callback_t = ::std::option::Option<
    unsafe extern "C" fn(self_: *mut uct_pending_req_t, arg: *mut ::std::os::raw::c_void),
>;
#[doc = " @ingroup UCT_RESOURCE\n @brief Callback for producing data.\n\n @param [in]  dest     Memory buffer to pack the data to.\n @param [in]  arg      Custom user-argument.\n\n @return  Size of the data was actually produced."]
pub type uct_pack_callback_t = ::std::option::Option<
    unsafe extern "C" fn(
        dest: *mut ::std::os::raw::c_void,
        arg: *mut ::std::os::raw::c_void,
    ) -> usize,
>;
#[doc = " @ingroup UCT_RESOURCE\n @brief Callback for consuming data.\n\n @param [in]  arg      Custom user-argument.\n @param [in]  data     Memory buffer to unpack the data from.\n @param [in]  length   How much data to consume (size of \"data\")\n\n @note The arguments for this callback are in the same order as libc's memcpy()."]
pub type uct_unpack_callback_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg: *mut ::std::os::raw::c_void,
        data: *const ::std::os::raw::c_void,
        length: usize,
    ),
>;
#[doc = " @ingroup UCT_CLIENT_SERVER\n @brief Callback to process an incoming connection request on the server side.\n\n This callback routine will be invoked on the server side upon receiving an\n incoming connection request. It should be set by the server side while\n initializing an interface.\n Incoming data is placed inside the conn_priv_data buffer.\n This callback has to be thread safe.\n Other than communication progress routines, it is allowed to call other UCT\n communication routines from this callback.\n\n @param [in]  iface            Transport interface.\n @param [in]  arg              User defined argument for this callback.\n @param [in]  conn_request     Transport level connection request. The user\n                               should accept or reject the request by calling\n                               @ref uct_iface_accept or @ref uct_iface_reject\n                               routines respectively.\n                               conn_request should not be used outside the\n                               scope of this callback.\n @param [in]  conn_priv_data   Points to the received data.\n                               This is the private data that was passed to the\n                               @ref uct_ep_params_t::sockaddr_pack_cb on the\n                               client side.\n @param [in]  length           Length of the received data.\n"]
pub type uct_sockaddr_conn_request_callback_t = ::std::option::Option<
    unsafe extern "C" fn(
        iface: uct_iface_h,
        arg: *mut ::std::os::raw::c_void,
        conn_request: uct_conn_request_h,
        conn_priv_data: *const ::std::os::raw::c_void,
        length: usize,
    ),
>;
#[doc = " @ingroup UCT_CLIENT_SERVER\n @brief Callback to process an incoming connection request on the server side\n        listener in a connection manager.\n\n This callback routine will be invoked on the server side upon receiving an\n incoming connection request. It should be set by the server side while\n initializing a listener in a connection manager.\n This callback has to be thread safe.\n Other than communication progress routines, it is allowed to call other UCT\n communication routines from this callback.\n\n @param [in]  listener         Transport listener.\n @param [in]  arg              User argument for this callback as defined in\n                               @ref uct_listener_params_t::user_data\n @param [in]  conn_req_args    Listener's arguments to handle the connection\n                               request from the client."]
pub type uct_cm_listener_conn_request_callback_t = ::std::option::Option<
    unsafe extern "C" fn(
        listener: uct_listener_h,
        arg: *mut ::std::os::raw::c_void,
        conn_req_args: *const uct_cm_listener_conn_request_args_t,
    ),
>;
#[doc = " @ingroup UCT_CLIENT_SERVER\n @brief Callback to process an incoming connection establishment acknowledgment\n        on the server side listener, from the client, which indicates that the\n        client side is connected.\n        The callback also notifies the server side of a local error on a\n        not-yet-connected endpoint.\n\n This callback routine will be invoked on the server side upon receiving an\n incoming connection establishment acknowledgment from the client, which is sent\n from it once the client is connected to the server. Used to connect the server\n side to the client or handle an error from it - depending on the status field.\n This callback will also be invoked in the event of an internal local error\n with a failed @ref uct_cm_ep_server_conn_notify_args::status if the endpoint\n was not connected yet.\n This callback has to be thread safe.\n Other than communication progress routines, it is permissible to call other UCT\n communication routines from this callback.\n\n @param [in]  ep               Transport endpoint.\n @param [in]  arg              User argument for this callback as defined in\n                               @ref uct_ep_params_t::user_data\n @param [in]  connect_args     Server's connect callback arguments."]
pub type uct_cm_ep_server_conn_notify_callback_t = ::std::option::Option<
    unsafe extern "C" fn(
        ep: uct_ep_h,
        arg: *mut ::std::os::raw::c_void,
        connect_args: *const uct_cm_ep_server_conn_notify_args_t,
    ),
>;
#[doc = " @ingroup UCT_CLIENT_SERVER\n @brief Callback to process an incoming connection response on the client side\n        from the server or handle a local error on a not-yet-connected endpoint.\n\n This callback routine will be invoked on the client side upon receiving an\n incoming connection response from the server. Used to connect the client side\n to the server or handle an error from it - depending on the status field.\n This callback will also be invoked in the event of an internal local error\n with a failed @ref uct_cm_ep_client_connect_args::status if the endpoint was\n not connected yet.\n This callback has to be thread safe.\n Other than communication progress routines, it is permissible to call other UCT\n communication routines from this callback.\n\n @param [in]  ep               Transport endpoint.\n @param [in]  arg              User argument for this callback as defined in\n                               @ref uct_ep_params_t::user_data.\n @param [in]  connect_args     Client's connect callback arguments"]
pub type uct_cm_ep_client_connect_callback_t = ::std::option::Option<
    unsafe extern "C" fn(
        ep: uct_ep_h,
        arg: *mut ::std::os::raw::c_void,
        connect_args: *const uct_cm_ep_client_connect_args_t,
    ),
>;
#[doc = " @ingroup UCT_CLIENT_SERVER\n @brief Callback to handle the disconnection of the remote peer.\n\n This callback routine will be invoked on the client and server sides upon\n a disconnect of the remote peer. It will disconnect the given endpoint from\n the remote peer.\n This callback won't be invoked if the endpoint was not connected to the remote\n peer yet.\n This callback has to be thread safe.\n Other than communication progress routines, it is permissible to call other UCT\n communication routines from this callback.\n\n @param [in]  ep               Transport endpoint to disconnect.\n @param [in]  arg              User argument for this callback as defined in\n                               @ref uct_ep_params_t::user_data."]
pub type uct_ep_disconnect_cb_t =
    ::std::option::Option<unsafe extern "C" fn(ep: uct_ep_h, arg: *mut ::std::os::raw::c_void)>;
#[doc = " @ingroup UCT_CLIENT_SERVER\n @brief Callback to fill the user's private data in a client-server flow.\n\n This callback routine will be invoked on the client side, before sending the\n transport's connection request to the server, or on the server side before\n sending a connection response to the client.\n This callback routine can be set when creating an endpoint.\n The user's private data should be placed inside the priv_data buffer to be\n sent to the remote side.\n The maximal allowed length of the private data is indicated by the field\n max_conn_priv inside @ref uct_iface_attr or inside @ref uct_cm_attr when using a\n connection manager.\n Communication progress routines should not be called from this callback.\n It is allowed to call other UCT communication routines from this callback.\n\n @param [in]  arg          User defined argument for this callback.\n @param [in]  pack_args    Handle for the the private data packing.\n @param [out] priv_data    User's private data to be passed to the remote side.\n\n @return Negative value indicates an error according to @ref ucs_status_t.\n         On success, a non-negative value indicates actual number of\n         bytes written to the @a priv_data buffer."]
pub type uct_cm_ep_priv_data_pack_callback_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg: *mut ::std::os::raw::c_void,
        pack_args: *const uct_cm_ep_priv_data_pack_args_t,
        priv_data: *mut ::std::os::raw::c_void,
    ) -> isize,
>;
#[doc = " @ingroup UCT_CLIENT_SERVER\n @brief Callback to notify that the client side endpoint is bound to a\n        local device.\n\n This callback routine will be invoked, when the client side endpoint is bound\n to a local device.\n The callback routine can be set when creating an endpoint.\n Communication progress routines should not be called from this callback.\n It is allowed to call other UCT communication routines from this callback.\n\n @param [in]  user_data       User argument as defined in\n                              @ref uct_ep_params_t::user_data.\n @param [in]  resolve_args    Handle for the extra arguments provided by the\n                              transport.\n\n @return UCS_OK on success or error as defined in @ref ucs_status_t."]
pub type uct_cm_ep_resolve_callback_t = ::std::option::Option<
    unsafe extern "C" fn(
        user_data: *mut ::std::os::raw::c_void,
        resolve_args: *const uct_cm_ep_resolve_args_t,
    ) -> ucs_status_t,
>;
#[doc = " @ingroup UCT_TAG\n @brief Callback to process unexpected eager tagged message.\n\n This callback is invoked when tagged message sent by eager protocol has\n arrived and no corresponding tag has been posted.\n\n @note The callback is always invoked from the context (thread, process)\n       that called @a uct_iface_progress().\n\n @note It is allowed to call other communication routines from the callback.\n\n @param [in]     arg     User-defined argument\n @param [in]     data    Points to the received unexpected data.\n @param [in]     length  Length of data.\n @param [in]     flags   Mask with @ref uct_cb_param_flags flags. If it\n                         contains @ref UCT_CB_PARAM_FLAG_DESC value, this means\n                         @a data is part of a descriptor which must be released\n                         later using @ref uct_iface_release_desc by the user if\n                         the callback returns @ref UCS_INPROGRESS.\n @param [in]     stag    Tag from sender.\n @param [in]     imm     Immediate data from sender.\n\n @param [inout]  context Storage for a per-message user-defined context. In\n                         this context, the message is defined by the sender\n                         side as a single call to uct_ep_tag_eager_short/bcopy/zcopy.\n                         On the transport level the message can be fragmented\n                         and delivered to the target over multiple fragments.\n                         The fragments will preserve the original order of the\n                         message. Each fragment will result in invocation of\n                         the above callback. The user can use\n                         UCT_CB_PARAM_FLAG_FIRST to identify the first fragment,\n                         allocate the context object and use the context as a\n                         token that is set by the user and passed to subsequent\n                         callbacks of the same message. The user is responsible\n                         for allocation and release of the context.\n\n @note No need to allocate the context in the case of a single fragment message\n       (i.e. @a flags contains @ref UCT_CB_PARAM_FLAG_FIRST, but does not\n       contain @ref UCT_CB_PARAM_FLAG_MORE).\n\n @retval UCS_OK          - data descriptor was consumed, and can be released\n                           by the caller.\n @retval UCS_INPROGRESS  - data descriptor is owned by the callee, and will be\n                           released later."]
pub type uct_tag_unexp_eager_cb_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg: *mut ::std::os::raw::c_void,
        data: *mut ::std::os::raw::c_void,
        length: usize,
        flags: ::std::os::raw::c_uint,
        stag: uct_tag_t,
        imm: u64,
        context: *mut *mut ::std::os::raw::c_void,
    ) -> ucs_status_t,
>;
#[doc = " @ingroup UCT_TAG\n @brief Callback to process unexpected rendezvous tagged message.\n\n This callback is invoked when rendezvous send notification has arrived\n and no corresponding tag has been posted.\n\n @note The callback is always invoked from the context (thread, process)\n       that called @a uct_iface_progress().\n\n @note It is allowed to call other communication routines from the callback.\n\n @param [in]  arg           User-defined argument\n @param [in]  flags         Mask with @ref uct_cb_param_flags\n @param [in]  stag          Tag from sender.\n @param [in]  header        User defined header.\n @param [in]  header_length User defined header length in bytes.\n @param [in]  remote_addr   Sender's buffer virtual address.\n @param [in]  length        Sender's buffer length.\n @param [in]  rkey_buf      Sender's buffer packed remote key. It can be\n                            passed to uct_rkey_unpack() to create uct_rkey_t.\n\n @warning If the user became the owner of the @a desc (by returning\n          @ref UCS_INPROGRESS) the descriptor must be released later by\n          @ref uct_iface_release_desc by the user.\n\n @retval UCS_OK         - descriptor was consumed, and can be released\n                          by the caller.\n @retval UCS_INPROGRESS - descriptor is owned by the callee, and would be\n                          released later."]
pub type uct_tag_unexp_rndv_cb_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg: *mut ::std::os::raw::c_void,
        flags: ::std::os::raw::c_uint,
        stag: u64,
        header: *const ::std::os::raw::c_void,
        header_length: ::std::os::raw::c_uint,
        remote_addr: u64,
        length: usize,
        rkey_buf: *const ::std::os::raw::c_void,
    ) -> ucs_status_t,
>;
#[doc = " @ingroup UCT_RESOURCE\n @brief Callback to process asynchronous events.\n\n @param [in]  arg      User argument to be passed to the callback.\n @param [in]  flags    Flags to be passed to the callback (reserved for\n                       future use)."]
pub type uct_async_event_cb_t = ::std::option::Option<
    unsafe extern "C" fn(arg: *mut ::std::os::raw::c_void, flags: ::std::os::raw::c_uint),
>;
extern "C" {
    #[doc = " Disable signal handling in UCS for signal.\n Previous signal handler is set.\n @param signum   Signal number to disable handling."]
    pub fn ucs_debug_disable_signal(signum: ::std::os::raw::c_int);
}
extern "C" {
    pub fn ucs_debug_asan_validate_address(
        ptr_name: *const ::std::os::raw::c_char,
        address: *mut ::std::os::raw::c_void,
        size: usize,
    );
}
#[doc = " A link in a circular list."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ucs_list_link {
    pub prev: *mut ucs_list_link,
    pub next: *mut ucs_list_link,
}
#[test]
fn bindgen_test_layout_ucs_list_link() {
    const UNINIT: ::std::mem::MaybeUninit<ucs_list_link> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ucs_list_link>(),
        16usize,
        concat!("Size of: ", stringify!(ucs_list_link))
    );
    assert_eq!(
        ::std::mem::align_of::<ucs_list_link>(),
        8usize,
        concat!("Alignment of ", stringify!(ucs_list_link))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).prev) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ucs_list_link),
            "::",
            stringify!(prev)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ucs_list_link),
            "::",
            stringify!(next)
        )
    );
}
#[doc = " A link in a circular list."]
pub type ucs_list_link_t = ucs_list_link;
#[doc = " A queue of callback to execute"]
pub type ucs_callbackq_t = ucs_callbackq;
#[doc = " Callback queue element."]
pub type ucs_callbackq_elem_t = ucs_callbackq_elem;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ucs_callbackq_priv {
    _unused: [u8; 0],
}
pub type ucs_callbackq_priv_t = ucs_callbackq_priv;
pub type ucs_callbackq_key_t = *mut ::std::os::raw::c_void;
#[doc = " Callback which can be placed in a queue.\n\n @param [in] arg  User-defined argument for the callback.\n\n @return Count of how much \"work\" was done by the callback. For example, zero\n         means that no work was done, and any nonzero value means that something\n         was done."]
pub type ucs_callback_t = ::std::option::Option<
    unsafe extern "C" fn(arg: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_uint,
>;
#[doc = " Callback queue element predicate.\n\n @param [in] elem  Callback queue element to check.\n @param [in] arg   User-defined argument.\n\n @return Predicate result value - nonzero means \"true\", zero means \"false\"."]
pub type ucs_callbackq_predicate_t = ::std::option::Option<
    unsafe extern "C" fn(
        elem: *const ucs_callbackq_elem_t,
        arg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
#[doc = " Callback queue element."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ucs_callbackq_elem {
    #[doc = "< Callback function"]
    pub cb: ucs_callback_t,
    #[doc = "< Function argument"]
    pub arg: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_ucs_callbackq_elem() {
    const UNINIT: ::std::mem::MaybeUninit<ucs_callbackq_elem> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ucs_callbackq_elem>(),
        16usize,
        concat!("Size of: ", stringify!(ucs_callbackq_elem))
    );
    assert_eq!(
        ::std::mem::align_of::<ucs_callbackq_elem>(),
        8usize,
        concat!("Alignment of ", stringify!(ucs_callbackq_elem))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cb) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ucs_callbackq_elem),
            "::",
            stringify!(cb)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).arg) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ucs_callbackq_elem),
            "::",
            stringify!(arg)
        )
    );
}
#[doc = " A queue of callback to execute"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ucs_callbackq {
    #[doc = " Array of fast-path element, the last is reserved as a sentinel to mark\n array end."]
    pub fast_elems: [ucs_callbackq_elem_t; 8usize],
    #[doc = " Private data, which we don't want to expose in API to avoid pulling\n more header files"]
    pub priv_: *mut ucs_callbackq_priv_t,
}
#[test]
fn bindgen_test_layout_ucs_callbackq() {
    const UNINIT: ::std::mem::MaybeUninit<ucs_callbackq> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ucs_callbackq>(),
        136usize,
        concat!("Size of: ", stringify!(ucs_callbackq))
    );
    assert_eq!(
        ::std::mem::align_of::<ucs_callbackq>(),
        8usize,
        concat!("Alignment of ", stringify!(ucs_callbackq))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fast_elems) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ucs_callbackq),
            "::",
            stringify!(fast_elems)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).priv_) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(ucs_callbackq),
            "::",
            stringify!(priv_)
        )
    );
}
extern "C" {
    #[doc = " Initialize the callback queue.\n\n @param  [in] cbq      Callback queue to initialize."]
    pub fn ucs_callbackq_init(cbq: *mut ucs_callbackq_t) -> ucs_status_t;
}
extern "C" {
    #[doc = " Clean up the callback queue and release associated memory.\n\n @param  [in] cbq      Callback queue to clean up."]
    pub fn ucs_callbackq_cleanup(cbq: *mut ucs_callbackq_t);
}
extern "C" {
    #[doc = " Add a callback to the queue.\n This is *not* safe to call while another thread might be dispatching callbacks.\n However, it can be used from the dispatch context (e.g a callback may use this\n function to add another callback).\n\n @param  [in] cbq      Callback queue to add the callback to.\n @param  [in] cb       Callback to add.\n @param  [in] arg      User-defined argument for the callback.\n\n @return Unique identifier of the callback in the queue."]
    pub fn ucs_callbackq_add(
        cbq: *mut ucs_callbackq_t,
        cb: ucs_callback_t,
        arg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Remove a callback from the queue immediately.\n This is *not* safe to call while another thread might be dispatching callbacks.\n However, it can be used from the dispatch context (e.g a callback may use this\n function to remove itself or another callback). In this case, the callback may\n still be dispatched once after this function returned.\n\n @param  [in] cbq      Callback queue to remove the callback from.\n @param  [in] id       Callback identifier to remove.\n\n @return The user-defined argument provided when the callback was added."]
    pub fn ucs_callbackq_remove(
        cbq: *mut ucs_callbackq_t,
        id: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = " Add a callback to the queue.\n This can be used from any context and any thread, including but not limited to:\n - A callback can add another callback.\n - A thread can add a callback while another thread is dispatching callbacks.\n\n @param  [in] cbq      Callback queue to add the callback to.\n @param  [in] cb       Callback to add.\n @param  [in] arg      User-defined argument for the callback.\n\n @return Unique identifier of the callback in the queue."]
    pub fn ucs_callbackq_add_safe(
        cbq: *mut ucs_callbackq_t,
        cb: ucs_callback_t,
        arg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Remove a callback from the queue in a safe but lazy fashion. The callback will\n be removed at some point in the near future.\n This can be used from any context and any thread, including but not limited to:\n - A callback can remove another callback or itself.\n - A thread can't remove a callback while another thread is dispatching callbacks.\n\n @param  [in] cbq      Callback queue to remove the callback from.\n @param  [in] id       Callback identifier to remove.\n\n @return The user-defined argument provided when the callback was added."]
    pub fn ucs_callbackq_remove_safe(
        cbq: *mut ucs_callbackq_t,
        id: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = " Add a slowpath oneshot callback to the queue.\n This can be used from any context and any thread.\n\n @note Callbacks with the same key will be called in the same order they were\n added. On the other hand, callbacks with different keys can be called in any\n order.\n\n @param  [in] cbq      Callback queue to add the callback to.\n @param  [in] key      User-defind key, used to remove the callback later.\n @param  [in] cb       Callback to add.\n @param  [in] arg      User-defined argument for the callback."]
    pub fn ucs_callbackq_add_oneshot(
        cbq: *mut ucs_callbackq_t,
        key: ucs_callbackq_key_t,
        cb: ucs_callback_t,
        arg: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    #[doc = " Remove all slowpath callbacks from the queue with the given key and for which\n the given predicate returns \"true\" (nonzero) value.\n This can be used from any context and any thread.\n\n @param  [in] cbq       Callback queue.\n @param  [in] key       Callback key to remove.\n @param  [in] pred      Predicate to check candidates for removal.\n @param  [in] arg       User-defined argument for the predicate."]
    pub fn ucs_callbackq_remove_oneshot(
        cbq: *mut ucs_callbackq_t,
        key: ucs_callbackq_key_t,
        pred: ucs_callbackq_predicate_t,
        arg: *mut ::std::os::raw::c_void,
    );
}
#[doc = " @file tl.h"]
pub type uct_ep_put_short_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        ep: uct_ep_h,
        buffer: *const ::std::os::raw::c_void,
        length: ::std::os::raw::c_uint,
        remote_addr: u64,
        rkey: uct_rkey_t,
    ) -> ucs_status_t,
>;
pub type uct_ep_put_bcopy_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        ep: uct_ep_h,
        pack_cb: uct_pack_callback_t,
        arg: *mut ::std::os::raw::c_void,
        remote_addr: u64,
        rkey: uct_rkey_t,
    ) -> isize,
>;
pub type uct_ep_put_zcopy_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        ep: uct_ep_h,
        iov: *const uct_iov_t,
        iovcnt: usize,
        remote_addr: u64,
        rkey: uct_rkey_t,
        comp: *mut uct_completion_t,
    ) -> ucs_status_t,
>;
pub type uct_ep_get_short_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        ep: uct_ep_h,
        buffer: *mut ::std::os::raw::c_void,
        length: ::std::os::raw::c_uint,
        remote_addr: u64,
        rkey: uct_rkey_t,
    ) -> ucs_status_t,
>;
pub type uct_ep_get_bcopy_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        ep: uct_ep_h,
        unpack_cb: uct_unpack_callback_t,
        arg: *mut ::std::os::raw::c_void,
        length: usize,
        remote_addr: u64,
        rkey: uct_rkey_t,
        comp: *mut uct_completion_t,
    ) -> ucs_status_t,
>;
pub type uct_ep_get_zcopy_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        ep: uct_ep_h,
        iov: *const uct_iov_t,
        iovcnt: usize,
        remote_addr: u64,
        rkey: uct_rkey_t,
        comp: *mut uct_completion_t,
    ) -> ucs_status_t,
>;
pub type uct_ep_am_short_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        ep: uct_ep_h,
        id: u8,
        header: u64,
        payload: *const ::std::os::raw::c_void,
        length: ::std::os::raw::c_uint,
    ) -> ucs_status_t,
>;
pub type uct_ep_am_short_iov_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        ep: uct_ep_h,
        id: u8,
        iov: *const uct_iov_t,
        iovcnt: usize,
    ) -> ucs_status_t,
>;
pub type uct_ep_am_bcopy_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        ep: uct_ep_h,
        id: u8,
        pack_cb: uct_pack_callback_t,
        arg: *mut ::std::os::raw::c_void,
        flags: ::std::os::raw::c_uint,
    ) -> isize,
>;
pub type uct_ep_am_zcopy_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        ep: uct_ep_h,
        id: u8,
        header: *const ::std::os::raw::c_void,
        header_length: ::std::os::raw::c_uint,
        iov: *const uct_iov_t,
        iovcnt: usize,
        flags: ::std::os::raw::c_uint,
        comp: *mut uct_completion_t,
    ) -> ucs_status_t,
>;
pub type uct_ep_atomic_cswap64_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        ep: uct_ep_h,
        compare: u64,
        swap: u64,
        remote_addr: u64,
        rkey: uct_rkey_t,
        result: *mut u64,
        comp: *mut uct_completion_t,
    ) -> ucs_status_t,
>;
pub type uct_ep_atomic_cswap32_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        ep: uct_ep_h,
        compare: u32,
        swap: u32,
        remote_addr: u64,
        rkey: uct_rkey_t,
        result: *mut u32,
        comp: *mut uct_completion_t,
    ) -> ucs_status_t,
>;
pub type uct_ep_atomic32_post_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        ep: uct_ep_h,
        opcode: ::std::os::raw::c_uint,
        value: u32,
        remote_addr: u64,
        rkey: uct_rkey_t,
    ) -> ucs_status_t,
>;
pub type uct_ep_atomic64_post_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        ep: uct_ep_h,
        opcode: ::std::os::raw::c_uint,
        value: u64,
        remote_addr: u64,
        rkey: uct_rkey_t,
    ) -> ucs_status_t,
>;
pub type uct_ep_atomic32_fetch_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        ep: uct_ep_h,
        opcode: ::std::os::raw::c_uint,
        value: u32,
        result: *mut u32,
        remote_addr: u64,
        rkey: uct_rkey_t,
        comp: *mut uct_completion_t,
    ) -> ucs_status_t,
>;
pub type uct_ep_atomic64_fetch_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        ep: uct_ep_h,
        opcode: ::std::os::raw::c_uint,
        value: u64,
        result: *mut u64,
        remote_addr: u64,
        rkey: uct_rkey_t,
        comp: *mut uct_completion_t,
    ) -> ucs_status_t,
>;
pub type uct_ep_tag_eager_short_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        ep: uct_ep_h,
        tag: uct_tag_t,
        data: *const ::std::os::raw::c_void,
        length: usize,
    ) -> ucs_status_t,
>;
pub type uct_ep_tag_eager_bcopy_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        ep: uct_ep_h,
        tag: uct_tag_t,
        imm: u64,
        pack_cb: uct_pack_callback_t,
        arg: *mut ::std::os::raw::c_void,
        flags: ::std::os::raw::c_uint,
    ) -> isize,
>;
pub type uct_ep_tag_eager_zcopy_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        ep: uct_ep_h,
        tag: uct_tag_t,
        imm: u64,
        iov: *const uct_iov_t,
        iovcnt: usize,
        flags: ::std::os::raw::c_uint,
        comp: *mut uct_completion_t,
    ) -> ucs_status_t,
>;
pub type uct_ep_tag_rndv_zcopy_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        ep: uct_ep_h,
        tag: uct_tag_t,
        header: *const ::std::os::raw::c_void,
        header_length: ::std::os::raw::c_uint,
        iov: *const uct_iov_t,
        iovcnt: usize,
        flags: ::std::os::raw::c_uint,
        comp: *mut uct_completion_t,
    ) -> ucs_status_ptr_t,
>;
pub type uct_ep_tag_rndv_cancel_func_t = ::std::option::Option<
    unsafe extern "C" fn(ep: uct_ep_h, op: *mut ::std::os::raw::c_void) -> ucs_status_t,
>;
pub type uct_ep_tag_rndv_request_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        ep: uct_ep_h,
        tag: uct_tag_t,
        header: *const ::std::os::raw::c_void,
        header_length: ::std::os::raw::c_uint,
        flags: ::std::os::raw::c_uint,
    ) -> ucs_status_t,
>;
pub type uct_iface_tag_recv_zcopy_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        iface: uct_iface_h,
        tag: uct_tag_t,
        tag_mask: uct_tag_t,
        iov: *const uct_iov_t,
        iovcnt: usize,
        ctx: *mut uct_tag_context_t,
    ) -> ucs_status_t,
>;
pub type uct_iface_tag_recv_cancel_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        iface: uct_iface_h,
        ctx: *mut uct_tag_context_t,
        force: ::std::os::raw::c_int,
    ) -> ucs_status_t,
>;
pub type uct_ep_pending_add_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        ep: uct_ep_h,
        n: *mut uct_pending_req_t,
        flags: ::std::os::raw::c_uint,
    ) -> ucs_status_t,
>;
pub type uct_ep_pending_purge_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        ep: uct_ep_h,
        cb: uct_pending_purge_callback_t,
        arg: *mut ::std::os::raw::c_void,
    ),
>;
pub type uct_ep_flush_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        ep: uct_ep_h,
        flags: ::std::os::raw::c_uint,
        comp: *mut uct_completion_t,
    ) -> ucs_status_t,
>;
pub type uct_ep_fence_func_t = ::std::option::Option<
    unsafe extern "C" fn(ep: uct_ep_h, flags: ::std::os::raw::c_uint) -> ucs_status_t,
>;
pub type uct_ep_check_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        ep: uct_ep_h,
        flags: ::std::os::raw::c_uint,
        comp: *mut uct_completion_t,
    ) -> ucs_status_t,
>;
pub type uct_ep_create_func_t = ::std::option::Option<
    unsafe extern "C" fn(params: *const uct_ep_params_t, ep_p: *mut uct_ep_h) -> ucs_status_t,
>;
pub type uct_ep_connect_func_t = ::std::option::Option<
    unsafe extern "C" fn(ep: uct_ep_h, params: *const uct_ep_connect_params_t) -> ucs_status_t,
>;
pub type uct_ep_disconnect_func_t = ::std::option::Option<
    unsafe extern "C" fn(ep: uct_ep_h, flags: ::std::os::raw::c_uint) -> ucs_status_t,
>;
pub type uct_cm_ep_conn_notify_func_t =
    ::std::option::Option<unsafe extern "C" fn(ep: uct_ep_h) -> ucs_status_t>;
pub type uct_ep_destroy_func_t = ::std::option::Option<unsafe extern "C" fn(ep: uct_ep_h)>;
pub type uct_ep_get_address_func_t = ::std::option::Option<
    unsafe extern "C" fn(ep: uct_ep_h, addr: *mut uct_ep_addr_t) -> ucs_status_t,
>;
pub type uct_ep_connect_to_ep_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        ep: uct_ep_h,
        dev_addr: *const uct_device_addr_t,
        ep_addr: *const uct_ep_addr_t,
    ) -> ucs_status_t,
>;
pub type uct_iface_accept_func_t = ::std::option::Option<
    unsafe extern "C" fn(iface: uct_iface_h, conn_request: uct_conn_request_h) -> ucs_status_t,
>;
pub type uct_iface_reject_func_t = ::std::option::Option<
    unsafe extern "C" fn(iface: uct_iface_h, conn_request: uct_conn_request_h) -> ucs_status_t,
>;
pub type uct_iface_flush_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        iface: uct_iface_h,
        flags: ::std::os::raw::c_uint,
        comp: *mut uct_completion_t,
    ) -> ucs_status_t,
>;
pub type uct_iface_fence_func_t = ::std::option::Option<
    unsafe extern "C" fn(iface: uct_iface_h, flags: ::std::os::raw::c_uint) -> ucs_status_t,
>;
pub type uct_iface_progress_enable_func_t =
    ::std::option::Option<unsafe extern "C" fn(iface: uct_iface_h, flags: ::std::os::raw::c_uint)>;
pub type uct_iface_progress_disable_func_t =
    ::std::option::Option<unsafe extern "C" fn(iface: uct_iface_h, flags: ::std::os::raw::c_uint)>;
pub type uct_iface_progress_func_t =
    ::std::option::Option<unsafe extern "C" fn(iface: uct_iface_h) -> ::std::os::raw::c_uint>;
pub type uct_iface_event_fd_get_func_t = ::std::option::Option<
    unsafe extern "C" fn(iface: uct_iface_h, fd_p: *mut ::std::os::raw::c_int) -> ucs_status_t,
>;
pub type uct_iface_event_arm_func_t = ::std::option::Option<
    unsafe extern "C" fn(iface: uct_iface_h, events: ::std::os::raw::c_uint) -> ucs_status_t,
>;
pub type uct_iface_close_func_t = ::std::option::Option<unsafe extern "C" fn(iface: uct_iface_h)>;
pub type uct_iface_query_func_t = ::std::option::Option<
    unsafe extern "C" fn(iface: uct_iface_h, iface_attr: *mut uct_iface_attr_t) -> ucs_status_t,
>;
pub type uct_iface_get_device_address_func_t = ::std::option::Option<
    unsafe extern "C" fn(iface: uct_iface_h, addr: *mut uct_device_addr_t) -> ucs_status_t,
>;
pub type uct_iface_get_address_func_t = ::std::option::Option<
    unsafe extern "C" fn(iface: uct_iface_h, addr: *mut uct_iface_addr_t) -> ucs_status_t,
>;
pub type uct_iface_is_reachable_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        iface: uct_iface_h,
        dev_addr: *const uct_device_addr_t,
        iface_addr: *const uct_iface_addr_t,
    ) -> ::std::os::raw::c_int,
>;
#[doc = " Transport interface operations.\n Every operation exposed in the API must appear in the table below, to allow\n creating interface/endpoint with custom operations."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uct_iface_ops {
    pub ep_put_short: uct_ep_put_short_func_t,
    pub ep_put_bcopy: uct_ep_put_bcopy_func_t,
    pub ep_put_zcopy: uct_ep_put_zcopy_func_t,
    pub ep_get_short: uct_ep_get_short_func_t,
    pub ep_get_bcopy: uct_ep_get_bcopy_func_t,
    pub ep_get_zcopy: uct_ep_get_zcopy_func_t,
    pub ep_am_short: uct_ep_am_short_func_t,
    pub ep_am_short_iov: uct_ep_am_short_iov_func_t,
    pub ep_am_bcopy: uct_ep_am_bcopy_func_t,
    pub ep_am_zcopy: uct_ep_am_zcopy_func_t,
    pub ep_atomic_cswap64: uct_ep_atomic_cswap64_func_t,
    pub ep_atomic_cswap32: uct_ep_atomic_cswap32_func_t,
    pub ep_atomic32_post: uct_ep_atomic32_post_func_t,
    pub ep_atomic64_post: uct_ep_atomic64_post_func_t,
    pub ep_atomic32_fetch: uct_ep_atomic32_fetch_func_t,
    pub ep_atomic64_fetch: uct_ep_atomic64_fetch_func_t,
    pub ep_tag_eager_short: uct_ep_tag_eager_short_func_t,
    pub ep_tag_eager_bcopy: uct_ep_tag_eager_bcopy_func_t,
    pub ep_tag_eager_zcopy: uct_ep_tag_eager_zcopy_func_t,
    pub ep_tag_rndv_zcopy: uct_ep_tag_rndv_zcopy_func_t,
    pub ep_tag_rndv_cancel: uct_ep_tag_rndv_cancel_func_t,
    pub ep_tag_rndv_request: uct_ep_tag_rndv_request_func_t,
    pub iface_tag_recv_zcopy: uct_iface_tag_recv_zcopy_func_t,
    pub iface_tag_recv_cancel: uct_iface_tag_recv_cancel_func_t,
    pub ep_pending_add: uct_ep_pending_add_func_t,
    pub ep_pending_purge: uct_ep_pending_purge_func_t,
    pub ep_flush: uct_ep_flush_func_t,
    pub ep_fence: uct_ep_fence_func_t,
    pub ep_check: uct_ep_check_func_t,
    pub ep_create: uct_ep_create_func_t,
    pub ep_connect: uct_ep_connect_func_t,
    pub ep_disconnect: uct_ep_disconnect_func_t,
    pub cm_ep_conn_notify: uct_cm_ep_conn_notify_func_t,
    pub ep_destroy: uct_ep_destroy_func_t,
    pub ep_get_address: uct_ep_get_address_func_t,
    pub ep_connect_to_ep: uct_ep_connect_to_ep_func_t,
    pub iface_accept: uct_iface_accept_func_t,
    pub iface_reject: uct_iface_reject_func_t,
    pub iface_flush: uct_iface_flush_func_t,
    pub iface_fence: uct_iface_fence_func_t,
    pub iface_progress_enable: uct_iface_progress_enable_func_t,
    pub iface_progress_disable: uct_iface_progress_disable_func_t,
    pub iface_progress: uct_iface_progress_func_t,
    pub iface_event_fd_get: uct_iface_event_fd_get_func_t,
    pub iface_event_arm: uct_iface_event_arm_func_t,
    pub iface_close: uct_iface_close_func_t,
    pub iface_query: uct_iface_query_func_t,
    pub iface_get_device_address: uct_iface_get_device_address_func_t,
    pub iface_get_address: uct_iface_get_address_func_t,
    pub iface_is_reachable: uct_iface_is_reachable_func_t,
}
#[test]
fn bindgen_test_layout_uct_iface_ops() {
    const UNINIT: ::std::mem::MaybeUninit<uct_iface_ops> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<uct_iface_ops>(),
        400usize,
        concat!("Size of: ", stringify!(uct_iface_ops))
    );
    assert_eq!(
        ::std::mem::align_of::<uct_iface_ops>(),
        8usize,
        concat!("Alignment of ", stringify!(uct_iface_ops))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ep_put_short) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_ops),
            "::",
            stringify!(ep_put_short)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ep_put_bcopy) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_ops),
            "::",
            stringify!(ep_put_bcopy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ep_put_zcopy) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_ops),
            "::",
            stringify!(ep_put_zcopy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ep_get_short) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_ops),
            "::",
            stringify!(ep_get_short)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ep_get_bcopy) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_ops),
            "::",
            stringify!(ep_get_bcopy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ep_get_zcopy) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_ops),
            "::",
            stringify!(ep_get_zcopy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ep_am_short) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_ops),
            "::",
            stringify!(ep_am_short)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ep_am_short_iov) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_ops),
            "::",
            stringify!(ep_am_short_iov)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ep_am_bcopy) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_ops),
            "::",
            stringify!(ep_am_bcopy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ep_am_zcopy) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_ops),
            "::",
            stringify!(ep_am_zcopy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ep_atomic_cswap64) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_ops),
            "::",
            stringify!(ep_atomic_cswap64)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ep_atomic_cswap32) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_ops),
            "::",
            stringify!(ep_atomic_cswap32)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ep_atomic32_post) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_ops),
            "::",
            stringify!(ep_atomic32_post)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ep_atomic64_post) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_ops),
            "::",
            stringify!(ep_atomic64_post)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ep_atomic32_fetch) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_ops),
            "::",
            stringify!(ep_atomic32_fetch)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ep_atomic64_fetch) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_ops),
            "::",
            stringify!(ep_atomic64_fetch)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ep_tag_eager_short) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_ops),
            "::",
            stringify!(ep_tag_eager_short)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ep_tag_eager_bcopy) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_ops),
            "::",
            stringify!(ep_tag_eager_bcopy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ep_tag_eager_zcopy) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_ops),
            "::",
            stringify!(ep_tag_eager_zcopy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ep_tag_rndv_zcopy) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_ops),
            "::",
            stringify!(ep_tag_rndv_zcopy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ep_tag_rndv_cancel) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_ops),
            "::",
            stringify!(ep_tag_rndv_cancel)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ep_tag_rndv_request) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_ops),
            "::",
            stringify!(ep_tag_rndv_request)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iface_tag_recv_zcopy) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_ops),
            "::",
            stringify!(iface_tag_recv_zcopy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iface_tag_recv_cancel) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_ops),
            "::",
            stringify!(iface_tag_recv_cancel)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ep_pending_add) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_ops),
            "::",
            stringify!(ep_pending_add)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ep_pending_purge) as usize - ptr as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_ops),
            "::",
            stringify!(ep_pending_purge)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ep_flush) as usize - ptr as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_ops),
            "::",
            stringify!(ep_flush)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ep_fence) as usize - ptr as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_ops),
            "::",
            stringify!(ep_fence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ep_check) as usize - ptr as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_ops),
            "::",
            stringify!(ep_check)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ep_create) as usize - ptr as usize },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_ops),
            "::",
            stringify!(ep_create)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ep_connect) as usize - ptr as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_ops),
            "::",
            stringify!(ep_connect)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ep_disconnect) as usize - ptr as usize },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_ops),
            "::",
            stringify!(ep_disconnect)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cm_ep_conn_notify) as usize - ptr as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_ops),
            "::",
            stringify!(cm_ep_conn_notify)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ep_destroy) as usize - ptr as usize },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_ops),
            "::",
            stringify!(ep_destroy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ep_get_address) as usize - ptr as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_ops),
            "::",
            stringify!(ep_get_address)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ep_connect_to_ep) as usize - ptr as usize },
        280usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_ops),
            "::",
            stringify!(ep_connect_to_ep)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iface_accept) as usize - ptr as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_ops),
            "::",
            stringify!(iface_accept)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iface_reject) as usize - ptr as usize },
        296usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_ops),
            "::",
            stringify!(iface_reject)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iface_flush) as usize - ptr as usize },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_ops),
            "::",
            stringify!(iface_flush)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iface_fence) as usize - ptr as usize },
        312usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_ops),
            "::",
            stringify!(iface_fence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iface_progress_enable) as usize - ptr as usize },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_ops),
            "::",
            stringify!(iface_progress_enable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iface_progress_disable) as usize - ptr as usize },
        328usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_ops),
            "::",
            stringify!(iface_progress_disable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iface_progress) as usize - ptr as usize },
        336usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_ops),
            "::",
            stringify!(iface_progress)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iface_event_fd_get) as usize - ptr as usize },
        344usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_ops),
            "::",
            stringify!(iface_event_fd_get)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iface_event_arm) as usize - ptr as usize },
        352usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_ops),
            "::",
            stringify!(iface_event_arm)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iface_close) as usize - ptr as usize },
        360usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_ops),
            "::",
            stringify!(iface_close)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iface_query) as usize - ptr as usize },
        368usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_ops),
            "::",
            stringify!(iface_query)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iface_get_device_address) as usize - ptr as usize },
        376usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_ops),
            "::",
            stringify!(iface_get_device_address)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iface_get_address) as usize - ptr as usize },
        384usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_ops),
            "::",
            stringify!(iface_get_address)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iface_is_reachable) as usize - ptr as usize },
        392usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_ops),
            "::",
            stringify!(iface_is_reachable)
        )
    );
}
#[doc = " Transport interface operations.\n Every operation exposed in the API must appear in the table below, to allow\n creating interface/endpoint with custom operations."]
pub type uct_iface_ops_t = uct_iface_ops;
#[doc = "  A progress engine and a domain for allocating communication resources.\n  Different workers are progressed independently."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uct_worker {
    pub progress_q: ucs_callbackq_t,
}
#[test]
fn bindgen_test_layout_uct_worker() {
    const UNINIT: ::std::mem::MaybeUninit<uct_worker> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<uct_worker>(),
        136usize,
        concat!("Size of: ", stringify!(uct_worker))
    );
    assert_eq!(
        ::std::mem::align_of::<uct_worker>(),
        8usize,
        concat!("Alignment of ", stringify!(uct_worker))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).progress_q) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_worker),
            "::",
            stringify!(progress_q)
        )
    );
}
#[doc = "  A progress engine and a domain for allocating communication resources.\n  Different workers are progressed independently."]
pub type uct_worker_t = uct_worker;
#[doc = " Communication interface context"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uct_iface {
    pub ops: uct_iface_ops_t,
}
#[test]
fn bindgen_test_layout_uct_iface() {
    const UNINIT: ::std::mem::MaybeUninit<uct_iface> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<uct_iface>(),
        400usize,
        concat!("Size of: ", stringify!(uct_iface))
    );
    assert_eq!(
        ::std::mem::align_of::<uct_iface>(),
        8usize,
        concat!("Alignment of ", stringify!(uct_iface))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ops) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface),
            "::",
            stringify!(ops)
        )
    );
}
#[doc = " Communication interface context"]
pub type uct_iface_t = uct_iface;
#[doc = " Remote endpoint"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uct_ep {
    pub iface: uct_iface_h,
}
#[test]
fn bindgen_test_layout_uct_ep() {
    const UNINIT: ::std::mem::MaybeUninit<uct_ep> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<uct_ep>(),
        8usize,
        concat!("Size of: ", stringify!(uct_ep))
    );
    assert_eq!(
        ::std::mem::align_of::<uct_ep>(),
        8usize,
        concat!("Alignment of ", stringify!(uct_ep))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iface) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_ep),
            "::",
            stringify!(iface)
        )
    );
}
#[doc = " Remote endpoint"]
pub type uct_ep_t = uct_ep;
#[doc = " Listener for incoming connections"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uct_listener {
    pub cm: uct_cm_h,
}
#[test]
fn bindgen_test_layout_uct_listener() {
    const UNINIT: ::std::mem::MaybeUninit<uct_listener> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<uct_listener>(),
        8usize,
        concat!("Size of: ", stringify!(uct_listener))
    );
    assert_eq!(
        ::std::mem::align_of::<uct_listener>(),
        8usize,
        concat!("Alignment of ", stringify!(uct_listener))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cm) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_listener),
            "::",
            stringify!(cm)
        )
    );
}
#[doc = " Listener for incoming connections"]
pub type uct_listener_t = uct_listener;
#[doc = " Receive descriptor"]
pub type uct_recv_desc_t = uct_recv_desc;
pub type uct_desc_release_callback_t = ::std::option::Option<
    unsafe extern "C" fn(self_: *mut uct_recv_desc_t, desc: *mut ::std::os::raw::c_void),
>;
#[doc = " Receive descriptor"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uct_recv_desc {
    pub cb: uct_desc_release_callback_t,
}
#[test]
fn bindgen_test_layout_uct_recv_desc() {
    const UNINIT: ::std::mem::MaybeUninit<uct_recv_desc> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<uct_recv_desc>(),
        8usize,
        concat!("Size of: ", stringify!(uct_recv_desc))
    );
    assert_eq!(
        ::std::mem::align_of::<uct_recv_desc>(),
        8usize,
        concat!("Alignment of ", stringify!(uct_recv_desc))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cb) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_recv_desc),
            "::",
            stringify!(cb)
        )
    );
}
#[doc = " @ingroup UCS_RESOURCE\n\n UCS time units.\n These are not necessarily aligned with metric time units.\n MUST compare short time values with UCS_SHORT_TIME_CMP to handle wrap-around."]
pub type ucs_time_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ucs_sys_event_set {
    _unused: [u8; 0],
}
#[doc = " ucs_sys_event_set_t structure used in ucs_event_set_XXX functions.\n"]
pub type ucs_sys_event_set_t = ucs_sys_event_set;
#[doc = " Bit set composed using the available event types"]
pub type ucs_event_set_types_t = u8;
#[doc = " ucs_event_set_handler call this handler for notifying event\n\n @param [in] callback_data  User data which set in ucs_event_set_add().\n @param [in] events         Detection event. Sets of ucs_event_set_types_t.\n @param [in] arg            User data which set in ucs_event_set_wait().\n"]
pub type ucs_event_set_handler_t = ::std::option::Option<
    unsafe extern "C" fn(
        callback_data: *mut ::std::os::raw::c_void,
        events: ucs_event_set_types_t,
        arg: *mut ::std::os::raw::c_void,
    ),
>;
#[repr(u32)]
#[doc = " Event types that could be requested to notify"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ucs_event_set_type_t {
    UCS_EVENT_SET_EVREAD = 1,
    UCS_EVENT_SET_EVWRITE = 2,
    UCS_EVENT_SET_EVERR = 4,
    UCS_EVENT_SET_EDGE_TRIGGERED = 8,
}
extern "C" {
    pub static ucs_sys_event_set_max_wait_events: ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " Allocate ucs_sys_event_set_t structure and assign provided file\n descriptor to wait for events on.\n\n @param [out] event_set_p  Event set pointer to initialize.\n @param [in]  event_fd     File descriptor to wait for events on.\n\n @return UCS_OK on success or an error code on failure."]
    pub fn ucs_event_set_create_from_fd(
        event_set_p: *mut *mut ucs_sys_event_set_t,
        event_fd: ::std::os::raw::c_int,
    ) -> ucs_status_t;
}
extern "C" {
    #[doc = " Allocate ucs_sys_event_set_t structure.\n\n @param [out] event_set_p  Event set pointer to initialize.\n\n @return UCS_OK on success or an error code on failure."]
    pub fn ucs_event_set_create(event_set_p: *mut *mut ucs_sys_event_set_t) -> ucs_status_t;
}
extern "C" {
    #[doc = " Register the target event.\n\n @param [in] event_set_p   Event set pointer to initialize.\n @param [in] fd            Register the target file descriptor fd.\n @param [in] events        Operation events.\n @param [in] callback_data ucs_event_set_handler_t accepts this data.\n\n @return UCS_OK on success or an error code on failure."]
    pub fn ucs_event_set_add(
        event_set: *mut ucs_sys_event_set_t,
        fd: ::std::os::raw::c_int,
        events: ucs_event_set_types_t,
        callback_data: *mut ::std::os::raw::c_void,
    ) -> ucs_status_t;
}
extern "C" {
    #[doc = " Modify the target event.\n\n @param [in] event_set     Event set created by ucs_event_set_create.\n @param [in] fd            Register the target file descriptor fd.\n @param [in] events        Operation events.\n @param [in] callback_data ucs_event_set_handler_t accepts this data.\n\n @return UCS_OK on success or an error code on failure."]
    pub fn ucs_event_set_mod(
        event_set: *mut ucs_sys_event_set_t,
        fd: ::std::os::raw::c_int,
        events: ucs_event_set_types_t,
        callback_data: *mut ::std::os::raw::c_void,
    ) -> ucs_status_t;
}
extern "C" {
    #[doc = " Remove the target event.\n\n @param [in] event_set    Event set created by ucs_event_set_create.\n @param [in] fd           Register the target file descriptor fd.\n\n @return UCS_OK on success or an error code on failure."]
    pub fn ucs_event_set_del(
        event_set: *mut ucs_sys_event_set_t,
        fd: ::std::os::raw::c_int,
    ) -> ucs_status_t;
}
extern "C" {
    #[doc = " Wait for an I/O events\n\n @param [in]     event_set          Event set created by ucs_event_set_create.\n @param [in/out] num_events         Number of expected/read events.\n @param [in]     timeout_ms         Timeout period in ms.\n @param [in]     event_set_handler  Callback functions.\n @param [in]     arg                User data variables.\n\n @return return UCS_OK on success, UCS_INPROGRESS - call was interrupted by a\n         signal handler, UCS_ERR_IO_ERROR - an error occurred during waiting\n         for I/O events."]
    pub fn ucs_event_set_wait(
        event_set: *mut ucs_sys_event_set_t,
        num_events: *mut ::std::os::raw::c_uint,
        timeout_ms: ::std::os::raw::c_int,
        event_set_handler: ucs_event_set_handler_t,
        arg: *mut ::std::os::raw::c_void,
    ) -> ucs_status_t;
}
extern "C" {
    #[doc = " Cleanup event set\n\n @param [in] event_set    Event set created by ucs_event_set_create.\n"]
    pub fn ucs_event_set_cleanup(event_set: *mut ucs_sys_event_set_t);
}
extern "C" {
    #[doc = " Get file descriptor for watching events.\n\n @param [in]  event_set    Event set created by ucs_event_set_create.\n @param [out] event_fd_p   File descriptor that is used by Event set to wait\n                           for events on.\n\n @return UCS_OK on success or an error code on failure."]
    pub fn ucs_event_set_fd_get(
        event_set: *mut ucs_sys_event_set_t,
        event_fd_p: *mut ::std::os::raw::c_int,
    ) -> ucs_status_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ucs_async_context {
    _unused: [u8; 0],
}
pub type ucs_async_context_t = ucs_async_context;
#[doc = " @ingroup UCS_RESOURCE\n\n Async event callback.\n\n @param id           Event id (timer or file descriptor).\n @param events       The events that triggered the callback.\n @param arg          User-defined argument."]
pub type ucs_async_event_cb_t = ::std::option::Option<
    unsafe extern "C" fn(
        id: ::std::os::raw::c_int,
        events: ucs_event_set_types_t,
        arg: *mut ::std::os::raw::c_void,
    ),
>;
extern "C" {
    #[doc = " @ingroup UCS_RESOURCE\n\n Register a file descriptor for monitoring (call handler upon events).\n Every fd can have only one handler.\n\n @param mode            Thread or signal.\n @param event_fd        File descriptor to set handler for.\n @param events          Events to wait on (UCS_EVENT_SET_EVxxx bits).\n @param cb              Callback function to execute.\n @param arg             Argument to callback.\n @param async           Async context to which events are delivered.\n                        If NULL, safety is up to the user.\n\n @return Error code as defined by @ref ucs_status_t."]
    pub fn ucs_async_set_event_handler(
        mode: ucs_async_mode_t,
        event_fd: ::std::os::raw::c_int,
        events: ucs_event_set_types_t,
        cb: ucs_async_event_cb_t,
        arg: *mut ::std::os::raw::c_void,
        async_: *mut ucs_async_context_t,
    ) -> ucs_status_t;
}
extern "C" {
    #[doc = " @ingroup UCS_RESOURCE\n\n Add timer handler.\n\n @param mode            Thread or signal.\n @param interval        Timer interval.\n @param cb              Callback function to execute.\n @param arg             Argument to callback.\n @param async           Async context to which events are delivered.\n                        If NULL, safety is up to the user.\n @param timer_id_p      Filled with timer id.\n\n @return Error code as defined by @ref ucs_status_t."]
    pub fn ucs_async_add_timer(
        mode: ucs_async_mode_t,
        interval: ucs_time_t,
        cb: ucs_async_event_cb_t,
        arg: *mut ::std::os::raw::c_void,
        async_: *mut ucs_async_context_t,
        timer_id_p: *mut ::std::os::raw::c_int,
    ) -> ucs_status_t;
}
extern "C" {
    #[doc = " @ingroup UCS_RESOURCE\n\n Remove an event handler (Timer or event file).\n\n @param id        Timer/FD to remove.\n @param sync      If nonzero, wait until the handler for this event is not\n                  running anymore. If called from the context of the callback,\n                  the handler will be removed immediately after the current\n                  callback returns.\n\n @return Error code as defined by @ref ucs_status_t."]
    pub fn ucs_async_remove_handler(
        id: ::std::os::raw::c_int,
        sync: ::std::os::raw::c_int,
    ) -> ucs_status_t;
}
extern "C" {
    #[doc = " @ingroup UCS_RESOURCE\n\n Modify events mask for an existing event handler (event file).\n\n @param fd        File descriptor modify events for.\n @param events    New set of events to wait on (UCS_EVENT_SET_EVxxx bits).\n\n @return Error code as defined by @ref ucs_status_t."]
    pub fn ucs_async_modify_handler(
        fd: ::std::os::raw::c_int,
        events: ucs_event_set_types_t,
    ) -> ucs_status_t;
}
extern "C" {
    #[doc = " @ingroup UCS_RESOURCE\n @brief Create an asynchronous execution context\n\n Allocate and initialize an asynchronous execution context.\n This can be used to ensure safe event delivery.\n\n @param mode            Indicates whether to use signals or polling threads\n                        for waiting.\n @param async_p         Event context pointer to initialize.\n\n @return Error code as defined by @ref ucs_status_t."]
    pub fn ucs_async_context_create(
        mode: ucs_async_mode_t,
        async_p: *mut *mut ucs_async_context_t,
    ) -> ucs_status_t;
}
extern "C" {
    #[doc = " @ingroup UCS_RESOURCE\n @brief Destroy the asynchronous execution context\n\n Clean up the async context, and release system resources if possible.\n The context memory released.\n\n @param async           Asynchronous context to clean up."]
    pub fn ucs_async_context_destroy(async_: *mut ucs_async_context_t);
}
extern "C" {
    #[doc = " @ingroup UCS_RESOURCE\n\n Poll on async context.\n\n @param async Async context to poll on. NULL polls on all."]
    pub fn ucs_async_poll(async_: *mut ucs_async_context_t);
}
impl ucs_callbackq_flags {
    #[doc = "< Fast-path (best effort)"]
    pub const UCS_CALLBACKQ_FLAG_FAST: ucs_callbackq_flags = ucs_callbackq_flags(1);
}
impl ucs_callbackq_flags {
    #[doc = "< Call the callback only once\n(cannot be used with FAST)"]
    pub const UCS_CALLBACKQ_FLAG_ONESHOT: ucs_callbackq_flags = ucs_callbackq_flags(2);
}
impl ::std::ops::BitOr<ucs_callbackq_flags> for ucs_callbackq_flags {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        ucs_callbackq_flags(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for ucs_callbackq_flags {
    #[inline]
    fn bitor_assign(&mut self, rhs: ucs_callbackq_flags) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<ucs_callbackq_flags> for ucs_callbackq_flags {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        ucs_callbackq_flags(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for ucs_callbackq_flags {
    #[inline]
    fn bitand_assign(&mut self, rhs: ucs_callbackq_flags) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[doc = " @ingroup UCS_RESOURCE\n Callback backward compatibility flags"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct ucs_callbackq_flags(pub ::std::os::raw::c_uint);
#[doc = " A 1d linear function, represented as f(x) = c + x * m."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ucs_linear_func_t {
    pub c: f64,
    pub m: f64,
}
#[test]
fn bindgen_test_layout_ucs_linear_func_t() {
    const UNINIT: ::std::mem::MaybeUninit<ucs_linear_func_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ucs_linear_func_t>(),
        16usize,
        concat!("Size of: ", stringify!(ucs_linear_func_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ucs_linear_func_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ucs_linear_func_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).c) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ucs_linear_func_t),
            "::",
            stringify!(c)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ucs_linear_func_t),
            "::",
            stringify!(m)
        )
    );
}
impl ucs_memory_type {
    pub const UCS_MEMORY_TYPE_UNKNOWN: ucs_memory_type = ucs_memory_type::UCS_MEMORY_TYPE_LAST;
}
#[repr(u32)]
#[doc = " @ingroup UCS_RESOURCE\n @brief Memory types\n\n List of supported memory types."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ucs_memory_type {
    #[doc = "< Default system memory"]
    UCS_MEMORY_TYPE_HOST = 0,
    #[doc = "< NVIDIA CUDA memory"]
    UCS_MEMORY_TYPE_CUDA = 1,
    #[doc = "< NVIDIA CUDA managed (or unified) memory"]
    UCS_MEMORY_TYPE_CUDA_MANAGED = 2,
    #[doc = "< AMD ROCM memory"]
    UCS_MEMORY_TYPE_ROCM = 3,
    #[doc = "< AMD ROCM managed system memory"]
    UCS_MEMORY_TYPE_ROCM_MANAGED = 4,
    #[doc = "< RDMA device memory"]
    UCS_MEMORY_TYPE_RDMA = 5,
    #[doc = "< Intel ZE memory (USM host)"]
    UCS_MEMORY_TYPE_ZE_HOST = 6,
    #[doc = "< Intel ZE memory (USM device)"]
    UCS_MEMORY_TYPE_ZE_DEVICE = 7,
    #[doc = "< Intel ZE managed memory (USM shared)"]
    UCS_MEMORY_TYPE_ZE_MANAGED = 8,
    UCS_MEMORY_TYPE_LAST = 9,
}
#[doc = " @ingroup UCS_RESOURCE\n @brief Memory types\n\n List of supported memory types."]
pub use self::ucs_memory_type as ucs_memory_type_t;
extern "C" {
    #[doc = " Array of string names for each memory type"]
    pub static mut ucs_memory_type_names: [*const ::std::os::raw::c_char; 0usize];
}
extern "C" {
    #[doc = " Array of string descriptions for each memory type"]
    pub static mut ucs_memory_type_descs: [*const ::std::os::raw::c_char; 0usize];
}
#[repr(u32)]
#[doc = " @ingroup UCS_RESOURCE\n @brief Thread sharing mode\n\n Specifies thread sharing mode of an object."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ucs_thread_mode_t {
    #[doc = "< Only the master thread can access (i.e. the thread that initialized the context; multiple threads may exist and never access)"]
    UCS_THREAD_MODE_SINGLE = 0,
    #[doc = "< Multiple threads can access, but only one at a time"]
    UCS_THREAD_MODE_SERIALIZED = 1,
    #[doc = "< Multiple threads can access concurrently"]
    UCS_THREAD_MODE_MULTI = 2,
    UCS_THREAD_MODE_LAST = 3,
}
extern "C" {
    pub static mut ucs_thread_mode_names: [*const ::std::os::raw::c_char; 0usize];
}
pub type ucs_cpu_mask_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ucs_cpu_set_t {
    pub ucs_bits: [ucs_cpu_mask_t; 16usize],
}
#[test]
fn bindgen_test_layout_ucs_cpu_set_t() {
    const UNINIT: ::std::mem::MaybeUninit<ucs_cpu_set_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ucs_cpu_set_t>(),
        128usize,
        concat!("Size of: ", stringify!(ucs_cpu_set_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ucs_cpu_set_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ucs_cpu_set_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ucs_bits) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ucs_cpu_set_t),
            "::",
            stringify!(ucs_bits)
        )
    );
}
#[doc = " @file stats_fwd.h"]
pub type ucs_stats_counter_t = u64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ucs_stats_class {
    _unused: [u8; 0],
}
pub type ucs_stats_class_t = ucs_stats_class;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ucs_stats_node {
    _unused: [u8; 0],
}
pub type ucs_stats_node_t = ucs_stats_node;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ucs_stats_filter_node {
    _unused: [u8; 0],
}
pub type ucs_stats_filter_node_t = ucs_stats_filter_node;
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ucs_stats_formats_t {
    UCS_STATS_FULL = 0,
    UCS_STATS_FULL_AGG = 1,
    UCS_STATS_SUMMARY = 2,
    UCS_STATS_LAST = 3,
}
extern "C" {
    pub static mut ucs_stats_formats_names: [*const ::std::os::raw::c_char; 0usize];
}
extern "C" {
    pub fn ucs_stats_get_root() -> *mut ucs_stats_node_t;
}
pub type ucs_numa_distance_t = ::std::os::raw::c_int;
pub type ucs_numa_node_t = i16;
extern "C" {
    pub static mut ucs_numa_policy_names: [*const ::std::os::raw::c_char; 0usize];
}
extern "C" {
    pub fn ucs_numa_init();
}
extern "C" {
    pub fn ucs_numa_cleanup();
}
extern "C" {
    #[doc = " @return The number of CPU cores in the system."]
    pub fn ucs_numa_num_configured_cpus() -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " @return The number of memory nodes in the system."]
    pub fn ucs_numa_num_configured_nodes() -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " @param [in]  cpu CPU to query.\n\n @return The NUMA node that the cpu belongs to."]
    pub fn ucs_numa_node_of_cpu(cpu: ::std::os::raw::c_int) -> ucs_numa_node_t;
}
extern "C" {
    #[doc = " @param [in]  dev_path sysfs path of the device.\n\n @return The node that the device belongs to."]
    pub fn ucs_numa_node_of_device(dev_path: *const ::std::os::raw::c_char) -> ucs_numa_node_t;
}
extern "C" {
    #[doc = " Reports the distance between two nodes according to the machine topology.\n\n @param [in]  node1 first NUMA node.\n @param [in]  node2 second NUMA node.\n\n @return NUMA distance between the two NUMA nodes."]
    pub fn ucs_numa_distance(node1: ucs_numa_node_t, node2: ucs_numa_node_t)
        -> ucs_numa_distance_t;
}
pub type FILE = _IO_FILE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_marker {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_codecvt {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_wide_data {
    _unused: [u8; 0],
}
pub type _IO_lock_t = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE {
    pub _flags: ::std::os::raw::c_int,
    pub _IO_read_ptr: *mut ::std::os::raw::c_char,
    pub _IO_read_end: *mut ::std::os::raw::c_char,
    pub _IO_read_base: *mut ::std::os::raw::c_char,
    pub _IO_write_base: *mut ::std::os::raw::c_char,
    pub _IO_write_ptr: *mut ::std::os::raw::c_char,
    pub _IO_write_end: *mut ::std::os::raw::c_char,
    pub _IO_buf_base: *mut ::std::os::raw::c_char,
    pub _IO_buf_end: *mut ::std::os::raw::c_char,
    pub _IO_save_base: *mut ::std::os::raw::c_char,
    pub _IO_backup_base: *mut ::std::os::raw::c_char,
    pub _IO_save_end: *mut ::std::os::raw::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: ::std::os::raw::c_int,
    pub _flags2: ::std::os::raw::c_int,
    pub _old_offset: __off_t,
    pub _cur_column: ::std::os::raw::c_ushort,
    pub _vtable_offset: ::std::os::raw::c_schar,
    pub _shortbuf: [::std::os::raw::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub _offset: __off64_t,
    pub _codecvt: *mut _IO_codecvt,
    pub _wide_data: *mut _IO_wide_data,
    pub _freeres_list: *mut _IO_FILE,
    pub _freeres_buf: *mut ::std::os::raw::c_void,
    pub __pad5: usize,
    pub _mode: ::std::os::raw::c_int,
    pub _unused2: [::std::os::raw::c_char; 20usize],
}
#[test]
fn bindgen_test_layout__IO_FILE() {
    const UNINIT: ::std::mem::MaybeUninit<_IO_FILE> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_IO_FILE>(),
        216usize,
        concat!("Size of: ", stringify!(_IO_FILE))
    );
    assert_eq!(
        ::std::mem::align_of::<_IO_FILE>(),
        8usize,
        concat!("Alignment of ", stringify!(_IO_FILE))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._flags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_read_ptr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_ptr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_read_end) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_end)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_read_base) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_write_base) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_write_ptr) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_ptr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_write_end) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_end)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_buf_base) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_buf_end) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_end)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_save_base) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_backup_base) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_backup_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_save_end) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_end)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._markers) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_markers)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._chain) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_chain)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._fileno) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_fileno)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._flags2) as usize - ptr as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._old_offset) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_old_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._cur_column) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_cur_column)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._vtable_offset) as usize - ptr as usize },
        130usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_vtable_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._shortbuf) as usize - ptr as usize },
        131usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_shortbuf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._lock) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_lock)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._offset) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._codecvt) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_codecvt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wide_data) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_wide_data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._freeres_list) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_freeres_list)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._freeres_buf) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_freeres_buf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad5) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad5)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._mode) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._unused2) as usize - ptr as usize },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_unused2)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ucs_sys_bus_id {
    pub domain: u16,
    pub bus: u8,
    pub slot: u8,
    pub function: u8,
}
#[test]
fn bindgen_test_layout_ucs_sys_bus_id() {
    const UNINIT: ::std::mem::MaybeUninit<ucs_sys_bus_id> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ucs_sys_bus_id>(),
        6usize,
        concat!("Size of: ", stringify!(ucs_sys_bus_id))
    );
    assert_eq!(
        ::std::mem::align_of::<ucs_sys_bus_id>(),
        2usize,
        concat!("Alignment of ", stringify!(ucs_sys_bus_id))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).domain) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ucs_sys_bus_id),
            "::",
            stringify!(domain)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bus) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(ucs_sys_bus_id),
            "::",
            stringify!(bus)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).slot) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(ucs_sys_bus_id),
            "::",
            stringify!(slot)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).function) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ucs_sys_bus_id),
            "::",
            stringify!(function)
        )
    );
}
pub type ucs_sys_bus_id_t = ucs_sys_bus_id;
#[doc = " @ingroup UCS_RESOURCE\n System Device Index\n Obtained from a translation of the device bus id into a short integer\n Refer ucs_topo_find_device_by_bus_id()"]
pub type ucs_sys_device_t = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ucs_sys_dev_distance {
    #[doc = "< in seconds"]
    pub latency: f64,
    #[doc = "< in bytes/second"]
    pub bandwidth: f64,
}
#[test]
fn bindgen_test_layout_ucs_sys_dev_distance() {
    const UNINIT: ::std::mem::MaybeUninit<ucs_sys_dev_distance> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ucs_sys_dev_distance>(),
        16usize,
        concat!("Size of: ", stringify!(ucs_sys_dev_distance))
    );
    assert_eq!(
        ::std::mem::align_of::<ucs_sys_dev_distance>(),
        8usize,
        concat!("Alignment of ", stringify!(ucs_sys_dev_distance))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).latency) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ucs_sys_dev_distance),
            "::",
            stringify!(latency)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bandwidth) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ucs_sys_dev_distance),
            "::",
            stringify!(bandwidth)
        )
    );
}
pub type ucs_sys_dev_distance_t = ucs_sys_dev_distance;
extern "C" {
    pub static ucs_topo_default_distance: ucs_sys_dev_distance_t;
}
pub type ucs_topo_get_distance_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        device1: ucs_sys_device_t,
        device2: ucs_sys_device_t,
        distance: *mut ucs_sys_dev_distance_t,
    ) -> ucs_status_t,
>;
extern "C" {
    pub static mut ucs_sys_topo_providers_list: ucs_list_link_t;
}
extern "C" {
    #[doc = " Find system device by pci bus id.\n\n @param [in]  bus_id  pointer to bus id of the device of interest.\n @param [out] sys_dev system device index associated with the bus_id.\n\n @return UCS_OK or error in case device cannot be found."]
    pub fn ucs_topo_find_device_by_bus_id(
        bus_id: *const ucs_sys_bus_id_t,
        sys_dev: *mut ucs_sys_device_t,
    ) -> ucs_status_t;
}
extern "C" {
    #[doc = " Find pci bus id of the given system device.\n\n @param [in]  sys_dev system device index.\n @param [out] bus_id  pointer to bus id to be populated.\n\n @return UCS_OK or error in case system device or its bus id cannot be found."]
    pub fn ucs_topo_get_device_bus_id(
        sys_dev: ucs_sys_device_t,
        bus_id: *mut ucs_sys_bus_id_t,
    ) -> ucs_status_t;
}
extern "C" {
    #[doc = " Find the distance between two system devices (in terms of latency,\n bandwidth, hops, etc).\n\n @param [in]  device1   System device index of the first device.\n @param [in]  device2   System device index of the second device.\n @param [out] distance  Result populated with distance details between the two\n                        devices.\n\n @return UCS_OK or error in case distance cannot be determined."]
    pub fn ucs_topo_get_distance(
        device1: ucs_sys_device_t,
        device2: ucs_sys_device_t,
        distance: *mut ucs_sys_dev_distance_t,
    ) -> ucs_status_t;
}
extern "C" {
    #[doc = " Find the memory distance of the device according to process affinity.\n\n @param [in]  device   System device index.\n @param [out] distance Result populated with the device memory distance.\n"]
    pub fn ucs_topo_get_memory_distance(
        device: ucs_sys_device_t,
        distance: *mut ucs_sys_dev_distance_t,
    );
}
extern "C" {
    #[doc = " Convert the distance to a human-readable string.\n\n @param [in]  distance   Distance between two devices.\n @param [out] buffer     String buffer to fill with distance string.\n @param [in]  max        Maximal size of the string buffer.\n\n @return Pointer to the distance string."]
    pub fn ucs_topo_distance_str(
        distance: *const ucs_sys_dev_distance_t,
        buffer: *mut ::std::os::raw::c_char,
        max: usize,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " Gets a system device. If the device doesn't exist, it will be added.\n\n @param [in]  dev_name       Device Name.\n @param [in]  sysfs_path     sysfs path for the required device.\n @param [in]  name_priority  Indicates whether to override device name\n                             if it already exists.\n\n @return A topo module identifier for the device."]
    pub fn ucs_topo_get_sysfs_dev(
        dev_name: *const ::std::os::raw::c_char,
        sysfs_path: *const ::std::os::raw::c_char,
        name_priority: ::std::os::raw::c_uint,
    ) -> ucs_sys_device_t;
}
extern "C" {
    #[doc = " Return system device name in BDF format: \"<domain>:<bus>:<device>.<function>\".\n\n @param [in]  sys_dev  System device id, as returned from\n                       @ref ucs_topo_find_device_by_bus_id.\n @param [out] buffer   String buffer, filled the device name.\n @param [in]  max      Maximal size of @a buffer."]
    pub fn ucs_topo_sys_device_bdf_name(
        sys_dev: ucs_sys_device_t,
        buffer: *mut ::std::os::raw::c_char,
        max: usize,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " Find a system device by its BDF name: \"[<domain>:]<bus>:<device>.<function>\".\n\n @param [in]  name     BDF name to search for.\n @param [out] sys_dev  Filled with system device id, if found.\n\n @return UCS_OK if the device was found, error otherwise."]
    pub fn ucs_topo_find_device_by_bdf_name(
        name: *const ::std::os::raw::c_char,
        sys_dev: *mut ucs_sys_device_t,
    ) -> ucs_status_t;
}
extern "C" {
    #[doc = " Sets a name for a given system device. If the name exists, it will be replaced\n only if @ref priority is higher then current device name priority.\n\n @param [in]  sys_dev  System device to set the name for.\n @param [in]  name     Name to set for this system device. Note: the name can\n                       be released after this call.\n @param [in]  priority Determine whether device name will be overridden,\n                       in case it already exists.\n\n @return UCS_OK if the name was set, error otherwise."]
    pub fn ucs_topo_sys_device_set_name(
        sys_dev: ucs_sys_device_t,
        name: *const ::std::os::raw::c_char,
        priority: ::std::os::raw::c_uint,
    ) -> ucs_status_t;
}
extern "C" {
    #[doc = " Calculates and returns a specific PCIe device BW.\n\n @param dev_name   Device name of the underlying sysfs_path (eg. 'ib0').\n @param sysfs_path Path to the device system folder.\n\n @return BW of the PCIe device on success, or MAX_DBL on failure."]
    pub fn ucs_topo_get_pci_bw(
        dev_name: *const ::std::os::raw::c_char,
        sysfs_path: *const ::std::os::raw::c_char,
    ) -> f64;
}
extern "C" {
    #[doc = " Returns sysfs path of a given device. for example:\n input:  '/sys/class/infiniband/mlx5_1'\n output: '/sys/devices/pci0000:80/0000:80:01.1/0000:83:00.0'\n\n @param [in]  dev_path    Device file path.\n @param [out] path_buffer Filled with the result path.\n\n @return Pointer to sysfs path or NULL on error."]
    pub fn ucs_topo_resolve_sysfs_path(
        dev_path: *const ::std::os::raw::c_char,
        path_buffer: *mut ::std::os::raw::c_char,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " Get the name of a given system device. If the name was never set, it defaults\n to the BDF representation of the system device bus id.\n\n @param [in]  sys_dev System device's name to get.\n\n @return The name of the system device, or NULL if the system device is\n         invalid."]
    pub fn ucs_topo_sys_device_get_name(sys_dev: ucs_sys_device_t)
        -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " Get the closest NUMA node for a given system device.\n\n @param [in] sys_dev input system device.\n\n @return The number of NUMA node closest to given device."]
    pub fn ucs_topo_sys_device_get_numa_node(sys_dev: ucs_sys_device_t) -> ucs_numa_node_t;
}
extern "C" {
    #[doc = " Get the number of registered system devices.\n\n @return Number of system devices."]
    pub fn ucs_topo_num_devices() -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " Print a map indicating the topology information between system devices\n discovered."]
    pub fn ucs_topo_print_info(stream: *mut FILE);
}
extern "C" {
    #[doc = " Initialize UCS topology subsystem."]
    pub fn ucs_topo_init();
}
extern "C" {
    #[doc = " Cleanup UCS topology subsystem."]
    pub fn ucs_topo_cleanup();
}
#[doc = " @ingroup UCT_RESOURCE\n @brief Memory domain resource descriptor.\n\n This structure describes a memory domain resource."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uct_md_resource_desc {
    #[doc = "< Memory domain name"]
    pub md_name: [::std::os::raw::c_char; 16usize],
}
#[test]
fn bindgen_test_layout_uct_md_resource_desc() {
    const UNINIT: ::std::mem::MaybeUninit<uct_md_resource_desc> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<uct_md_resource_desc>(),
        16usize,
        concat!("Size of: ", stringify!(uct_md_resource_desc))
    );
    assert_eq!(
        ::std::mem::align_of::<uct_md_resource_desc>(),
        1usize,
        concat!("Alignment of ", stringify!(uct_md_resource_desc))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).md_name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_md_resource_desc),
            "::",
            stringify!(md_name)
        )
    );
}
#[doc = " @ingroup UCT_RESOURCE\n @brief Memory domain resource descriptor.\n\n This structure describes a memory domain resource."]
pub type uct_md_resource_desc_t = uct_md_resource_desc;
impl uct_component_attr_field {
    #[doc = "< Component name"]
    pub const UCT_COMPONENT_ATTR_FIELD_NAME: uct_component_attr_field = uct_component_attr_field(1);
}
impl uct_component_attr_field {
    #[doc = "< MD resource count"]
    pub const UCT_COMPONENT_ATTR_FIELD_MD_RESOURCE_COUNT: uct_component_attr_field =
        uct_component_attr_field(2);
}
impl uct_component_attr_field {
    #[doc = "< MD resources array"]
    pub const UCT_COMPONENT_ATTR_FIELD_MD_RESOURCES: uct_component_attr_field =
        uct_component_attr_field(4);
}
impl uct_component_attr_field {
    #[doc = "< Capability flags"]
    pub const UCT_COMPONENT_ATTR_FIELD_FLAGS: uct_component_attr_field =
        uct_component_attr_field(8);
}
impl ::std::ops::BitOr<uct_component_attr_field> for uct_component_attr_field {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        uct_component_attr_field(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for uct_component_attr_field {
    #[inline]
    fn bitor_assign(&mut self, rhs: uct_component_attr_field) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<uct_component_attr_field> for uct_component_attr_field {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        uct_component_attr_field(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for uct_component_attr_field {
    #[inline]
    fn bitand_assign(&mut self, rhs: uct_component_attr_field) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[doc = " @ingroup UCT_RESOURCE\n @brief UCT component attributes field mask\n\n The enumeration allows specifying which fields in @ref uct_component_attr_t\n are present. It is used for backward compatibility support."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct uct_component_attr_field(pub ::std::os::raw::c_uint);
#[doc = " @ingroup UCT_RESOURCE\n @brief UCT component attributes\n\n This structure defines the attributes for UCT component. It is used for\n @ref uct_component_query"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uct_component_attr {
    #[doc = " Mask of valid fields in this structure, using bits from\n @ref uct_component_attr_field.\n Fields not specified in this mask will be ignored.\n Provides ABI compatibility with respect to adding new fields."]
    pub field_mask: u64,
    #[doc = " Component name"]
    pub name: [::std::os::raw::c_char; 16usize],
    #[doc = " Number of memory-domain resources"]
    pub md_resource_count: ::std::os::raw::c_uint,
    #[doc = " Array of memory domain resources. When used, it should be initialized\n prior to calling @ref uct_component_query with a pointer to an array,\n which is large enough to hold all memory domain resource entries. After\n the call, this array will be filled with information about existing\n memory domain resources.\n In order to allocate this array, you can call @ref uct_component_query\n twice: The first time would only obtain the amount of entries required,\n by specifying @ref UCT_COMPONENT_ATTR_FIELD_MD_RESOURCE_COUNT in\n field_mask. Then the array could be allocated with the returned number of\n entries, and passed to a second call to @ref uct_component_query, this\n time setting field_mask to @ref UCT_COMPONENT_ATTR_FIELD_MD_RESOURCES."]
    pub md_resources: *mut uct_md_resource_desc_t,
    #[doc = " Flags as defined by UCT_COMPONENT_FLAG_xx."]
    pub flags: u64,
}
#[test]
fn bindgen_test_layout_uct_component_attr() {
    const UNINIT: ::std::mem::MaybeUninit<uct_component_attr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<uct_component_attr>(),
        48usize,
        concat!("Size of: ", stringify!(uct_component_attr))
    );
    assert_eq!(
        ::std::mem::align_of::<uct_component_attr>(),
        8usize,
        concat!("Alignment of ", stringify!(uct_component_attr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).field_mask) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_component_attr),
            "::",
            stringify!(field_mask)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_component_attr),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).md_resource_count) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_component_attr),
            "::",
            stringify!(md_resource_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).md_resources) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_component_attr),
            "::",
            stringify!(md_resources)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_component_attr),
            "::",
            stringify!(flags)
        )
    );
}
#[doc = " @ingroup UCT_RESOURCE\n @brief UCT component attributes\n\n This structure defines the attributes for UCT component. It is used for\n @ref uct_component_query"]
pub type uct_component_attr_t = uct_component_attr;
pub const UCT_COMPONENT_FLAG_CM: _bindgen_ty_5 = _bindgen_ty_5::UCT_COMPONENT_FLAG_CM;
pub const UCT_COMPONENT_FLAG_RKEY_PTR: _bindgen_ty_5 = _bindgen_ty_5::UCT_COMPONENT_FLAG_RKEY_PTR;
#[repr(u32)]
#[doc = " @ingroup UCT_RESOURCE\n @brief Capability flags of @ref uct_component_h.\n\n The enumeration defines bit mask of @ref uct_component_h capabilities in\n @ref uct_component_attr_t::flags which is set by @ref uct_component_query."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_5 {
    #[doc = " If set, the component supports @ref uct_cm_h functionality.\n See @ref uct_cm_open for details."]
    UCT_COMPONENT_FLAG_CM = 1,
    #[doc = " If set, the component supports direct access to remote memory using a\n local pointer returned from @ref uct_rkey_ptr function."]
    UCT_COMPONENT_FLAG_RKEY_PTR = 2,
}
#[repr(u32)]
#[doc = " @ingroup UCT_RESOURCE\n @brief  List of UCX device types."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum uct_device_type_t {
    #[doc = "< Network devices"]
    UCT_DEVICE_TYPE_NET = 0,
    #[doc = "< Shared memory devices"]
    UCT_DEVICE_TYPE_SHM = 1,
    #[doc = "< Acceleration devices"]
    UCT_DEVICE_TYPE_ACC = 2,
    #[doc = "< Loop-back device"]
    UCT_DEVICE_TYPE_SELF = 3,
    UCT_DEVICE_TYPE_LAST = 4,
}
#[doc = " @ingroup UCT_RESOURCE\n @brief Communication resource descriptor.\n\n Resource descriptor is an object representing the network resource.\n Resource descriptor could represent a stand-alone communication resource\n such as an HCA port, network interface, or multiple resources such as\n multiple network interfaces or communication ports. It could also represent\n virtual communication resources that are defined over a single physical\n network interface."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uct_tl_resource_desc {
    #[doc = "< Transport name"]
    pub tl_name: [::std::os::raw::c_char; 10usize],
    #[doc = "< Hardware device name"]
    pub dev_name: [::std::os::raw::c_char; 32usize],
    #[doc = "< The device represented by this resource\n(e.g. UCT_DEVICE_TYPE_NET for a network interface)"]
    pub dev_type: uct_device_type_t,
    #[doc = "< The identifier associated with the device\nbus_id as captured in ucs_sys_bus_id_t struct"]
    pub sys_device: ucs_sys_device_t,
}
#[test]
fn bindgen_test_layout_uct_tl_resource_desc() {
    const UNINIT: ::std::mem::MaybeUninit<uct_tl_resource_desc> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<uct_tl_resource_desc>(),
        52usize,
        concat!("Size of: ", stringify!(uct_tl_resource_desc))
    );
    assert_eq!(
        ::std::mem::align_of::<uct_tl_resource_desc>(),
        4usize,
        concat!("Alignment of ", stringify!(uct_tl_resource_desc))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tl_name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_tl_resource_desc),
            "::",
            stringify!(tl_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dev_name) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_tl_resource_desc),
            "::",
            stringify!(dev_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dev_type) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_tl_resource_desc),
            "::",
            stringify!(dev_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sys_device) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_tl_resource_desc),
            "::",
            stringify!(sys_device)
        )
    );
}
#[doc = " @ingroup UCT_RESOURCE\n @brief Communication resource descriptor.\n\n Resource descriptor is an object representing the network resource.\n Resource descriptor could represent a stand-alone communication resource\n such as an HCA port, network interface, or multiple resources such as\n multiple network interfaces or communication ports. It could also represent\n virtual communication resources that are defined over a single physical\n network interface."]
pub type uct_tl_resource_desc_t = uct_tl_resource_desc;
#[repr(u32)]
#[doc = " @brief Atomic operation requested for uct_ep_atomic32_post, uct_ep_atomic64_post,\n uct_ep_atomic32_fetch and uct_ep_atomic64_fetch.\n\n This enumeration defines which atomic memory operation should be\n performed by the uct_ep_atomic family of functions."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum uct_atomic_op {
    #[doc = "< Atomic add"]
    UCT_ATOMIC_OP_ADD = 0,
    #[doc = "< Atomic and"]
    UCT_ATOMIC_OP_AND = 1,
    #[doc = "< Atomic or"]
    UCT_ATOMIC_OP_OR = 2,
    #[doc = "< Atomic xor"]
    UCT_ATOMIC_OP_XOR = 3,
    #[doc = "< Atomic swap"]
    UCT_ATOMIC_OP_SWAP = 4,
    #[doc = "< Atomic compare-and-swap"]
    UCT_ATOMIC_OP_CSWAP = 5,
    UCT_ATOMIC_OP_LAST = 6,
}
#[doc = " @brief Atomic operation requested for uct_ep_atomic32_post, uct_ep_atomic64_post,\n uct_ep_atomic32_fetch and uct_ep_atomic64_fetch.\n\n This enumeration defines which atomic memory operation should be\n performed by the uct_ep_atomic family of functions."]
pub use self::uct_atomic_op as uct_atomic_op_t;
impl uct_alloc_method_t {
    pub const UCT_ALLOC_METHOD_DEFAULT: uct_alloc_method_t =
        uct_alloc_method_t::UCT_ALLOC_METHOD_LAST;
}
#[repr(u32)]
#[doc = " @ingroup UCT_CONTEXT\n @brief  Memory allocation methods."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum uct_alloc_method_t {
    #[doc = "< Allocate from OS using libc allocator with\nTransparent Huge Pages enabled"]
    UCT_ALLOC_METHOD_THP = 0,
    #[doc = "< Allocate using memory domain"]
    UCT_ALLOC_METHOD_MD = 1,
    #[doc = "< Allocate from heap using libc allocator"]
    UCT_ALLOC_METHOD_HEAP = 2,
    #[doc = "< Allocate from OS using mmap() syscall"]
    UCT_ALLOC_METHOD_MMAP = 3,
    #[doc = "< Allocate huge pages"]
    UCT_ALLOC_METHOD_HUGE = 4,
    UCT_ALLOC_METHOD_LAST = 5,
}
#[repr(u32)]
#[doc = " @ingroup UCT_RESOURCE\n @brief  Asynchronous event types.\n\n @note The UCT_EVENT_RECV and UCT_EVENT_RECV_SIG event types are used to\n       indicate receive-side completions for both tag matching and active\n       messages. If the interface supports signaled receives\n       (@ref UCT_IFACE_FLAG_EVENT_RECV_SIG), then for the messages sent with\n       UCT_SEND_FLAG_SIGNALED flag, UCT_EVENT_RECV_SIG should be triggered\n       on the receiver. Otherwise, UCT_EVENT_RECV should be triggered."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum uct_iface_event_types {
    #[doc = "< Send completion event"]
    UCT_EVENT_SEND_COMP = 1,
    #[doc = "< Tag or active message received"]
    UCT_EVENT_RECV = 2,
    #[doc = "< Signaled tag or active message\nreceived"]
    UCT_EVENT_RECV_SIG = 4,
}
impl uct_flush_flags {
    #[doc = "< Guarantees that the data\ntransfer is completed but the\ntarget buffer may not be\nupdated yet."]
    pub const UCT_FLUSH_FLAG_LOCAL: uct_flush_flags = uct_flush_flags(0);
}
impl uct_flush_flags {
    #[doc = "< The library will make a best\neffort attempt to cancel all\nuncompleted operations.\nHowever, there is a chance that\nsome operations will not be\ncanceled in which case the user\nwill need to handle their\ncompletions through\nthe relevant callbacks.\nAfter @ref uct_ep_flush\nwith this flag is completed,\nthe endpoint will be set to\nerror state, and it becomes\nunusable for send operations\nand should be destroyed."]
    pub const UCT_FLUSH_FLAG_CANCEL: uct_flush_flags = uct_flush_flags(1);
}
impl uct_flush_flags {
    #[doc = "< Guarantees that all previous\nUCP memory update operations\n(put, atomics, etc.) are\ncompleted, the target memory\nof these operation was updated,\nand the updated memory is\nglobally visible for all\nprocessing elements in the\nsystem."]
    pub const UCT_FLUSH_FLAG_REMOTE: uct_flush_flags = uct_flush_flags(2);
}
impl ::std::ops::BitOr<uct_flush_flags> for uct_flush_flags {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        uct_flush_flags(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for uct_flush_flags {
    #[inline]
    fn bitor_assign(&mut self, rhs: uct_flush_flags) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<uct_flush_flags> for uct_flush_flags {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        uct_flush_flags(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for uct_flush_flags {
    #[inline]
    fn bitand_assign(&mut self, rhs: uct_flush_flags) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[doc = " @ingroup UCT_RESOURCE\n @brief  Flush modifiers."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct uct_flush_flags(pub ::std::os::raw::c_uint);
#[repr(u32)]
#[doc = " @ingroup UCT_RESOURCE\n @brief UCT progress types"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum uct_progress_types {
    #[doc = "< Progress send operations"]
    UCT_PROGRESS_SEND = 1,
    #[doc = "< Progress receive operations"]
    UCT_PROGRESS_RECV = 2,
    #[doc = "< Enable/disable progress while\nanother thread may be calling\n@ref ucp_worker_progress()."]
    UCT_PROGRESS_THREAD_SAFE = 128,
}
impl uct_msg_flags {
    #[doc = "< Trigger @ref UCT_EVENT_RECV_SIG\nevent on remote side. Make best\neffort attempt to avoid\ntriggering @ref UCT_EVENT_RECV\nevent. Ignored if not supported\nby interface."]
    pub const UCT_SEND_FLAG_SIGNALED: uct_msg_flags = uct_msg_flags(1);
}
impl uct_msg_flags {
    #[doc = "< Forces checking connectivity to\na peer. If the connection is\nnot alive, an error callback\nwill be invoked. If the flag is\nnot set, there is no guarantee\nthat a connectivity error could\nbe detected."]
    pub const UCT_SEND_FLAG_PEER_CHECK: uct_msg_flags = uct_msg_flags(2);
}
impl ::std::ops::BitOr<uct_msg_flags> for uct_msg_flags {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        uct_msg_flags(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for uct_msg_flags {
    #[inline]
    fn bitor_assign(&mut self, rhs: uct_msg_flags) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<uct_msg_flags> for uct_msg_flags {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        uct_msg_flags(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for uct_msg_flags {
    #[inline]
    fn bitand_assign(&mut self, rhs: uct_msg_flags) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[doc = " @ingroup UCT_AM\n @brief Flags for active message send operation."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct uct_msg_flags(pub ::std::os::raw::c_uint);
impl uct_cb_flags {
    #[doc = "< Reserved for future use."]
    pub const UCT_CB_FLAG_RESERVED: uct_cb_flags = uct_cb_flags(2);
}
impl uct_cb_flags {
    #[doc = "< Callback is allowed to be called\nfrom any thread in the process, and\ntherefore should be thread-safe. For\nexample, it may be called from a\ntransport async progress thread. To\nguarantee async invocation, the\ninterface must have the @ref\nUCT_IFACE_FLAG_CB_ASYNC flag set. If\nasync callback is requested on an\ninterface which only supports sync\ncallback (i.e., only the @ref\nUCT_IFACE_FLAG_CB_SYNC flag is set),\nthe callback will be invoked only\nfrom the context that called @ref\nuct_iface_progress)."]
    pub const UCT_CB_FLAG_ASYNC: uct_cb_flags = uct_cb_flags(4);
}
impl ::std::ops::BitOr<uct_cb_flags> for uct_cb_flags {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        uct_cb_flags(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for uct_cb_flags {
    #[inline]
    fn bitor_assign(&mut self, rhs: uct_cb_flags) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<uct_cb_flags> for uct_cb_flags {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        uct_cb_flags(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for uct_cb_flags {
    #[inline]
    fn bitand_assign(&mut self, rhs: uct_cb_flags) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[doc = " @ingroup UCT_RESOURCE\n @brief Callback flags.\n\n List of flags for a callback."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct uct_cb_flags(pub ::std::os::raw::c_uint);
#[repr(u32)]
#[doc = " @ingroup UCT_RESOURCE\n @brief Mode in which to open the interface."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum uct_iface_open_mode {
    #[doc = " Interface is opened on a specific device"]
    UCT_IFACE_OPEN_MODE_DEVICE = 1,
    #[doc = " Interface is opened on a specific address on the server side. This mode\nwill be deprecated in the near future for a better API."]
    UCT_IFACE_OPEN_MODE_SOCKADDR_SERVER = 2,
    #[doc = " Interface is opened on a specific address on the client side This mode\nwill be deprecated in the near future for a better API."]
    UCT_IFACE_OPEN_MODE_SOCKADDR_CLIENT = 4,
}
impl uct_iface_params_field {
    #[doc = " Enables @ref uct_iface_params_t::cpu_mask"]
    pub const UCT_IFACE_PARAM_FIELD_CPU_MASK: uct_iface_params_field = uct_iface_params_field(1);
}
impl uct_iface_params_field {
    #[doc = " Enables @ref uct_iface_params_t::open_mode"]
    pub const UCT_IFACE_PARAM_FIELD_OPEN_MODE: uct_iface_params_field = uct_iface_params_field(2);
}
impl uct_iface_params_field {
    #[doc = " Enables @ref uct_iface_params_t_mode_device\n  \"uct_iface_params_t::mode::device\""]
    pub const UCT_IFACE_PARAM_FIELD_DEVICE: uct_iface_params_field = uct_iface_params_field(4);
}
impl uct_iface_params_field {
    #[doc = " Enables @ref uct_iface_params_t_mode_sockaddr\n  \"uct_iface_params_t::mode::sockaddr\""]
    pub const UCT_IFACE_PARAM_FIELD_SOCKADDR: uct_iface_params_field = uct_iface_params_field(8);
}
impl uct_iface_params_field {
    #[doc = " Enables @ref uct_iface_params_t::stats_root"]
    pub const UCT_IFACE_PARAM_FIELD_STATS_ROOT: uct_iface_params_field = uct_iface_params_field(16);
}
impl uct_iface_params_field {
    #[doc = " Enables @ref uct_iface_params_t::rx_headroom"]
    pub const UCT_IFACE_PARAM_FIELD_RX_HEADROOM: uct_iface_params_field =
        uct_iface_params_field(32);
}
impl uct_iface_params_field {
    #[doc = " Enables @ref uct_iface_params_t::err_handler_arg"]
    pub const UCT_IFACE_PARAM_FIELD_ERR_HANDLER_ARG: uct_iface_params_field =
        uct_iface_params_field(64);
}
impl uct_iface_params_field {
    #[doc = " Enables @ref uct_iface_params_t::err_handler"]
    pub const UCT_IFACE_PARAM_FIELD_ERR_HANDLER: uct_iface_params_field =
        uct_iface_params_field(128);
}
impl uct_iface_params_field {
    #[doc = " Enables @ref uct_iface_params_t::err_handler_flags"]
    pub const UCT_IFACE_PARAM_FIELD_ERR_HANDLER_FLAGS: uct_iface_params_field =
        uct_iface_params_field(256);
}
impl uct_iface_params_field {
    #[doc = " Enables @ref uct_iface_params_t::eager_arg"]
    pub const UCT_IFACE_PARAM_FIELD_HW_TM_EAGER_ARG: uct_iface_params_field =
        uct_iface_params_field(512);
}
impl uct_iface_params_field {
    #[doc = " Enables @ref uct_iface_params_t::eager_cb"]
    pub const UCT_IFACE_PARAM_FIELD_HW_TM_EAGER_CB: uct_iface_params_field =
        uct_iface_params_field(1024);
}
impl uct_iface_params_field {
    #[doc = " Enables @ref uct_iface_params_t::rndv_arg"]
    pub const UCT_IFACE_PARAM_FIELD_HW_TM_RNDV_ARG: uct_iface_params_field =
        uct_iface_params_field(2048);
}
impl uct_iface_params_field {
    #[doc = " Enables @ref uct_iface_params_t::rndv_cb"]
    pub const UCT_IFACE_PARAM_FIELD_HW_TM_RNDV_CB: uct_iface_params_field =
        uct_iface_params_field(4096);
}
impl uct_iface_params_field {
    #[doc = " Enables @ref uct_iface_params_t::async_event_arg"]
    pub const UCT_IFACE_PARAM_FIELD_ASYNC_EVENT_ARG: uct_iface_params_field =
        uct_iface_params_field(8192);
}
impl uct_iface_params_field {
    #[doc = " Enables @ref uct_iface_params_t::async_event_cb"]
    pub const UCT_IFACE_PARAM_FIELD_ASYNC_EVENT_CB: uct_iface_params_field =
        uct_iface_params_field(16384);
}
impl uct_iface_params_field {
    #[doc = " Enables @ref uct_iface_params_t::keepalive_interval"]
    pub const UCT_IFACE_PARAM_FIELD_KEEPALIVE_INTERVAL: uct_iface_params_field =
        uct_iface_params_field(32768);
}
impl uct_iface_params_field {
    #[doc = " Enables @ref uct_iface_params_t::am_alignment"]
    pub const UCT_IFACE_PARAM_FIELD_AM_ALIGNMENT: uct_iface_params_field =
        uct_iface_params_field(65536);
}
impl uct_iface_params_field {
    #[doc = " Enables @ref uct_iface_params_t::am_align_offset"]
    pub const UCT_IFACE_PARAM_FIELD_AM_ALIGN_OFFSET: uct_iface_params_field =
        uct_iface_params_field(131072);
}
impl uct_iface_params_field {
    #[doc = " Enables @ref uct_iface_params_t::features"]
    pub const UCT_IFACE_PARAM_FIELD_FEATURES: uct_iface_params_field =
        uct_iface_params_field(262144);
}
impl ::std::ops::BitOr<uct_iface_params_field> for uct_iface_params_field {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        uct_iface_params_field(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for uct_iface_params_field {
    #[inline]
    fn bitor_assign(&mut self, rhs: uct_iface_params_field) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<uct_iface_params_field> for uct_iface_params_field {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        uct_iface_params_field(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for uct_iface_params_field {
    #[inline]
    fn bitand_assign(&mut self, rhs: uct_iface_params_field) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[doc = " @ingroup UCT_RESOURCE\n @brief UCT interface created by @ref uct_iface_open parameters field mask.\n\n The enumeration allows specifying which fields in @ref uct_iface_params_t are\n present, for backward compatibility support."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct uct_iface_params_field(pub ::std::os::raw::c_uint);
#[repr(u32)]
#[doc = " @ingroup UCT_MD\n @brief Socket address accessibility type."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum uct_sockaddr_accessibility_t {
    #[doc = "< Check if local address exists.\nAddress should belong to a local\nnetwork interface"]
    UCT_SOCKADDR_ACC_LOCAL = 0,
    #[doc = "< Check if remote address can be reached.\nAddress is routable from one of the\nlocal network interfaces"]
    UCT_SOCKADDR_ACC_REMOTE = 1,
}
pub const UCT_MD_FLAG_ALLOC: _bindgen_ty_6 = _bindgen_ty_6::UCT_MD_FLAG_ALLOC;
pub const UCT_MD_FLAG_REG: _bindgen_ty_6 = _bindgen_ty_6::UCT_MD_FLAG_REG;
pub const UCT_MD_FLAG_NEED_MEMH: _bindgen_ty_6 = _bindgen_ty_6::UCT_MD_FLAG_NEED_MEMH;
pub const UCT_MD_FLAG_NEED_RKEY: _bindgen_ty_6 = _bindgen_ty_6::UCT_MD_FLAG_NEED_RKEY;
pub const UCT_MD_FLAG_ADVISE: _bindgen_ty_6 = _bindgen_ty_6::UCT_MD_FLAG_ADVISE;
pub const UCT_MD_FLAG_FIXED: _bindgen_ty_6 = _bindgen_ty_6::UCT_MD_FLAG_FIXED;
pub const UCT_MD_FLAG_RKEY_PTR: _bindgen_ty_6 = _bindgen_ty_6::UCT_MD_FLAG_RKEY_PTR;
pub const UCT_MD_FLAG_SOCKADDR: _bindgen_ty_6 = _bindgen_ty_6::UCT_MD_FLAG_SOCKADDR;
pub const UCT_MD_FLAG_INVALIDATE: _bindgen_ty_6 = _bindgen_ty_6::UCT_MD_FLAG_INVALIDATE;
pub const UCT_MD_FLAG_EXPORTED_MKEY: _bindgen_ty_6 = _bindgen_ty_6::UCT_MD_FLAG_EXPORTED_MKEY;
pub const UCT_MD_FLAG_REG_DMABUF: _bindgen_ty_6 = _bindgen_ty_6::UCT_MD_FLAG_REG_DMABUF;
pub const UCT_MD_FLAG_LAST: _bindgen_ty_6 = _bindgen_ty_6::UCT_MD_FLAG_LAST;
#[repr(u32)]
#[doc = " @ingroup UCT_MD\n @brief  Memory domain capability flags."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_6 {
    #[doc = " MD supports memory allocation"]
    UCT_MD_FLAG_ALLOC = 1,
    #[doc = " MD supports memory registration"]
    UCT_MD_FLAG_REG = 2,
    #[doc = " The transport needs a valid local memory handle for zero-copy operations"]
    UCT_MD_FLAG_NEED_MEMH = 4,
    #[doc = " The transport needs a valid remote memory key for remote memory\n operations"]
    UCT_MD_FLAG_NEED_RKEY = 8,
    #[doc = " MD supports memory advice"]
    UCT_MD_FLAG_ADVISE = 16,
    #[doc = " MD supports memory allocation with fixed address"]
    UCT_MD_FLAG_FIXED = 32,
    #[doc = " MD supports direct access to remote memory via a pointer that is\n returned by @ref uct_rkey_ptr.\n @note This flag is deprecated and replaced by\n @a UCT_COMPONENT_FLAG_RKEY_PTR."]
    UCT_MD_FLAG_RKEY_PTR = 64,
    #[doc = " MD support for client-server connection establishment via sockaddr"]
    UCT_MD_FLAG_SOCKADDR = 128,
    #[doc = " MD supports memory invalidation.\n @note This flag is equivalent to the combination of\n       UCT_MD_FLAG_INVALIDATE_RMA and UCT_MD_FLAG_INVALIDATE_AMO for\n       uct_md_attr_v2_t.flags"]
    UCT_MD_FLAG_INVALIDATE = 256,
    #[doc = " MD supports exporting memory keys with another process using the same\n device or attaching to an exported memory key."]
    UCT_MD_FLAG_EXPORTED_MKEY = 512,
    #[doc = " MD supports registering a dmabuf file descriptor."]
    UCT_MD_FLAG_REG_DMABUF = 1024,
    #[doc = " The enum must not be extended. Any additional flags must be defined in\n API v2 uct_md_flags_v2_t."]
    UCT_MD_FLAG_LAST = 2048,
}
impl uct_md_mem_flags {
    #[doc = " Hint to perform non-blocking allocation/registration: page mapping may\n be deferred until it is accessed by the CPU or a transport."]
    pub const UCT_MD_MEM_FLAG_NONBLOCK: uct_md_mem_flags = uct_md_mem_flags(1);
}
impl uct_md_mem_flags {
    #[doc = " Place the mapping at exactly defined address."]
    pub const UCT_MD_MEM_FLAG_FIXED: uct_md_mem_flags = uct_md_mem_flags(2);
}
impl uct_md_mem_flags {
    #[doc = " Registered memory should be locked. May incur extra cost for\n registration, but memory access is usually faster."]
    pub const UCT_MD_MEM_FLAG_LOCK: uct_md_mem_flags = uct_md_mem_flags(4);
}
impl uct_md_mem_flags {
    #[doc = " Hide errors on memory registration and allocation. If this flag is set,\n no error messages will be printed."]
    pub const UCT_MD_MEM_FLAG_HIDE_ERRORS: uct_md_mem_flags = uct_md_mem_flags(8);
}
impl uct_md_mem_flags {
    #[doc = " Enable remote put access."]
    pub const UCT_MD_MEM_ACCESS_REMOTE_PUT: uct_md_mem_flags = uct_md_mem_flags(32);
}
impl uct_md_mem_flags {
    #[doc = " Enable remote get access."]
    pub const UCT_MD_MEM_ACCESS_REMOTE_GET: uct_md_mem_flags = uct_md_mem_flags(64);
}
impl uct_md_mem_flags {
    #[doc = " Enable remote atomic access."]
    pub const UCT_MD_MEM_ACCESS_REMOTE_ATOMIC: uct_md_mem_flags = uct_md_mem_flags(128);
}
impl uct_md_mem_flags {
    #[doc = " Enable local read access."]
    pub const UCT_MD_MEM_ACCESS_LOCAL_READ: uct_md_mem_flags = uct_md_mem_flags(256);
}
impl uct_md_mem_flags {
    #[doc = " Enable local write access."]
    pub const UCT_MD_MEM_ACCESS_LOCAL_WRITE: uct_md_mem_flags = uct_md_mem_flags(512);
}
impl uct_md_mem_flags {
    #[doc = " Register the memory region so its remote access key would likely be\n equal to remote access keys received from other peers, when compared\n with @a uct_rkey_compare. This flag is a hint. When remote access keys\n received from different peers are compared equal, they can be used\n interchangeably, avoiding the need to keep all of them in memory."]
    pub const UCT_MD_MEM_SYMMETRIC_RKEY: uct_md_mem_flags = uct_md_mem_flags(1024);
}
impl uct_md_mem_flags {
    #[doc = " Register global VA to access all process virtual address space."]
    pub const UCT_MD_MEM_GVA: uct_md_mem_flags = uct_md_mem_flags(2048);
}
impl uct_md_mem_flags {
    #[doc = " Enable local and remote access for all operations."]
    pub const UCT_MD_MEM_ACCESS_ALL: uct_md_mem_flags = uct_md_mem_flags(992);
}
impl uct_md_mem_flags {
    #[doc = " Enable local and remote access for put and get operations."]
    pub const UCT_MD_MEM_ACCESS_RMA: uct_md_mem_flags = uct_md_mem_flags(864);
}
impl ::std::ops::BitOr<uct_md_mem_flags> for uct_md_mem_flags {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        uct_md_mem_flags(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for uct_md_mem_flags {
    #[inline]
    fn bitor_assign(&mut self, rhs: uct_md_mem_flags) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<uct_md_mem_flags> for uct_md_mem_flags {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        uct_md_mem_flags(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for uct_md_mem_flags {
    #[inline]
    fn bitand_assign(&mut self, rhs: uct_md_mem_flags) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[doc = " @ingroup UCT_MD\n @brief  Memory allocation/registration flags."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct uct_md_mem_flags(pub ::std::os::raw::c_uint);
#[repr(u32)]
#[doc = " @ingroup UCT_MD\n @brief list of UCT memory use advice"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum uct_mem_advice_t {
    #[doc = "< No special treatment"]
    UCT_MADV_NORMAL = 0,
    #[doc = "< can be used on the memory mapped with\n@ref UCT_MD_MEM_FLAG_NONBLOCK to speed up\nmemory mapping and to avoid page faults when\nthe memory is accessed for the first time."]
    UCT_MADV_WILLNEED = 1,
}
impl uct_cm_attr_field {
    #[doc = " Enables @ref uct_cm_attr::max_conn_priv"]
    pub const UCT_CM_ATTR_FIELD_MAX_CONN_PRIV: uct_cm_attr_field = uct_cm_attr_field(1);
}
impl ::std::ops::BitOr<uct_cm_attr_field> for uct_cm_attr_field {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        uct_cm_attr_field(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for uct_cm_attr_field {
    #[inline]
    fn bitor_assign(&mut self, rhs: uct_cm_attr_field) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<uct_cm_attr_field> for uct_cm_attr_field {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        uct_cm_attr_field(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for uct_cm_attr_field {
    #[inline]
    fn bitand_assign(&mut self, rhs: uct_cm_attr_field) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[doc = " @ingroup UCT_CLIENT_SERVER\n @brief UCT connection manager attributes field mask.\n\n The enumeration allows specifying which fields in @ref uct_cm_attr_t are\n present, for backward compatibility support."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct uct_cm_attr_field(pub ::std::os::raw::c_uint);
impl uct_listener_attr_field {
    #[doc = " Enables @ref uct_listener_attr::sockaddr"]
    pub const UCT_LISTENER_ATTR_FIELD_SOCKADDR: uct_listener_attr_field =
        uct_listener_attr_field(1);
}
impl ::std::ops::BitOr<uct_listener_attr_field> for uct_listener_attr_field {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        uct_listener_attr_field(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for uct_listener_attr_field {
    #[inline]
    fn bitor_assign(&mut self, rhs: uct_listener_attr_field) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<uct_listener_attr_field> for uct_listener_attr_field {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        uct_listener_attr_field(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for uct_listener_attr_field {
    #[inline]
    fn bitand_assign(&mut self, rhs: uct_listener_attr_field) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[doc = " @ingroup UCT_CLIENT_SERVER\n @brief UCT listener attributes field mask.\n\n The enumeration allows specifying which fields in @ref uct_listener_attr_t are\n present, for backward compatibility support."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct uct_listener_attr_field(pub ::std::os::raw::c_uint);
impl uct_listener_params_field {
    #[doc = " Enables @ref uct_listener_params::backlog"]
    pub const UCT_LISTENER_PARAM_FIELD_BACKLOG: uct_listener_params_field =
        uct_listener_params_field(1);
}
impl uct_listener_params_field {
    #[doc = " Enables @ref uct_listener_params::conn_request_cb"]
    pub const UCT_LISTENER_PARAM_FIELD_CONN_REQUEST_CB: uct_listener_params_field =
        uct_listener_params_field(2);
}
impl uct_listener_params_field {
    #[doc = " Enables @ref uct_listener_params::user_data"]
    pub const UCT_LISTENER_PARAM_FIELD_USER_DATA: uct_listener_params_field =
        uct_listener_params_field(4);
}
impl ::std::ops::BitOr<uct_listener_params_field> for uct_listener_params_field {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        uct_listener_params_field(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for uct_listener_params_field {
    #[inline]
    fn bitor_assign(&mut self, rhs: uct_listener_params_field) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<uct_listener_params_field> for uct_listener_params_field {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        uct_listener_params_field(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for uct_listener_params_field {
    #[inline]
    fn bitand_assign(&mut self, rhs: uct_listener_params_field) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[doc = " @ingroup UCT_CLIENT_SERVER\n @brief UCT listener created by @ref uct_listener_create parameters field mask.\n\n The enumeration allows specifying which fields in @ref uct_listener_params_t\n are present, for backward compatibility support."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct uct_listener_params_field(pub ::std::os::raw::c_uint);
impl uct_ep_params_field {
    #[doc = " Enables @ref uct_ep_params::iface"]
    pub const UCT_EP_PARAM_FIELD_IFACE: uct_ep_params_field = uct_ep_params_field(1);
}
impl uct_ep_params_field {
    #[doc = " Enables @ref uct_ep_params::user_data"]
    pub const UCT_EP_PARAM_FIELD_USER_DATA: uct_ep_params_field = uct_ep_params_field(2);
}
impl uct_ep_params_field {
    #[doc = " Enables @ref uct_ep_params::dev_addr"]
    pub const UCT_EP_PARAM_FIELD_DEV_ADDR: uct_ep_params_field = uct_ep_params_field(4);
}
impl uct_ep_params_field {
    #[doc = " Enables @ref uct_ep_params::iface_addr"]
    pub const UCT_EP_PARAM_FIELD_IFACE_ADDR: uct_ep_params_field = uct_ep_params_field(8);
}
impl uct_ep_params_field {
    #[doc = " Enables @ref uct_ep_params::sockaddr"]
    pub const UCT_EP_PARAM_FIELD_SOCKADDR: uct_ep_params_field = uct_ep_params_field(16);
}
impl uct_ep_params_field {
    #[doc = " Enables @ref uct_ep_params::sockaddr_cb_flags"]
    pub const UCT_EP_PARAM_FIELD_SOCKADDR_CB_FLAGS: uct_ep_params_field = uct_ep_params_field(32);
}
impl uct_ep_params_field {
    #[doc = " Enables @ref uct_ep_params::sockaddr_pack_cb"]
    pub const UCT_EP_PARAM_FIELD_SOCKADDR_PACK_CB: uct_ep_params_field = uct_ep_params_field(64);
}
impl uct_ep_params_field {
    #[doc = " Enables @ref uct_ep_params::cm"]
    pub const UCT_EP_PARAM_FIELD_CM: uct_ep_params_field = uct_ep_params_field(128);
}
impl uct_ep_params_field {
    #[doc = " Enables @ref uct_ep_params::conn_request"]
    pub const UCT_EP_PARAM_FIELD_CONN_REQUEST: uct_ep_params_field = uct_ep_params_field(256);
}
impl uct_ep_params_field {
    #[doc = " Enables @ref uct_ep_params::sockaddr_cb_client"]
    pub const UCT_EP_PARAM_FIELD_SOCKADDR_CONNECT_CB_CLIENT: uct_ep_params_field =
        uct_ep_params_field(512);
}
impl uct_ep_params_field {
    #[doc = " Enables @ref uct_ep_params::sockaddr_cb_server"]
    pub const UCT_EP_PARAM_FIELD_SOCKADDR_NOTIFY_CB_SERVER: uct_ep_params_field =
        uct_ep_params_field(1024);
}
impl uct_ep_params_field {
    #[doc = " Enables @ref uct_ep_params::disconnect_cb"]
    pub const UCT_EP_PARAM_FIELD_SOCKADDR_DISCONNECT_CB: uct_ep_params_field =
        uct_ep_params_field(2048);
}
impl uct_ep_params_field {
    #[doc = " Enables @ref uct_ep_params::path_index"]
    pub const UCT_EP_PARAM_FIELD_PATH_INDEX: uct_ep_params_field = uct_ep_params_field(4096);
}
impl uct_ep_params_field {
    #[doc = " Enables @ref uct_ep_params::cm_resolve_cb"]
    pub const UCT_EP_PARAM_FIELD_CM_RESOLVE_CB: uct_ep_params_field = uct_ep_params_field(8192);
}
impl uct_ep_params_field {
    #[doc = " Enables @ref uct_ep_params::private_data"]
    pub const UCT_EP_PARAM_FIELD_PRIV_DATA: uct_ep_params_field = uct_ep_params_field(16384);
}
impl uct_ep_params_field {
    #[doc = " Enables @ref uct_ep_params::private_data_length"]
    pub const UCT_EP_PARAM_FIELD_PRIV_DATA_LENGTH: uct_ep_params_field = uct_ep_params_field(32768);
}
impl uct_ep_params_field {
    #[doc = " Enables @ref uct_ep_params::local_sockaddr"]
    pub const UCT_EP_PARAM_FIELD_LOCAL_SOCKADDR: uct_ep_params_field = uct_ep_params_field(65536);
}
impl uct_ep_params_field {
    #[doc = " Enables @ref uct_ep_params::dev_addr_length"]
    pub const UCT_EP_PARAM_FIELD_DEV_ADDR_LENGTH: uct_ep_params_field = uct_ep_params_field(131072);
}
impl uct_ep_params_field {
    #[doc = " Enables @ref uct_ep_params::iface_addr_length"]
    pub const UCT_EP_PARAM_FIELD_IFACE_ADDR_LENGTH: uct_ep_params_field =
        uct_ep_params_field(262144);
}
impl ::std::ops::BitOr<uct_ep_params_field> for uct_ep_params_field {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        uct_ep_params_field(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for uct_ep_params_field {
    #[inline]
    fn bitor_assign(&mut self, rhs: uct_ep_params_field) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<uct_ep_params_field> for uct_ep_params_field {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        uct_ep_params_field(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for uct_ep_params_field {
    #[inline]
    fn bitand_assign(&mut self, rhs: uct_ep_params_field) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[doc = " @ingroup UCT_RESOURCE\n @brief UCT endpoint created by @ref uct_ep_create parameters field mask.\n\n The enumeration allows specifying which fields in @ref uct_ep_params_t are\n present, for backward compatibility support."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct uct_ep_params_field(pub ::std::os::raw::c_uint);
impl uct_ep_connect_params_field {
    #[doc = " Enables @ref uct_ep_connect_params::private_data"]
    pub const UCT_EP_CONNECT_PARAM_FIELD_PRIVATE_DATA: uct_ep_connect_params_field =
        uct_ep_connect_params_field(1);
}
impl uct_ep_connect_params_field {
    #[doc = " Enables @ref uct_ep_connect_params::private_data_length"]
    pub const UCT_EP_CONNECT_PARAM_FIELD_PRIVATE_DATA_LENGTH: uct_ep_connect_params_field =
        uct_ep_connect_params_field(2);
}
impl ::std::ops::BitOr<uct_ep_connect_params_field> for uct_ep_connect_params_field {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        uct_ep_connect_params_field(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for uct_ep_connect_params_field {
    #[inline]
    fn bitor_assign(&mut self, rhs: uct_ep_connect_params_field) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<uct_ep_connect_params_field> for uct_ep_connect_params_field {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        uct_ep_connect_params_field(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for uct_ep_connect_params_field {
    #[inline]
    fn bitand_assign(&mut self, rhs: uct_ep_connect_params_field) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[doc = " @ingroup UCT_CLIENT_SERVER\n @brief UCT endpoint connected by @ref uct_ep_connect parameters field mask.\n\n The enumeration allows specifying which fields in\n @ref uct_ep_connect_params_t are present, for backward compatibility support."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct uct_ep_connect_params_field(pub ::std::os::raw::c_uint);
#[repr(u32)]
#[doc = " @ingroup UCT_RESOURCE\n @brief UCT interface configuration features\n\n The enumeration list describes the features supported by UCT. An\n application can request the features using @ref uct_iface_params \"UCT parameters\"\n during @ref uct_iface_open \"UCT iface initialization\" process."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum uct_iface_feature {
    #[doc = " Request Active Message support"]
    UCT_IFACE_FEATURE_AM = 1,
    #[doc = " Request PUT support"]
    UCT_IFACE_FEATURE_PUT = 2,
    #[doc = " Request GET support"]
    UCT_IFACE_FEATURE_GET = 4,
    #[doc = " Request 32-bit atomic operations support"]
    UCT_IFACE_FEATURE_AMO32 = 8,
    #[doc = " Request 64-bit atomic operations support"]
    UCT_IFACE_FEATURE_AMO64 = 16,
    #[doc = " Request tag matching offload support"]
    UCT_IFACE_FEATURE_TAG = 32,
    #[doc = " Request remote flush support"]
    UCT_IFACE_FEATURE_FLUSH_REMOTE = 64,
    #[doc = " Used to determine the number of features"]
    UCT_IFACE_FEATURE_LAST = 128,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uct_ppn_bandwidth {
    #[doc = "< Dedicated bandwidth, bytes/second"]
    pub dedicated: f64,
    #[doc = "< Shared bandwidth, bytes/second"]
    pub shared: f64,
}
#[test]
fn bindgen_test_layout_uct_ppn_bandwidth() {
    const UNINIT: ::std::mem::MaybeUninit<uct_ppn_bandwidth> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<uct_ppn_bandwidth>(),
        16usize,
        concat!("Size of: ", stringify!(uct_ppn_bandwidth))
    );
    assert_eq!(
        ::std::mem::align_of::<uct_ppn_bandwidth>(),
        8usize,
        concat!("Alignment of ", stringify!(uct_ppn_bandwidth))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dedicated) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_ppn_bandwidth),
            "::",
            stringify!(dedicated)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).shared) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_ppn_bandwidth),
            "::",
            stringify!(shared)
        )
    );
}
pub type uct_ppn_bandwidth_t = uct_ppn_bandwidth;
#[doc = " @ingroup UCT_RESOURCE\n @brief Interface attributes: capabilities and limitations."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uct_iface_attr {
    #[doc = "< Interface capabilities"]
    pub cap: uct_iface_attr__bindgen_ty_1,
    #[doc = "< Size of device address"]
    pub device_addr_len: usize,
    #[doc = "< Size of interface address"]
    pub iface_addr_len: usize,
    #[doc = "< Size of endpoint address"]
    pub ep_addr_len: usize,
    #[doc = "< Max size of the iface's private data.\nused for connection\nestablishment with sockaddr"]
    pub max_conn_priv: usize,
    #[doc = "< Sockaddr on which this iface\nis listening."]
    pub listen_sockaddr: sockaddr_storage,
    #[doc = "< Message overhead, seconds"]
    pub overhead: f64,
    #[doc = "< Bandwidth model"]
    pub bandwidth: uct_ppn_bandwidth_t,
    #[doc = "< Latency as function of number of\nactive endpoints"]
    pub latency: ucs_linear_func_t,
    #[doc = "< Priority of device"]
    pub priority: u8,
    #[doc = "< Maximum number of endpoints"]
    pub max_num_eps: usize,
    #[doc = "< How many network paths can be\nutilized on the device used by\nthis interface for optimal\nperformance. Endpoints that connect\nto the same remote address but use\ndifferent paths can potentially\nachieve higher total bandwidth\ncompared to using only a single\nendpoint."]
    pub dev_num_paths: ::std::os::raw::c_uint,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uct_iface_attr__bindgen_ty_1 {
    #[doc = "< Attributes for PUT operations"]
    pub put: uct_iface_attr__bindgen_ty_1__bindgen_ty_1,
    #[doc = "< Attributes for GET operations"]
    pub get: uct_iface_attr__bindgen_ty_1__bindgen_ty_2,
    #[doc = "< Attributes for AM operations"]
    pub am: uct_iface_attr__bindgen_ty_1__bindgen_ty_3,
    #[doc = "< Attributes for TAG operations"]
    pub tag: uct_iface_attr__bindgen_ty_1__bindgen_ty_4,
    #[doc = "< Attributes for atomic operations"]
    pub atomic32: uct_iface_attr__bindgen_ty_1__bindgen_ty_5,
    #[doc = "< Attributes for atomic operations"]
    pub atomic64: uct_iface_attr__bindgen_ty_1__bindgen_ty_5,
    #[doc = "< Flags from @ref UCT_RESOURCE_IFACE_CAP"]
    pub flags: u64,
    #[doc = "< Flags from @ref UCT_RESOURCE_IFACE_EVENT_CAP"]
    pub event_flags: u64,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uct_iface_attr__bindgen_ty_1__bindgen_ty_1 {
    #[doc = "< Maximal size for put_short"]
    pub max_short: usize,
    #[doc = "< Maximal size for put_bcopy"]
    pub max_bcopy: usize,
    #[doc = "< Minimal size for put_zcopy (total\nof @ref uct_iov_t::length of the\n@a iov parameter)"]
    pub min_zcopy: usize,
    #[doc = "< Maximal size for put_zcopy (total\nof @ref uct_iov_t::length of the\n@a iov parameter)"]
    pub max_zcopy: usize,
    #[doc = "< Optimal alignment for zero-copy\nbuffer address"]
    pub opt_zcopy_align: usize,
    #[doc = "< MTU used for alignment"]
    pub align_mtu: usize,
    #[doc = "< Maximal @a iovcnt parameter in\n@ref ::uct_ep_put_zcopy\n@anchor uct_iface_attr_cap_put_max_iov"]
    pub max_iov: usize,
}
#[test]
fn bindgen_test_layout_uct_iface_attr__bindgen_ty_1__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<uct_iface_attr__bindgen_ty_1__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<uct_iface_attr__bindgen_ty_1__bindgen_ty_1>(),
        56usize,
        concat!(
            "Size of: ",
            stringify!(uct_iface_attr__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<uct_iface_attr__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(uct_iface_attr__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_short) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_attr__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(max_short)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_bcopy) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_attr__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(max_bcopy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).min_zcopy) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_attr__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(min_zcopy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_zcopy) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_attr__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(max_zcopy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).opt_zcopy_align) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_attr__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(opt_zcopy_align)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).align_mtu) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_attr__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(align_mtu)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_iov) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_attr__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(max_iov)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uct_iface_attr__bindgen_ty_1__bindgen_ty_2 {
    #[doc = "< Maximal size for get_short"]
    pub max_short: usize,
    #[doc = "< Maximal size for get_bcopy"]
    pub max_bcopy: usize,
    #[doc = "< Minimal size for get_zcopy (total\nof @ref uct_iov_t::length of the\n@a iov parameter)"]
    pub min_zcopy: usize,
    #[doc = "< Maximal size for get_zcopy (total\nof @ref uct_iov_t::length of the\n@a iov parameter)"]
    pub max_zcopy: usize,
    #[doc = "< Optimal alignment for zero-copy\nbuffer address"]
    pub opt_zcopy_align: usize,
    #[doc = "< MTU used for alignment"]
    pub align_mtu: usize,
    #[doc = "< Maximal @a iovcnt parameter in\n@ref uct_ep_get_zcopy\n@anchor uct_iface_attr_cap_get_max_iov"]
    pub max_iov: usize,
}
#[test]
fn bindgen_test_layout_uct_iface_attr__bindgen_ty_1__bindgen_ty_2() {
    const UNINIT: ::std::mem::MaybeUninit<uct_iface_attr__bindgen_ty_1__bindgen_ty_2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<uct_iface_attr__bindgen_ty_1__bindgen_ty_2>(),
        56usize,
        concat!(
            "Size of: ",
            stringify!(uct_iface_attr__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<uct_iface_attr__bindgen_ty_1__bindgen_ty_2>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(uct_iface_attr__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_short) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_attr__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(max_short)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_bcopy) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_attr__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(max_bcopy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).min_zcopy) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_attr__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(min_zcopy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_zcopy) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_attr__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(max_zcopy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).opt_zcopy_align) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_attr__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(opt_zcopy_align)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).align_mtu) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_attr__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(align_mtu)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_iov) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_attr__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(max_iov)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uct_iface_attr__bindgen_ty_1__bindgen_ty_3 {
    #[doc = "< Total maximum size (incl. the header)\n@anchor uct_iface_attr_cap_am_max_short"]
    pub max_short: usize,
    #[doc = "< Total maximum size (incl. the header)"]
    pub max_bcopy: usize,
    #[doc = "< Minimal size for am_zcopy (incl. the\nheader and total of @ref uct_iov_t::length\nof the @a iov parameter)"]
    pub min_zcopy: usize,
    #[doc = "< Total max. size (incl. the header\nand total of @ref uct_iov_t::length\nof the @a iov parameter)"]
    pub max_zcopy: usize,
    #[doc = "< Optimal alignment for zero-copy\nbuffer address"]
    pub opt_zcopy_align: usize,
    #[doc = "< MTU used for alignment"]
    pub align_mtu: usize,
    #[doc = "< Max. header size for zcopy"]
    pub max_hdr: usize,
    #[doc = "< Maximal @a iovcnt parameter in\n@ref ::uct_ep_am_zcopy\n@anchor uct_iface_attr_cap_am_max_iov"]
    pub max_iov: usize,
}
#[test]
fn bindgen_test_layout_uct_iface_attr__bindgen_ty_1__bindgen_ty_3() {
    const UNINIT: ::std::mem::MaybeUninit<uct_iface_attr__bindgen_ty_1__bindgen_ty_3> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<uct_iface_attr__bindgen_ty_1__bindgen_ty_3>(),
        64usize,
        concat!(
            "Size of: ",
            stringify!(uct_iface_attr__bindgen_ty_1__bindgen_ty_3)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<uct_iface_attr__bindgen_ty_1__bindgen_ty_3>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(uct_iface_attr__bindgen_ty_1__bindgen_ty_3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_short) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_attr__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(max_short)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_bcopy) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_attr__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(max_bcopy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).min_zcopy) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_attr__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(min_zcopy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_zcopy) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_attr__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(max_zcopy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).opt_zcopy_align) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_attr__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(opt_zcopy_align)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).align_mtu) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_attr__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(align_mtu)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_hdr) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_attr__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(max_hdr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_iov) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_attr__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(max_iov)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uct_iface_attr__bindgen_ty_1__bindgen_ty_4 {
    pub recv: uct_iface_attr__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1,
    #[doc = "< Attributes related to eager protocol"]
    pub eager: uct_iface_attr__bindgen_ty_1__bindgen_ty_4__bindgen_ty_2,
    #[doc = "< Attributes related to rendezvous protocol"]
    pub rndv: uct_iface_attr__bindgen_ty_1__bindgen_ty_4__bindgen_ty_3,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uct_iface_attr__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1 {
    #[doc = "< Minimal allowed length of posted receive buffer"]
    pub min_recv: usize,
    #[doc = "< Maximal allowed data length in\n@ref uct_iface_tag_recv_zcopy"]
    pub max_zcopy: usize,
    #[doc = "< Maximal @a iovcnt parameter in\n@ref uct_iface_tag_recv_zcopy\n@anchor uct_iface_attr_cap_tag_recv_iov"]
    pub max_iov: usize,
    #[doc = "< Maximal number of simultaneous\nreceive operations"]
    pub max_outstanding: usize,
}
#[test]
fn bindgen_test_layout_uct_iface_attr__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<
        uct_iface_attr__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1,
    > = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<uct_iface_attr__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1>(),
        32usize,
        concat!(
            "Size of: ",
            stringify!(uct_iface_attr__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<uct_iface_attr__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(uct_iface_attr__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).min_recv) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_attr__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1),
            "::",
            stringify!(min_recv)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_zcopy) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_attr__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1),
            "::",
            stringify!(max_zcopy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_iov) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_attr__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1),
            "::",
            stringify!(max_iov)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_outstanding) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_attr__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1),
            "::",
            stringify!(max_outstanding)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uct_iface_attr__bindgen_ty_1__bindgen_ty_4__bindgen_ty_2 {
    #[doc = "< Maximal allowed data length in\n@ref uct_ep_tag_eager_short"]
    pub max_short: usize,
    #[doc = "< Maximal allowed data length in\n@ref uct_ep_tag_eager_bcopy"]
    pub max_bcopy: usize,
    #[doc = "< Maximal allowed data length in\n@ref uct_ep_tag_eager_zcopy"]
    pub max_zcopy: usize,
    #[doc = "< Maximal @a iovcnt parameter in\n@ref uct_ep_tag_eager_zcopy"]
    pub max_iov: usize,
}
#[test]
fn bindgen_test_layout_uct_iface_attr__bindgen_ty_1__bindgen_ty_4__bindgen_ty_2() {
    const UNINIT: ::std::mem::MaybeUninit<
        uct_iface_attr__bindgen_ty_1__bindgen_ty_4__bindgen_ty_2,
    > = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<uct_iface_attr__bindgen_ty_1__bindgen_ty_4__bindgen_ty_2>(),
        32usize,
        concat!(
            "Size of: ",
            stringify!(uct_iface_attr__bindgen_ty_1__bindgen_ty_4__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<uct_iface_attr__bindgen_ty_1__bindgen_ty_4__bindgen_ty_2>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(uct_iface_attr__bindgen_ty_1__bindgen_ty_4__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_short) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_attr__bindgen_ty_1__bindgen_ty_4__bindgen_ty_2),
            "::",
            stringify!(max_short)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_bcopy) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_attr__bindgen_ty_1__bindgen_ty_4__bindgen_ty_2),
            "::",
            stringify!(max_bcopy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_zcopy) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_attr__bindgen_ty_1__bindgen_ty_4__bindgen_ty_2),
            "::",
            stringify!(max_zcopy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_iov) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_attr__bindgen_ty_1__bindgen_ty_4__bindgen_ty_2),
            "::",
            stringify!(max_iov)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uct_iface_attr__bindgen_ty_1__bindgen_ty_4__bindgen_ty_3 {
    #[doc = "< Maximal allowed data length in\n@ref uct_ep_tag_rndv_zcopy"]
    pub max_zcopy: usize,
    #[doc = "< Maximal allowed header length in\n@ref uct_ep_tag_rndv_zcopy and\n@ref uct_ep_tag_rndv_request"]
    pub max_hdr: usize,
    #[doc = "< Maximal @a iovcnt parameter in\n@ref uct_ep_tag_rndv_zcopy"]
    pub max_iov: usize,
}
#[test]
fn bindgen_test_layout_uct_iface_attr__bindgen_ty_1__bindgen_ty_4__bindgen_ty_3() {
    const UNINIT: ::std::mem::MaybeUninit<
        uct_iface_attr__bindgen_ty_1__bindgen_ty_4__bindgen_ty_3,
    > = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<uct_iface_attr__bindgen_ty_1__bindgen_ty_4__bindgen_ty_3>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(uct_iface_attr__bindgen_ty_1__bindgen_ty_4__bindgen_ty_3)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<uct_iface_attr__bindgen_ty_1__bindgen_ty_4__bindgen_ty_3>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(uct_iface_attr__bindgen_ty_1__bindgen_ty_4__bindgen_ty_3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_zcopy) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_attr__bindgen_ty_1__bindgen_ty_4__bindgen_ty_3),
            "::",
            stringify!(max_zcopy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_hdr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_attr__bindgen_ty_1__bindgen_ty_4__bindgen_ty_3),
            "::",
            stringify!(max_hdr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_iov) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_attr__bindgen_ty_1__bindgen_ty_4__bindgen_ty_3),
            "::",
            stringify!(max_iov)
        )
    );
}
#[test]
fn bindgen_test_layout_uct_iface_attr__bindgen_ty_1__bindgen_ty_4() {
    const UNINIT: ::std::mem::MaybeUninit<uct_iface_attr__bindgen_ty_1__bindgen_ty_4> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<uct_iface_attr__bindgen_ty_1__bindgen_ty_4>(),
        88usize,
        concat!(
            "Size of: ",
            stringify!(uct_iface_attr__bindgen_ty_1__bindgen_ty_4)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<uct_iface_attr__bindgen_ty_1__bindgen_ty_4>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(uct_iface_attr__bindgen_ty_1__bindgen_ty_4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).recv) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_attr__bindgen_ty_1__bindgen_ty_4),
            "::",
            stringify!(recv)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eager) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_attr__bindgen_ty_1__bindgen_ty_4),
            "::",
            stringify!(eager)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rndv) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_attr__bindgen_ty_1__bindgen_ty_4),
            "::",
            stringify!(rndv)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uct_iface_attr__bindgen_ty_1__bindgen_ty_5 {
    #[doc = "< Attributes for atomic-post operations"]
    pub op_flags: u64,
    #[doc = "< Attributes for atomic-fetch operations"]
    pub fop_flags: u64,
}
#[test]
fn bindgen_test_layout_uct_iface_attr__bindgen_ty_1__bindgen_ty_5() {
    const UNINIT: ::std::mem::MaybeUninit<uct_iface_attr__bindgen_ty_1__bindgen_ty_5> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<uct_iface_attr__bindgen_ty_1__bindgen_ty_5>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(uct_iface_attr__bindgen_ty_1__bindgen_ty_5)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<uct_iface_attr__bindgen_ty_1__bindgen_ty_5>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(uct_iface_attr__bindgen_ty_1__bindgen_ty_5)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).op_flags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_attr__bindgen_ty_1__bindgen_ty_5),
            "::",
            stringify!(op_flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fop_flags) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_attr__bindgen_ty_1__bindgen_ty_5),
            "::",
            stringify!(fop_flags)
        )
    );
}
#[test]
fn bindgen_test_layout_uct_iface_attr__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<uct_iface_attr__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<uct_iface_attr__bindgen_ty_1>(),
        312usize,
        concat!("Size of: ", stringify!(uct_iface_attr__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<uct_iface_attr__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(uct_iface_attr__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).put) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_attr__bindgen_ty_1),
            "::",
            stringify!(put)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_attr__bindgen_ty_1),
            "::",
            stringify!(get)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).am) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_attr__bindgen_ty_1),
            "::",
            stringify!(am)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tag) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_attr__bindgen_ty_1),
            "::",
            stringify!(tag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).atomic32) as usize - ptr as usize },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_attr__bindgen_ty_1),
            "::",
            stringify!(atomic32)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).atomic64) as usize - ptr as usize },
        280usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_attr__bindgen_ty_1),
            "::",
            stringify!(atomic64)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        296usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_attr__bindgen_ty_1),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).event_flags) as usize - ptr as usize },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_attr__bindgen_ty_1),
            "::",
            stringify!(event_flags)
        )
    );
}
#[test]
fn bindgen_test_layout_uct_iface_attr() {
    const UNINIT: ::std::mem::MaybeUninit<uct_iface_attr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<uct_iface_attr>(),
        536usize,
        concat!("Size of: ", stringify!(uct_iface_attr))
    );
    assert_eq!(
        ::std::mem::align_of::<uct_iface_attr>(),
        8usize,
        concat!("Alignment of ", stringify!(uct_iface_attr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cap) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_attr),
            "::",
            stringify!(cap)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).device_addr_len) as usize - ptr as usize },
        312usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_attr),
            "::",
            stringify!(device_addr_len)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iface_addr_len) as usize - ptr as usize },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_attr),
            "::",
            stringify!(iface_addr_len)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ep_addr_len) as usize - ptr as usize },
        328usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_attr),
            "::",
            stringify!(ep_addr_len)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_conn_priv) as usize - ptr as usize },
        336usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_attr),
            "::",
            stringify!(max_conn_priv)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).listen_sockaddr) as usize - ptr as usize },
        344usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_attr),
            "::",
            stringify!(listen_sockaddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).overhead) as usize - ptr as usize },
        472usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_attr),
            "::",
            stringify!(overhead)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bandwidth) as usize - ptr as usize },
        480usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_attr),
            "::",
            stringify!(bandwidth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).latency) as usize - ptr as usize },
        496usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_attr),
            "::",
            stringify!(latency)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).priority) as usize - ptr as usize },
        512usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_attr),
            "::",
            stringify!(priority)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_num_eps) as usize - ptr as usize },
        520usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_attr),
            "::",
            stringify!(max_num_eps)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dev_num_paths) as usize - ptr as usize },
        528usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_attr),
            "::",
            stringify!(dev_num_paths)
        )
    );
}
#[doc = " @ingroup UCT_RESOURCE\n @brief Parameters used for interface creation.\n\n This structure should be allocated by the user and should be passed to\n @ref uct_iface_open. User has to initialize all fields of this structure."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct uct_iface_params {
    #[doc = " Mask of valid fields in this structure, using bits from\n  @ref uct_iface_params_field. Fields not specified in this mask will be\n  ignored."]
    pub field_mask: u64,
    #[doc = " Mask of CPUs to use for resources"]
    pub cpu_mask: ucs_cpu_set_t,
    #[doc = " Interface open mode bitmap. @ref uct_iface_open_mode"]
    pub open_mode: u64,
    pub mode: uct_iface_params__bindgen_ty_1,
    #[doc = " Root in the statistics tree. Can be NULL. If non NULL, it will be\na root of @a uct_iface object in the statistics tree."]
    pub stats_root: *mut ucs_stats_node_t,
    #[doc = " How much bytes to reserve before the receive segment."]
    pub rx_headroom: usize,
    #[doc = " Custom argument of @a err_handler."]
    pub err_handler_arg: *mut ::std::os::raw::c_void,
    #[doc = " The callback to handle transport level error."]
    pub err_handler: uct_error_handler_t,
    #[doc = " Callback flags to indicate where the @a err_handler callback can be\n invoked from. @ref uct_cb_flags"]
    pub err_handler_flags: u32,
    #[doc = " These callbacks are only relevant for HW Tag Matching"]
    pub eager_arg: *mut ::std::os::raw::c_void,
    #[doc = " Callback for tag matching unexpected eager messages"]
    pub eager_cb: uct_tag_unexp_eager_cb_t,
    pub rndv_arg: *mut ::std::os::raw::c_void,
    #[doc = " Callback for tag matching unexpected rndv messages"]
    pub rndv_cb: uct_tag_unexp_rndv_cb_t,
    pub async_event_arg: *mut ::std::os::raw::c_void,
    #[doc = " Callback for asynchronous event handling. The callback will be\n invoked from UCT transport when there are new events to be\n read by user if the iface has @ref UCT_IFACE_FLAG_EVENT_ASYNC_CB\n capability"]
    pub async_event_cb: uct_async_event_cb_t,
    pub keepalive_interval: ucs_time_t,
    #[doc = " Desired alignment for Active Messages on the receiver. Note that only\n data received in the UCT descriptor can be aligned (i.e.\n @a UCT_CB_PARAM_FLAG_DESC flag is provided in the Active Message\n handler callback). The provided value must be power of 2. The default\n value is 1."]
    pub am_alignment: usize,
    #[doc = " Offset in the Active Message receive buffer, which should be aligned to\n the @a am_alignment boundary. Note this parameter has no effect without\n setting @a am_alignment parameter. The provided value must be less than\n the given @a am_alignment value. The default value is 0.\n\n +-+ pointer to @a data in @ref uct_am_callback_t\n |\n |        + alignment boundary\n |        |\n v        v\n +-------------------+\n | align  |          |\n | offset |          |\n +-------------------+"]
    pub am_align_offset: usize,
    #[doc = " UCT @ref uct_iface_feature \"features\" that are used for interface\n initialization."]
    pub features: u64,
}
#[doc = " Mode-specific parameters"]
#[repr(C)]
#[derive(Copy, Clone)]
pub union uct_iface_params__bindgen_ty_1 {
    pub device: uct_iface_params__bindgen_ty_1__bindgen_ty_1,
    pub sockaddr: uct_iface_params__bindgen_ty_1__bindgen_ty_2,
}
#[doc = " @anchor uct_iface_params_t_mode_device\n  The fields in this structure (tl_name and dev_name) need to be set only when\n  the @ref UCT_IFACE_OPEN_MODE_DEVICE bit is set in @ref\n  uct_iface_params_t.open_mode This will make @ref uct_iface_open\n  open the interface on the specified device."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uct_iface_params__bindgen_ty_1__bindgen_ty_1 {
    #[doc = "< Transport name"]
    pub tl_name: *const ::std::os::raw::c_char,
    #[doc = "< Device Name"]
    pub dev_name: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_uct_iface_params__bindgen_ty_1__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<uct_iface_params__bindgen_ty_1__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<uct_iface_params__bindgen_ty_1__bindgen_ty_1>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(uct_iface_params__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<uct_iface_params__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(uct_iface_params__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tl_name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_params__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(tl_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dev_name) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_params__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(dev_name)
        )
    );
}
#[doc = " @anchor uct_iface_params_t_mode_sockaddr\n  These callbacks and address are only relevant for client-server\n  connection establishment with sockaddr and are needed on the server side.\n  The callbacks and address need to be set when the @ref\n  UCT_IFACE_OPEN_MODE_SOCKADDR_SERVER bit is set in @ref\n  uct_iface_params_t.open_mode. This will make @ref uct_iface_open\n  open the interface on the specified address as a server."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uct_iface_params__bindgen_ty_1__bindgen_ty_2 {
    pub listen_sockaddr: ucs_sock_addr_t,
    #[doc = " Argument for connection request callback"]
    pub conn_request_arg: *mut ::std::os::raw::c_void,
    #[doc = " Callback for an incoming connection request on the server"]
    pub conn_request_cb: uct_sockaddr_conn_request_callback_t,
    #[doc = " Callback flags to indicate where the callback can be invoked from.\n @ref uct_cb_flags"]
    pub cb_flags: u32,
}
#[test]
fn bindgen_test_layout_uct_iface_params__bindgen_ty_1__bindgen_ty_2() {
    const UNINIT: ::std::mem::MaybeUninit<uct_iface_params__bindgen_ty_1__bindgen_ty_2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<uct_iface_params__bindgen_ty_1__bindgen_ty_2>(),
        40usize,
        concat!(
            "Size of: ",
            stringify!(uct_iface_params__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<uct_iface_params__bindgen_ty_1__bindgen_ty_2>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(uct_iface_params__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).listen_sockaddr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_params__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(listen_sockaddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).conn_request_arg) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_params__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(conn_request_arg)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).conn_request_cb) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_params__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(conn_request_cb)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cb_flags) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_params__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(cb_flags)
        )
    );
}
#[test]
fn bindgen_test_layout_uct_iface_params__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<uct_iface_params__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<uct_iface_params__bindgen_ty_1>(),
        40usize,
        concat!("Size of: ", stringify!(uct_iface_params__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<uct_iface_params__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(uct_iface_params__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).device) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_params__bindgen_ty_1),
            "::",
            stringify!(device)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sockaddr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_params__bindgen_ty_1),
            "::",
            stringify!(sockaddr)
        )
    );
}
#[test]
fn bindgen_test_layout_uct_iface_params() {
    const UNINIT: ::std::mem::MaybeUninit<uct_iface_params> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<uct_iface_params>(),
        304usize,
        concat!("Size of: ", stringify!(uct_iface_params))
    );
    assert_eq!(
        ::std::mem::align_of::<uct_iface_params>(),
        8usize,
        concat!("Alignment of ", stringify!(uct_iface_params))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).field_mask) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_params),
            "::",
            stringify!(field_mask)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cpu_mask) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_params),
            "::",
            stringify!(cpu_mask)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).open_mode) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_params),
            "::",
            stringify!(open_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mode) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_params),
            "::",
            stringify!(mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stats_root) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_params),
            "::",
            stringify!(stats_root)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rx_headroom) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_params),
            "::",
            stringify!(rx_headroom)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).err_handler_arg) as usize - ptr as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_params),
            "::",
            stringify!(err_handler_arg)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).err_handler) as usize - ptr as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_params),
            "::",
            stringify!(err_handler)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).err_handler_flags) as usize - ptr as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_params),
            "::",
            stringify!(err_handler_flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eager_arg) as usize - ptr as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_params),
            "::",
            stringify!(eager_arg)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eager_cb) as usize - ptr as usize },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_params),
            "::",
            stringify!(eager_cb)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rndv_arg) as usize - ptr as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_params),
            "::",
            stringify!(rndv_arg)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rndv_cb) as usize - ptr as usize },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_params),
            "::",
            stringify!(rndv_cb)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).async_event_arg) as usize - ptr as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_params),
            "::",
            stringify!(async_event_arg)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).async_event_cb) as usize - ptr as usize },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_params),
            "::",
            stringify!(async_event_cb)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).keepalive_interval) as usize - ptr as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_params),
            "::",
            stringify!(keepalive_interval)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).am_alignment) as usize - ptr as usize },
        280usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_params),
            "::",
            stringify!(am_alignment)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).am_align_offset) as usize - ptr as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_params),
            "::",
            stringify!(am_align_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).features) as usize - ptr as usize },
        296usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_iface_params),
            "::",
            stringify!(features)
        )
    );
}
#[doc = " @ingroup UCT_RESOURCE\n @brief Parameters for creating a UCT endpoint by @ref uct_ep_create"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uct_ep_params {
    #[doc = " Mask of valid fields in this structure, using bits from\n @ref uct_ep_params_field. Fields not specified by this mask will be\n ignored."]
    pub field_mask: u64,
    #[doc = " Interface to create the endpoint on.\n Either @a iface or @a cm field must be initialized but not both."]
    pub iface: uct_iface_h,
    #[doc = " User data associated with the endpoint."]
    pub user_data: *mut ::std::os::raw::c_void,
    #[doc = " The device address to connect to on the remote peer. This must be defined\n together with @ref uct_ep_params_t::iface_addr to create an endpoint\n connected to a remote interface."]
    pub dev_addr: *const uct_device_addr_t,
    #[doc = " This specifies the remote address to use when creating an endpoint that\n is connected to a remote interface.\n @note This requires @ref UCT_IFACE_FLAG_CONNECT_TO_IFACE capability."]
    pub iface_addr: *const uct_iface_addr_t,
    #[doc = " The sockaddr to connect to on the remote peer. If set, @ref uct_ep_create\n will create an endpoint for a connection to the remote peer, specified by\n its socket address.\n @note The interface in this routine requires the\n @ref UCT_IFACE_FLAG_CONNECT_TO_SOCKADDR capability."]
    pub sockaddr: *const ucs_sock_addr_t,
    #[doc = " @ref uct_cb_flags to indicate @ref uct_ep_params_t::sockaddr_pack_cb,\n @ref uct_ep_params_t::sockaddr_cb_client,\n @ref uct_ep_params_t::sockaddr_cb_server,\n @ref uct_ep_params_t::disconnect_cb and\n @ref uct_ep_params_t::cm_resolve_cb behavior.\n If none from these are not set, this field will be ignored."]
    pub sockaddr_cb_flags: u32,
    #[doc = " Callback that will be used for filling the user's private data to be\n delivered to the remote peer by the callback on the server or client side.\n This field is only valid if @ref uct_ep_params_t::sockaddr is set.\n @note It is never guaranteed that the callback will be called. If, for\n example, the endpoint goes into error state before issuing the connection\n request, the callback will not be invoked.\n @note Can not be set together with @ref uct_ep_params_t::private_data or\n @ref uct_ep_params_t::cm_resolve_cb."]
    pub sockaddr_pack_cb: uct_cm_ep_priv_data_pack_callback_t,
    #[doc = " The connection manager object as created by @ref uct_cm_open.\n Either @a cm or @a iface field must be initialized but not both."]
    pub cm: uct_cm_h,
    #[doc = " Connection request that was passed to\n @ref uct_cm_listener_conn_request_args_t::conn_request.\n @note After a call to @ref uct_ep_create, @a params.conn_request is\n       consumed and should not be used anymore, even if the call returns\n       with an error."]
    pub conn_request: uct_conn_request_h,
    #[doc = " Callback that will be invoked when the endpoint on the client side\n is being connected to the server by a connection manager @ref uct_cm_h ."]
    pub sockaddr_cb_client: uct_cm_ep_client_connect_callback_t,
    #[doc = " Callback that will be invoked when the endpoint on the server side\n is being connected to a client by a connection manager @ref uct_cm_h ."]
    pub sockaddr_cb_server: uct_cm_ep_server_conn_notify_callback_t,
    #[doc = " Callback that will be invoked when the endpoint is disconnected."]
    pub disconnect_cb: uct_ep_disconnect_cb_t,
    #[doc = " Index of the path which the endpoint should use, must be in the range\n 0..(@ref uct_iface_attr_t.dev_num_paths - 1)."]
    pub path_index: ::std::os::raw::c_uint,
    #[doc = " This callback is invoked when the remote server address provided in field\n @ref uct_ep_params_t::sockaddr is resolved to the local device to be used\n for connection establishment.\n @note This field is mutually exclusive with\n       @ref uct_ep_params::sockaddr_pack_cb."]
    pub cm_resolve_cb: uct_cm_ep_resolve_callback_t,
    #[doc = " Private data to be passed from server to client. Can be used only along\n with @ref uct_ep_params::conn_request.\n @note This field is mutually exclusive with\n       @ref uct_ep_params::sockaddr_pack_cb."]
    pub private_data: *const ::std::os::raw::c_void,
    #[doc = " Length of @ref uct_ep_params::private_data, the maximal allowed value is\n indicated by the @ref uct_cm_attr::max_conn_priv."]
    pub private_data_length: usize,
    #[doc = " The sockaddr to bind locally. If set, @ref uct_ep_create\n will create an endpoint binding to this local sockaddr.\n @note The interface in this routine requires the\n @ref UCT_IFACE_FLAG_CONNECT_TO_SOCKADDR capability."]
    pub local_sockaddr: *const ucs_sock_addr_t,
    #[doc = " Device address length. If not provided, the transport will assume a\n default minimum length according to the address buffer contents."]
    pub dev_addr_length: usize,
    #[doc = " Iface address length. If not provided, the transport will assume a\n default minimum length according to the address buffer contents."]
    pub iface_addr_length: usize,
}
#[test]
fn bindgen_test_layout_uct_ep_params() {
    const UNINIT: ::std::mem::MaybeUninit<uct_ep_params> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<uct_ep_params>(),
        160usize,
        concat!("Size of: ", stringify!(uct_ep_params))
    );
    assert_eq!(
        ::std::mem::align_of::<uct_ep_params>(),
        8usize,
        concat!("Alignment of ", stringify!(uct_ep_params))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).field_mask) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_ep_params),
            "::",
            stringify!(field_mask)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iface) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_ep_params),
            "::",
            stringify!(iface)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).user_data) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_ep_params),
            "::",
            stringify!(user_data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dev_addr) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_ep_params),
            "::",
            stringify!(dev_addr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iface_addr) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_ep_params),
            "::",
            stringify!(iface_addr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sockaddr) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_ep_params),
            "::",
            stringify!(sockaddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sockaddr_cb_flags) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_ep_params),
            "::",
            stringify!(sockaddr_cb_flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sockaddr_pack_cb) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_ep_params),
            "::",
            stringify!(sockaddr_pack_cb)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cm) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_ep_params),
            "::",
            stringify!(cm)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).conn_request) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_ep_params),
            "::",
            stringify!(conn_request)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sockaddr_cb_client) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_ep_params),
            "::",
            stringify!(sockaddr_cb_client)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sockaddr_cb_server) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_ep_params),
            "::",
            stringify!(sockaddr_cb_server)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).disconnect_cb) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_ep_params),
            "::",
            stringify!(disconnect_cb)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).path_index) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_ep_params),
            "::",
            stringify!(path_index)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cm_resolve_cb) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_ep_params),
            "::",
            stringify!(cm_resolve_cb)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).private_data) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_ep_params),
            "::",
            stringify!(private_data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).private_data_length) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_ep_params),
            "::",
            stringify!(private_data_length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).local_sockaddr) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_ep_params),
            "::",
            stringify!(local_sockaddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dev_addr_length) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_ep_params),
            "::",
            stringify!(dev_addr_length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iface_addr_length) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_ep_params),
            "::",
            stringify!(iface_addr_length)
        )
    );
}
#[doc = " @ingroup UCT_CLIENT_SERVER\n @brief Parameters for connecting a UCT endpoint by @ref uct_ep_connect."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uct_ep_connect_params {
    #[doc = " Mask of valid fields in this structure, using bits from\n @ref uct_ep_connect_params_field. Fields not specified by this mask\n will be ignored."]
    pub field_mask: u64,
    #[doc = " User's private data to be passed from client to server."]
    pub private_data: *const ::std::os::raw::c_void,
    #[doc = " Length of @ref uct_ep_connect_params::private_data, the maximal allowed\n value is indicated by the @ref uct_cm_attr::max_conn_priv."]
    pub private_data_length: usize,
}
#[test]
fn bindgen_test_layout_uct_ep_connect_params() {
    const UNINIT: ::std::mem::MaybeUninit<uct_ep_connect_params> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<uct_ep_connect_params>(),
        24usize,
        concat!("Size of: ", stringify!(uct_ep_connect_params))
    );
    assert_eq!(
        ::std::mem::align_of::<uct_ep_connect_params>(),
        8usize,
        concat!("Alignment of ", stringify!(uct_ep_connect_params))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).field_mask) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_ep_connect_params),
            "::",
            stringify!(field_mask)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).private_data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_ep_connect_params),
            "::",
            stringify!(private_data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).private_data_length) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_ep_connect_params),
            "::",
            stringify!(private_data_length)
        )
    );
}
#[doc = " @ingroup UCT_CLIENT_SERVER\n @brief Connection manager attributes, capabilities and limitations."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uct_cm_attr {
    #[doc = " Mask of valid fields in this structure, using bits from\n @ref uct_cm_attr_field. Fields not specified by this mask\n will be ignored."]
    pub field_mask: u64,
    #[doc = " Max size of the connection manager's private data used for connection\n establishment with sockaddr."]
    pub max_conn_priv: usize,
}
#[test]
fn bindgen_test_layout_uct_cm_attr() {
    const UNINIT: ::std::mem::MaybeUninit<uct_cm_attr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<uct_cm_attr>(),
        16usize,
        concat!("Size of: ", stringify!(uct_cm_attr))
    );
    assert_eq!(
        ::std::mem::align_of::<uct_cm_attr>(),
        8usize,
        concat!("Alignment of ", stringify!(uct_cm_attr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).field_mask) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_cm_attr),
            "::",
            stringify!(field_mask)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_conn_priv) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_cm_attr),
            "::",
            stringify!(max_conn_priv)
        )
    );
}
#[doc = " @ingroup UCT_CLIENT_SERVER\n @brief UCT listener attributes, capabilities and limitations."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uct_listener_attr {
    #[doc = " Mask of valid fields in this structure, using bits from\n @ref uct_listener_attr_field. Fields not specified by this mask\n will be ignored."]
    pub field_mask: u64,
    #[doc = " Sockaddr on which this listener is listening."]
    pub sockaddr: sockaddr_storage,
}
#[test]
fn bindgen_test_layout_uct_listener_attr() {
    const UNINIT: ::std::mem::MaybeUninit<uct_listener_attr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<uct_listener_attr>(),
        136usize,
        concat!("Size of: ", stringify!(uct_listener_attr))
    );
    assert_eq!(
        ::std::mem::align_of::<uct_listener_attr>(),
        8usize,
        concat!("Alignment of ", stringify!(uct_listener_attr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).field_mask) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_listener_attr),
            "::",
            stringify!(field_mask)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sockaddr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_listener_attr),
            "::",
            stringify!(sockaddr)
        )
    );
}
#[doc = " @ingroup UCT_CLIENT_SERVER\n @brief Parameters for creating a listener object @ref uct_listener_h by\n @ref uct_listener_create"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uct_listener_params {
    #[doc = " Mask of valid fields in this structure, using bits from\n @ref uct_listener_params_field. Fields not specified by this mask\n will be ignored."]
    pub field_mask: u64,
    #[doc = " Backlog of incoming connection requests. If specified, must be a positive value.\n If not specified, each CM component will use its maximal allowed value,\n based on the system's setting."]
    pub backlog: ::std::os::raw::c_int,
    #[doc = " Callback function for handling incoming connection requests."]
    pub conn_request_cb: uct_cm_listener_conn_request_callback_t,
    #[doc = " User data associated with the listener."]
    pub user_data: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_uct_listener_params() {
    const UNINIT: ::std::mem::MaybeUninit<uct_listener_params> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<uct_listener_params>(),
        32usize,
        concat!("Size of: ", stringify!(uct_listener_params))
    );
    assert_eq!(
        ::std::mem::align_of::<uct_listener_params>(),
        8usize,
        concat!("Alignment of ", stringify!(uct_listener_params))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).field_mask) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_listener_params),
            "::",
            stringify!(field_mask)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).backlog) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_listener_params),
            "::",
            stringify!(backlog)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).conn_request_cb) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_listener_params),
            "::",
            stringify!(conn_request_cb)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).user_data) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_listener_params),
            "::",
            stringify!(user_data)
        )
    );
}
#[doc = " @ingroup UCT_MD\n @brief  Memory domain attributes.\n\n This structure defines the attributes of a Memory Domain which includes\n maximum memory that can be allocated, credentials required for accessing the memory,\n CPU mask indicating the proximity of CPUs, and bitmaps indicating the types\n of memory (CPU/CUDA/ROCM) that can be detected, allocated and accessed."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uct_md_attr {
    pub cap: uct_md_attr__bindgen_ty_1,
    #[doc = "< Memory registration cost estimation\n(time,seconds) as a linear function\nof the buffer size."]
    pub reg_cost: ucs_linear_func_t,
    #[doc = "< Component name"]
    pub component_name: [::std::os::raw::c_char; 16usize],
    #[doc = "< Size of buffer needed for packed rkey"]
    pub rkey_packed_size: usize,
    #[doc = "< Mask of CPUs near the resource"]
    pub local_cpus: ucs_cpu_set_t,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uct_md_attr__bindgen_ty_1 {
    #[doc = "< Maximal allocation size"]
    pub max_alloc: u64,
    #[doc = "< Maximal registration size"]
    pub max_reg: usize,
    #[doc = "< UCT_MD_FLAG_xx"]
    pub flags: u64,
    #[doc = "< Bitmap of memory types that Memory Domain can be registered with"]
    pub reg_mem_types: u64,
    #[doc = "< Bitmap of memory types that Memory Domain can detect if address belongs to it"]
    pub detect_mem_types: u64,
    #[doc = "< Bitmap of memory types that Memory Domain can allocate memory on"]
    pub alloc_mem_types: u64,
    #[doc = "< Memory types that Memory Domain can access"]
    pub access_mem_types: u64,
}
#[test]
fn bindgen_test_layout_uct_md_attr__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<uct_md_attr__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<uct_md_attr__bindgen_ty_1>(),
        56usize,
        concat!("Size of: ", stringify!(uct_md_attr__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<uct_md_attr__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(uct_md_attr__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_alloc) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_md_attr__bindgen_ty_1),
            "::",
            stringify!(max_alloc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_reg) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_md_attr__bindgen_ty_1),
            "::",
            stringify!(max_reg)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_md_attr__bindgen_ty_1),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reg_mem_types) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_md_attr__bindgen_ty_1),
            "::",
            stringify!(reg_mem_types)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).detect_mem_types) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_md_attr__bindgen_ty_1),
            "::",
            stringify!(detect_mem_types)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).alloc_mem_types) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_md_attr__bindgen_ty_1),
            "::",
            stringify!(alloc_mem_types)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).access_mem_types) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_md_attr__bindgen_ty_1),
            "::",
            stringify!(access_mem_types)
        )
    );
}
#[test]
fn bindgen_test_layout_uct_md_attr() {
    const UNINIT: ::std::mem::MaybeUninit<uct_md_attr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<uct_md_attr>(),
        224usize,
        concat!("Size of: ", stringify!(uct_md_attr))
    );
    assert_eq!(
        ::std::mem::align_of::<uct_md_attr>(),
        8usize,
        concat!("Alignment of ", stringify!(uct_md_attr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cap) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_md_attr),
            "::",
            stringify!(cap)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reg_cost) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_md_attr),
            "::",
            stringify!(reg_cost)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).component_name) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_md_attr),
            "::",
            stringify!(component_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rkey_packed_size) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_md_attr),
            "::",
            stringify!(rkey_packed_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).local_cpus) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_md_attr),
            "::",
            stringify!(local_cpus)
        )
    );
}
impl uct_md_mem_attr_field {
    #[doc = " Indicate if memory type is populated. E.g. CPU/GPU"]
    pub const UCT_MD_MEM_ATTR_FIELD_MEM_TYPE: uct_md_mem_attr_field = uct_md_mem_attr_field(1);
}
impl uct_md_mem_attr_field {
    #[doc = " Indicate if details of system device backing the pointer are populated.\n For example: GPU device, NUMA domain, etc."]
    pub const UCT_MD_MEM_ATTR_FIELD_SYS_DEV: uct_md_mem_attr_field = uct_md_mem_attr_field(2);
}
impl uct_md_mem_attr_field {
    #[doc = " Request base address of the allocation to which the buffer belongs."]
    pub const UCT_MD_MEM_ATTR_FIELD_BASE_ADDRESS: uct_md_mem_attr_field = uct_md_mem_attr_field(4);
}
impl uct_md_mem_attr_field {
    #[doc = " Request the whole length of the allocation to which the buffer belongs."]
    pub const UCT_MD_MEM_ATTR_FIELD_ALLOC_LENGTH: uct_md_mem_attr_field = uct_md_mem_attr_field(8);
}
impl uct_md_mem_attr_field {
    #[doc = " Request a cross-device dmabuf file descriptor that represents a memory\n region, and can be used to register the region with another memory\n domain."]
    pub const UCT_MD_MEM_ATTR_FIELD_DMABUF_FD: uct_md_mem_attr_field = uct_md_mem_attr_field(16);
}
impl uct_md_mem_attr_field {
    #[doc = " Request the offset of the provided virtual address relative to the\n beginning of its backing dmabuf region."]
    pub const UCT_MD_MEM_ATTR_FIELD_DMABUF_OFFSET: uct_md_mem_attr_field =
        uct_md_mem_attr_field(32);
}
impl ::std::ops::BitOr<uct_md_mem_attr_field> for uct_md_mem_attr_field {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        uct_md_mem_attr_field(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for uct_md_mem_attr_field {
    #[inline]
    fn bitor_assign(&mut self, rhs: uct_md_mem_attr_field) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<uct_md_mem_attr_field> for uct_md_mem_attr_field {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        uct_md_mem_attr_field(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for uct_md_mem_attr_field {
    #[inline]
    fn bitand_assign(&mut self, rhs: uct_md_mem_attr_field) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[doc = " @ingroup UCT_MD\n @brief UCT MD memory attributes field mask\n\n The enumeration allows specifying which fields in @ref uct_md_mem_attr_t\n are present."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct uct_md_mem_attr_field(pub ::std::os::raw::c_uint);
#[doc = " @ingroup UCT_MD\n @brief UCT MD memory attributes field mask\n\n The enumeration allows specifying which fields in @ref uct_md_mem_attr_t\n are present."]
pub use self::uct_md_mem_attr_field as uct_md_mem_attr_field_t;
#[doc = " @ingroup UCT_MD\n @brief  Memory domain attributes.\n\n This structure defines the attributes of a memory pointer which may\n include the memory type of the pointer, and the system device that backs\n the pointer depending on the bit fields populated in field_mask."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uct_md_mem_attr {
    #[doc = " Mask of valid fields in this structure, using bits from\n @ref uct_md_mem_attr_field_t."]
    pub field_mask: u64,
    #[doc = " The type of memory. E.g. CPU/GPU memory or some other valid type.\n If the md does not support sys_dev query, then UCS_MEMORY_TYPE_UNKNOWN\n is returned."]
    pub mem_type: ucs_memory_type_t,
    #[doc = " Index of the system device on which the buffer resides. eg: NUMA/GPU\n If the md does not support sys_dev query, then UCS_SYS_DEVICE_ID_UNKNOWN\n is returned."]
    pub sys_dev: ucs_sys_device_t,
    #[doc = " Base address of the allocation to which the provided buffer belongs to.\n If the md not support base address query, then the pointer passed to\n uct_md_mem_query is returned as is."]
    pub base_address: *mut ::std::os::raw::c_void,
    #[doc = " Length of the whole allocation to which the provided buffer belongs to.\n If the md not support querying allocation length, then the length passed\n to uct_md_mem_query is returned as is."]
    pub alloc_length: usize,
    #[doc = " Dmabuf file descriptor to expose memory regions across devices. Refer\n (https://01.org/linuxgraphics/gfx-docs/drm/driver-api/dma-buf.html).\n If the md does not support querying the fd object associated with the\n region, then dmabuf_fd is set to UCT_DMABUF_FD_INVALID by\n uct_md_mem_query(). It is the responsibility of the user to close the\n returned fd using close (2) when it's no longer needed."]
    pub dmabuf_fd: ::std::os::raw::c_int,
    #[doc = " Offset of the given address from the start of the memory region\n (identified by dmabuf_fd) backing the memory region being queried."]
    pub dmabuf_offset: usize,
}
#[test]
fn bindgen_test_layout_uct_md_mem_attr() {
    const UNINIT: ::std::mem::MaybeUninit<uct_md_mem_attr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<uct_md_mem_attr>(),
        48usize,
        concat!("Size of: ", stringify!(uct_md_mem_attr))
    );
    assert_eq!(
        ::std::mem::align_of::<uct_md_mem_attr>(),
        8usize,
        concat!("Alignment of ", stringify!(uct_md_mem_attr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).field_mask) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_md_mem_attr),
            "::",
            stringify!(field_mask)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mem_type) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_md_mem_attr),
            "::",
            stringify!(mem_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sys_dev) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_md_mem_attr),
            "::",
            stringify!(sys_dev)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).base_address) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_md_mem_attr),
            "::",
            stringify!(base_address)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).alloc_length) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_md_mem_attr),
            "::",
            stringify!(alloc_length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dmabuf_fd) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_md_mem_attr),
            "::",
            stringify!(dmabuf_fd)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dmabuf_offset) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_md_mem_attr),
            "::",
            stringify!(dmabuf_offset)
        )
    );
}
#[doc = " @ingroup UCT_MD\n @brief  Memory domain attributes.\n\n This structure defines the attributes of a memory pointer which may\n include the memory type of the pointer, and the system device that backs\n the pointer depending on the bit fields populated in field_mask."]
pub type uct_md_mem_attr_t = uct_md_mem_attr;
extern "C" {
    #[doc = " @ingroup UCT_MD\n @brief Query attributes of a given pointer\n\n Return attributes such as memory type, base address, allocation length,\n and system device for the given pointer of specific length.\n\n @param [in]     md          Memory domain to run the query on. This function\n                             returns an error if the md does not recognize the\n                             pointer.\n @param [in]     address     The address of the pointer. Must be non-NULL\n                             else UCS_ERR_INVALID_PARAM error is returned.\n @param [in]     length      Length of the memory region to examine.\n                             Must be nonzero else UCS_ERR_INVALID_PARAM error\n                             is returned.\n @param [inout]  mem_attr    If successful, filled with ptr attributes.\n\n @return UCS_OK if at least one attribute is successfully queried otherwise\n         an error code as defined by @ref ucs_status_t is returned."]
    pub fn uct_md_mem_query(
        md: uct_md_h,
        address: *const ::std::os::raw::c_void,
        length: usize,
        mem_attr: *mut uct_md_mem_attr_t,
    ) -> ucs_status_t;
}
#[doc = " @ingroup UCT_MD\n @brief Describes a memory allocated by UCT.\n\n This structure describes the memory block which includes the address, size, and\n Memory Domain used for allocation. This structure is passed to interface\n and the memory is allocated by memory allocation functions @ref uct_mem_alloc."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uct_allocated_memory {
    #[doc = "< Address of allocated memory"]
    pub address: *mut ::std::os::raw::c_void,
    #[doc = "< Real size of allocated memory"]
    pub length: usize,
    #[doc = "< Method used to allocate the memory"]
    pub method: uct_alloc_method_t,
    #[doc = "< type of allocated memory"]
    pub mem_type: ucs_memory_type_t,
    #[doc = "< if method==MD: MD used to allocate the memory"]
    pub md: uct_md_h,
    #[doc = "< if method==MD: MD memory handle"]
    pub memh: uct_mem_h,
}
#[test]
fn bindgen_test_layout_uct_allocated_memory() {
    const UNINIT: ::std::mem::MaybeUninit<uct_allocated_memory> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<uct_allocated_memory>(),
        40usize,
        concat!("Size of: ", stringify!(uct_allocated_memory))
    );
    assert_eq!(
        ::std::mem::align_of::<uct_allocated_memory>(),
        8usize,
        concat!("Alignment of ", stringify!(uct_allocated_memory))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).address) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_allocated_memory),
            "::",
            stringify!(address)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).length) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_allocated_memory),
            "::",
            stringify!(length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).method) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_allocated_memory),
            "::",
            stringify!(method)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mem_type) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_allocated_memory),
            "::",
            stringify!(mem_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).md) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_allocated_memory),
            "::",
            stringify!(md)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).memh) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_allocated_memory),
            "::",
            stringify!(memh)
        )
    );
}
#[doc = " @ingroup UCT_MD\n @brief Describes a memory allocated by UCT.\n\n This structure describes the memory block which includes the address, size, and\n Memory Domain used for allocation. This structure is passed to interface\n and the memory is allocated by memory allocation functions @ref uct_mem_alloc."]
pub type uct_allocated_memory_t = uct_allocated_memory;
#[doc = " @ingroup UCT_MD\n @brief Remote key with its type\n\n This structure describes the credentials (typically key) and information\n required to access the remote memory by the communication interfaces."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uct_rkey_bundle {
    #[doc = "< Remote key descriptor, passed to RMA functions"]
    pub rkey: uct_rkey_t,
    #[doc = "< Handle, used internally for releasing the key"]
    pub handle: *mut ::std::os::raw::c_void,
    #[doc = "< Remote key type"]
    pub type_: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_uct_rkey_bundle() {
    const UNINIT: ::std::mem::MaybeUninit<uct_rkey_bundle> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<uct_rkey_bundle>(),
        24usize,
        concat!("Size of: ", stringify!(uct_rkey_bundle))
    );
    assert_eq!(
        ::std::mem::align_of::<uct_rkey_bundle>(),
        8usize,
        concat!("Alignment of ", stringify!(uct_rkey_bundle))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rkey) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_rkey_bundle),
            "::",
            stringify!(rkey)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handle) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_rkey_bundle),
            "::",
            stringify!(handle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_rkey_bundle),
            "::",
            stringify!(type_)
        )
    );
}
#[doc = " @ingroup UCT_MD\n @brief Remote key with its type\n\n This structure describes the credentials (typically key) and information\n required to access the remote memory by the communication interfaces."]
pub type uct_rkey_bundle_t = uct_rkey_bundle;
#[doc = " @ingroup UCT_RESOURCE\n @brief Completion handle.\n\n This structure should be allocated by the user and can be passed to communication\n primitives. The user must initialize all fields of the structure.\n  If the operation returns UCS_INPROGRESS, this structure will be in use by the\n transport until the operation completes. When the operation completes, \"count\"\n field is decremented by 1, and whenever it reaches 0 - the callback is called.\n\n Notes:\n  - The same structure can be passed multiple times to communication functions\n    without the need to wait for completion.\n  - If the number of operations is smaller than the initial value of the counter,\n    the callback will not be called at all, so it may be left undefined.\n  - status field is required to track the first time the error occurred, and\n    report it via a callback when count reaches 0."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uct_completion {
    #[doc = "< User callback function"]
    pub func: uct_completion_callback_t,
    #[doc = "< Completion counter"]
    pub count: ::std::os::raw::c_int,
    #[doc = "< Completion status, this field must\nbe initialized with UCS_OK before\nfirst operation is started."]
    pub status: ucs_status_t,
}
#[test]
fn bindgen_test_layout_uct_completion() {
    const UNINIT: ::std::mem::MaybeUninit<uct_completion> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<uct_completion>(),
        16usize,
        concat!("Size of: ", stringify!(uct_completion))
    );
    assert_eq!(
        ::std::mem::align_of::<uct_completion>(),
        8usize,
        concat!("Alignment of ", stringify!(uct_completion))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).func) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_completion),
            "::",
            stringify!(func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).count) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_completion),
            "::",
            stringify!(count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_completion),
            "::",
            stringify!(status)
        )
    );
}
#[doc = " @ingroup UCT_RESOURCE\n @brief Pending request.\n\n This structure should be passed to @ref uct_ep_pending_add() and is used to signal\n new available resources back to user."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uct_pending_req {
    #[doc = "< User callback function"]
    pub func: uct_pending_callback_t,
    #[doc = "< Used internally by UCT"]
    pub priv_: [::std::os::raw::c_char; 40usize],
}
#[test]
fn bindgen_test_layout_uct_pending_req() {
    const UNINIT: ::std::mem::MaybeUninit<uct_pending_req> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<uct_pending_req>(),
        48usize,
        concat!("Size of: ", stringify!(uct_pending_req))
    );
    assert_eq!(
        ::std::mem::align_of::<uct_pending_req>(),
        8usize,
        concat!("Alignment of ", stringify!(uct_pending_req))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).func) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_pending_req),
            "::",
            stringify!(func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).priv_) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_pending_req),
            "::",
            stringify!(priv_)
        )
    );
}
#[doc = " @ingroup UCT_TAG\n @brief Posted tag context.\n\n Tag context is an object which tracks a tag posted to the transport. It\n contains callbacks for matching events on this tag."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uct_tag_context {
    #[doc = " Tag is consumed by the transport and should not be matched in software.\n\n @param [in]  self    Pointer to relevant context structure, which was\n                      initially passed to @ref uct_iface_tag_recv_zcopy."]
    pub tag_consumed_cb: ::std::option::Option<unsafe extern "C" fn(self_: *mut uct_tag_context_t)>,
    #[doc = " Tag processing is completed by the transport.\n\n @param [in]  self        Pointer to relevant context structure, which was\n                          initially passed to @ref uct_iface_tag_recv_zcopy.\n @param [in]  stag        Tag from sender.\n @param [in]  imm         Immediate data from sender. For rendezvous, it's always 0.\n @param [in]  length      Completed length.\n @param [in]  inline_data If non-null, points to a temporary buffer which contains\nthe received data. In this case the received data was not\nplaced directly in the receive buffer. This callback routine\nis responsible for copy-out the inline data, otherwise it is\nreleased.\n @param [in]  status  Completion status:\n (a)   UCS_OK - Success, data placed in provided buffer.\n (b)   UCS_ERR_TRUNCATED - Sender's length exceed posted\nbuffer, no data is copied.\n (c)   UCS_ERR_CANCELED - Canceled by user."]
    pub completed_cb: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut uct_tag_context_t,
            stag: uct_tag_t,
            imm: u64,
            length: usize,
            inline_data: *mut ::std::os::raw::c_void,
            status: ucs_status_t,
        ),
    >,
    #[doc = " Tag was matched by a rendezvous request, which should be completed by\n the protocol layer.\n\n @param [in]  self          Pointer to relevant context structure, which was\n                            initially passed to @ref uct_iface_tag_recv_zcopy.\n @param [in]  stag          Tag from sender.\n @param [in]  header        User defined header.\n @param [in]  header_length User defined header length in bytes.\n @param [in]  status        Completion status.\n @param [in]  flags         Flags defined by UCT_TAG_RECV_CB_xx."]
    pub rndv_cb: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut uct_tag_context_t,
            stag: uct_tag_t,
            header: *const ::std::os::raw::c_void,
            header_length: ::std::os::raw::c_uint,
            status: ucs_status_t,
            flags: ::std::os::raw::c_uint,
        ),
    >,
    #[doc = " A placeholder for the private data used by the transport"]
    pub priv_: [::std::os::raw::c_char; 32usize],
}
#[test]
fn bindgen_test_layout_uct_tag_context() {
    const UNINIT: ::std::mem::MaybeUninit<uct_tag_context> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<uct_tag_context>(),
        56usize,
        concat!("Size of: ", stringify!(uct_tag_context))
    );
    assert_eq!(
        ::std::mem::align_of::<uct_tag_context>(),
        8usize,
        concat!("Alignment of ", stringify!(uct_tag_context))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tag_consumed_cb) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_tag_context),
            "::",
            stringify!(tag_consumed_cb)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).completed_cb) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_tag_context),
            "::",
            stringify!(completed_cb)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rndv_cb) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_tag_context),
            "::",
            stringify!(rndv_cb)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).priv_) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(uct_tag_context),
            "::",
            stringify!(priv_)
        )
    );
}
pub const UCT_TAG_RECV_CB_INLINE_DATA: _bindgen_ty_7 = _bindgen_ty_7::UCT_TAG_RECV_CB_INLINE_DATA;
#[repr(u32)]
#[doc = " @ingroup UCT_RESOURCE\n @brief flags of @ref uct_tag_context."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_7 {
    UCT_TAG_RECV_CB_INLINE_DATA = 1,
}
extern "C" {
    pub static mut uct_alloc_method_names: [*const ::std::os::raw::c_char; 0usize];
}
extern "C" {
    pub static mut uct_device_type_names: [*const ::std::os::raw::c_char; 0usize];
}
extern "C" {
    #[doc = " @ingroup UCT_RESOURCE\n @brief Query for list of components.\n\n Obtain the list of transport components available on the current system.\n\n @param [out] components_p      Filled with a pointer to an array of component\n                                handles.\n @param [out] num_components_p  Filled with the number of elements in the array.\n\n @return UCS_OK if successful, or UCS_ERR_NO_MEMORY if failed to allocate the\n         array of component handles."]
    pub fn uct_query_components(
        components_p: *mut *mut uct_component_h,
        num_components_p: *mut ::std::os::raw::c_uint,
    ) -> ucs_status_t;
}
extern "C" {
    #[doc = " @ingroup UCT_RESOURCE\n @brief Release the list of components returned from @ref uct_query_components.\n\n This routine releases the memory associated with the list of components\n allocated by @ref uct_query_components.\n\n @param [in] components  Array of component handles to release."]
    pub fn uct_release_component_list(components: *mut uct_component_h);
}
extern "C" {
    #[doc = " @ingroup UCT_RESOURCE\n @brief Get component attributes\n\n Query various attributes of a component.\n\n @param [in] component          Component handle to query attributes for. The\n                                handle can be obtained from @ref uct_query_components.\n @param [inout] component_attr  Filled with component attributes.\n\n @return UCS_OK if successful, or nonzero error code in case of failure."]
    pub fn uct_component_query(
        component: uct_component_h,
        component_attr: *mut uct_component_attr_t,
    ) -> ucs_status_t;
}
extern "C" {
